{
  "key.modernfix": "ModernFix",
  "key.modernfix.config": "Konfigurationsbildschirm öffnen",
  "modernfix.jei_load": "Lade JEI, dies kann eine Weile dauern",
  "modernfix.no_lazydfu": "LazyDFU ist nicht installiert. Wenn Minecraft Spieldaten von einer älteren Version aktualisieren muss, kann es zu spürbaren Verzögerungen kommen.",
  "modernfix.no_ferritecore": "FerriteCore ist nicht installiert. Der Speicherverbrauch wird sehr hoch sein.",
  "modernfix.connectedness_dynresoruces": "Connectedness und die Option für dynamische Ressourcen von ModernFix sind nicht kompatibel. Entfernen Sie Connectedness oder deaktivieren Sie dynamische Ressourcen in der ModernFix-Konfiguration.",
  "modernfix.perf_mod_warning": "Es wird empfohlen, die Mods zu installieren, die Warnung(en) können jedoch in der ModernFix-Konfiguration deaktiviert werden.",
  "modernfix.config": "ModernFix-Mixin-Konfiguration",
  "modernfix.config.done_restart": "Fertig (Neustart erforderlich)",
  "modernfix.config.wiki": "Wiki öffnen",
  "modernfix.message.reload_config": "Es wurde eine Änderung der Mod-Konfigurationsdatei erkannt. Um zu verhindern, dass Dateien geladen werden, deren Speicherung noch nicht abgeschlossen ist, muss das erneute Laden durch Ausführen von /mfrc ausgelöst werden.",
  "modernfix.option.on": "an",
  "modernfix.option.off": "aus",
  "modernfix.option.disabled": "deaktiviert",
  "modernfix.option.enabled": "aktiviert",
  "modernfix.option.mod_override": " von Mods [%s]",
  "modernfix.config.not_default": " (geändert)",
  "asynclocator.map.locating": "Karte (Lokalisierung...)",
  "asynclocator.map.none": "Karte (Keine Funktion in der Nähe gefunden)",
  "modernfix.option.category.performance": "Leistung",
  "modernfix.option.category.performance.description": "Funktionen, die zur Verbesserung der Spiel-/Startleistung beitragen",
  "modernfix.option.category.bugfixes": "Fehlerbehebungen",
  "modernfix.option.category.bugfixes.description": "Kernfehlerbehebungen zur Verbesserung der Spielstabilität",
  "modernfix.option.category.troubleshooting": "Fehlerbehebung/Dienstprogramme",
  "modernfix.option.category.troubleshooting.description": "Funktionen, die bei der Diagnose von Problemen helfen sollen",
  "modernfix.option.category.expert_only": "Nur für Experten",
  "modernfix.option.category.expert_only.description": "Ändern Sie nichts, es sei denn, Sie wissen, was Sie tun",
  "modernfix.option.name.mixin.perf.async_jei": "Laden von JEI im Hintergrund",
  "modernfix.option.mixin.perf.async_jei": "Nur 1,16. **Eine wichtige Optimierung.** Patcht JEI so, dass es das Neuladen in einem Hintergrundthread durchführt, wodurch die lange Verzögerung, die es beim Weltladen mit sich bringt, vollständig eliminiert wird.",
  "modernfix.option.mixin.perf.async_locator": "Nur 1,16. Portiert die Patches des Async Locator-Mods zurück, um Serverabstürze im Zusammenhang mit „/locate“, der Generierung von Beutetabellen usw. zu verhindern.",
  "modernfix.option.mixin.perf.biome_zoomer": "Nur 1,16. Kleinere Optimierung zur Verbesserung der Leistung des Biome-Zoomers unter Verwendung der Logik von 1.18.",
  "modernfix.option.mixin.perf.blast_search_trees": "Alle Versionen. Wenn REI oder JEI installiert sind, ist die Erstellung der Vanilla-Suchbäume für die kreative Suche deaktiviert und die Suche erfolgt stattdessen mithilfe der Suchimplementierungen dieser Mods. Dies spart beim Laden der Welt mehrere Sekunden und wahrscheinlich auch etwas RAM (obwohl ich es nicht gemessen habe).",
  "modernfix.option.mixin.perf.boost_worker_count": "Nur 1,16. Entfernt die fest codierte Obergrenze für die Anzahl der Worker-Threads, ähnlich wie Mojang es in 1.18 getan hat.",
  "modernfix.option.mixin.perf.cache_blockstate_cache_arrays": "Alle Versionen. Vermeidet das Erstellen neuer Kopien von Enum-Arrays bei jeder Initialisierung eines Blockstatus-Cache. Kleinere Optimierung, aber einfach durchzuführen.",
  "modernfix.option.mixin.perf.cache_model_materials": "Alle Versionen. Merkt sich die „RenderMaterial“-Sammlung (Textur) und die Abhängigkeitsliste, die Modelle zurückgeben, anstatt dass sie bei jeder Anfrage neu berechnet werden müssen. Hilft, den Lade-/Backvorgang des Modells zu beschleunigen.",
  "modernfix.option.mixin.perf.cache_strongholds": "Alle Versionen. Speichert die generierte Liste der Festungspositionen mit der Welt, anstatt sie bei jedem Laden der Welt neu zu generieren. Spart ein wenig Zeit bei 1.16 und deutlich mehr bei 1.18 und 1.19.",
  "modernfix.option.mixin.perf.cache_upgraded_structures": "Alle Versionen. Viele Mods liefern veraltete Strukturdateien aus, weshalb das Spiel sie bei jedem Laden mithilfe von DFU aktualisieren muss. Das kann ziemlich langsam sein. Dieser Patch fügt Logik hinzu, um stattdessen die aktualisierte Version der Struktur zu speichern und sie beim nächsten Laden wiederzuverwenden. Um den Fall zu bewältigen, dass der Mod eine Strukturdatei ändert, aber nicht den Namen, wird der Hash der Originaldatei mit der zwischengespeicherten Version verglichen und wenn sie nicht übereinstimmen, wird die Struktur erneut aktualisiert.",
  "modernfix.option.mixin.perf.compress_biome_container": "Nur 1,16. Kleinere Optimierungen, die von Hydrogen übernommen wurden und versuchen, nach Möglichkeit Platz im Biombehälter zu sparen. Dies wird automatisch deaktiviert, wenn widersprüchliche Mods wie BetterEnd oder Chocolate installiert sind.",
  "modernfix.option.mixin.perf.datapack_reload_exceptions": "Alle Versionen. Reduziert Protokoll-Spam und verbessert möglicherweise die Ladegeschwindigkeit geringfügig, indem die Stacktraces für einige häufig ausgelöste Ausnahmen beim Neuladen von Datenpaketen nicht gedruckt werden (z. B. fehlende Elemente in Beutetabellen/Rezepten). Die Nachricht wird weiterhin gedruckt.",
  "modernfix.option.mixin.perf.dedicated_reload_executor": "Alle Versionen. Verschiebt das Neuladen von Ressourcenpaketen und Datenpaketen in einen dedizierten Worker-Pool, anstatt die standardmäßigen „Worker-Main“-Threads zu verwenden. Dadurch können Mods durch Smooth Boot die Einzelspieler-Leistung zur Laufzeit potenziell verbessern, ohne den Start aufgrund einer begrenzten Thread-Anzahl zu verlangsamen.",
  "modernfix.option.mixin.perf.deduplicate_location": "Alle Versionen, jedoch aufgrund von Auswirkungen auf die Ladezeit standardmäßig deaktiviert. Dedupliziert Ressourcenstandort-Namespaces und -Pfade. Dies spart RAM, erhöht aber auch die Kosten für die Erstellung einer neuen „ResourceLocation“ um einiges.",
  "modernfix.option.mixin.perf.dynamic_dfu": "Alle Versionen. Ändert die DFU-Initialisierung so, dass sie zum ersten Mal erfolgt, wenn etwas aktualisiert werden muss. Das klingt ähnlich wie LazyDFU, ist aber deutlich implementiert, da es das Laden *irgendeiner* DFU-Klassen/Datenstrukturen vermeidet, während LazyDFU nur die Regeloptimierung deaktiviert. Im Wesentlichen handelt es sich bei dieser Option um eine sicherere Version von DataFixerSlayer, da sie bei Bedarf weiterhin DFU lädt.\n\nNormalerweise sollten Sie LazyDFU auch dann weiterhin verwenden, wenn diese Option aktiviert ist, da es sonst bei der DFU-Regeloptimierung zu Verzögerungen kommt.",
  "modernfix.option.mixin.perf.dynamic_resources": "Alle Versionen. Siehe https://github.com/embeddedt/ModernFix/wiki/Dynamic-Resources-FAQ.",
  "modernfix.option.mixin.perf.dynamic_sounds": "Alle Versionen. Ermöglicht dem Spiel, Sounds zu entladen, anstatt dass Sounds nach dem Laden auf unbestimmte Zeit bestehen bleiben.",
  "modernfix.option.mixin.perf.dynamic_structure_manager": "Alle Versionen. Ermöglicht dem Spiel, Strukturdateien nach Abschluss der Generierung zu entladen, anstatt sie für immer geladen zu lassen.",
  "modernfix.option.mixin.perf.fast_registry_validation": "Alle Versionen. Forge sucht bei jeder Validierung einer Registrierung unnötigerweise per Reflektion nach einer Methode. Dieser Patch speichert den zurückgegebenen Wert einfach zwischen, da er jedes Mal derselbe ist.",
  "modernfix.option.mixin.perf.faster_font_loading": "Alle Versionen. Optimiert den Schriftarten-Renderer, um Schriftarten schneller zu laden und so das Nachladen von Ressourcen zu beschleunigen.",
  "modernfix.option.mixin.perf.faster_item_rendering": "Alle Versionen. Vermeidet das Rendern der Seiten von Elementen in GUIs. (Ja, Vanille scheint das zu tun.)\n\nDies kann die FPS verdreifachen, wenn ein Mod wie REI/JEI auf schwächeren GPUs installiert ist, sofern genügend Elemente sichtbar sind. Standardmäßig deaktiviert, da es neu ist und nicht viel getestet wurde, aber sicher sein sollte. Das wahrscheinlichste Problem besteht darin, dass Elemente in GUIs völlig unsichtbar sind oder in der Welt flach erscheinen.",
  "modernfix.option.mixin.perf.faster_texture_loading": "Alle Versionen vor 1.19.4. Vermeidet das zweimalige Lesen von Texturen (beim ersten Mal mit einem sehr langsamen Codepfad) und führt stattdessen einen schnelleren Ladevorgang durch (ähnlich wie 1.19.3+).",
  "modernfix.option.mixin.perf.faster_texture_stitching": "Alle Versionen. Ermöglicht dem Spiel die Verwendung eines schnelleren Textur-Stitching-Systems, das ursprünglich von SuperCoder79 für lwjgl3ify in 1.7.10 geschrieben wurde, was beim Laden etwas Zeit sparen kann. In seltenen Fällen wurde berichtet, dass es seltsame Artefakte auf Blöcken oder in GUIs verursacht. Hierbei handelt es sich möglicherweise um einen Sodium-Fehler.",
  "modernfix.option.mixin.perf.jeresources_startup": "Nur 1,16. Optimiert gerade genug Ressourcen, um Dorfbewohner-Entitäten für denselben Beruf nicht unnötig viele Male neu zu erstellen, was beim JEI-Start Zeit spart.",
  "modernfix.option.mixin.perf.kubejs": "Nur 1,16. Optimierungen an KubeJS, um unnötiges „ItemStack“-Kopieren usw. zu vermeiden, was die Zeit zum Laden von Datenpaketen reduziert.",
  "modernfix.option.mixin.perf.model_optimizations": "Alle Versionen. Implementiert Optimierungen, um den Modellladevorgang zu beschleunigen.",
  "modernfix.option.mixin.perf.nbt_memory_usage": "Alle Versionen. Verwendet eine effizientere Backing Map für zusammengesetzte NBT-Tags, die Schlüsselnamen dedupliziert, und verwendet außerdem eine Array-Map für sehr kleine Verbindungen. Dies reduziert den Aufwand für die Speicherung vieler zusammengesetzter Tags im Speicher.",
  "modernfix.option.mixin.perf.nuke_empty_chunk_sections": "Nur 1.16, inspiriert von Wasserstoff. Vermeidet das Speichern von Chunk-Abschnitten, die voller Luft sind, im Speicher, sondern markiert sie stattdessen als leer.",
  "modernfix.option.mixin.perf.reduce_blockstate_cache_rebuilds": "Alle Versionen. **Eine wichtige Optimierung.** Neuere Minecraft-Versionen (nach 1.12) haben ein Blockstatus-Cache-System implementiert, das häufig verwendete Informationen über einen Blockstatus zwischenspeichert, z. B. ob er solide ist, seine Kollisionsform usw. Die Wiederherstellung dieses Caches erfolgt in Vanilla recht schnell (Es dauert nur ein oder zwei Sekunden), ist aber mit vielen installierten Mods ziemlich langsam, da im Spiel viel mehr Blockzustände vorhanden sind, deren Caches alle neu erstellt werden müssen.\n\nDieses Problem wird durch Forge noch verschärft, da der Cache an vielen Stellen neu erstellt wird, an denen die Daten vor dem nächsten Neuaufbau mit ziemlicher Sicherheit ungenutzt bleiben würden. Beispiele hierfür sind direkt vor dem Erreichen des Hauptmenüs (während der Phase „Daten einfrieren“) sowie mehrmals (!) beim Laden einer Welt.\n\nModernFix löst diesen Leistungsengpass, indem es stattdessen die Cache-Neuerstellung verzögert. Jeder Blockstatus baut seinen Cache neu auf, wenn zum ersten Mal auf die Daten zugegriffen wird. Wenn Vanilla oder Forge jederzeit versuchen würden, Caches für alle Blockzustände neu zu erstellen, wird dies umgeleitet, um stattdessen einfach den Cache für jeden Blockzustand ungültig zu machen.\n\nDies sollte nach Abschluss des Startvorgangs keine Auswirkungen auf TPS haben.",
  "modernfix.option.mixin.perf.remove_biome_temperature_cache": "Alle Versionen. Entfernt den Biomtemperatur-Cache, wie es Lithium bei modernen Versionen tut.",
  "modernfix.option.mixin.perf.resourcepacks": "Alle Versionen. **Eine wichtige Optimierung.** Der Start moderner Versionen wird durch den Dateisystemzugriff stark eingeschränkt. An Ressourcenpakete werden häufig viele Anfragen gestellt, um Ressourcen aufzulisten oder zu überprüfen, ob eine bestimmte Ressource vorhanden ist, und jede dieser Anfragen führt zu einem sehr langsamen Datei-API-Aufruf.\n\nModernFix beseitigt hier die meisten Engpässe vollständig, indem einfach eine Liste aller Ressourcen zwischengespeichert wird, die in von Mods bereitgestellten und Vanilla-Ressourcenpaketen vorhanden sind. Der Cache wird beim Neuladen der Ressourcen neu erstellt (mit Ausnahme der Vanilla-Ressourcen, da diese sich während der Ausführung des Spiels nie ändern sollten).\n\nEs sind keine Kompatibilitätsprobleme mit diesem Patch bekannt, mit Ausnahme von OptiFine (seine CTM-Ressourcen werden nicht korrekt geladen). Allerdings empfehle ich die Verwendung von OptiFine in keinem Szenario, da es die Startzeit allein um mehrere Minuten verlängert und überhaupt nicht mit ModernFix getestet wurde.",
  "modernfix.option.mixin.perf.reuse_datapacks": "Nur 1,16. Versucht, den Wechsel zwischen Einzelspielerwelten zu beschleunigen, indem das Neuladen des Datenpakets nach Möglichkeit übersprungen wird. Kann bei einigen Mods zu Kompatibilitätsproblemen führen, ist derzeit jedoch standardmäßig aktiviert.",
  "modernfix.option.mixin.perf.rewrite_registry": "Alle Versionen. **Derzeit halb defekt.** Ersetzt einige Interna des Forge-Registrierungssystems aggressiv durch schnellere Versionen, führt jedoch derzeit beim Laden einiger Modpacks zu Einfrierungen. Aus offensichtlichen Gründen standardmäßig deaktiviert.",
  "modernfix.option.mixin.perf.skip_first_datapack_reload": "Nur 1.16 und 1.19. **Eine wichtige Optimierung.**\n\nIn der Mitte des 1.16-Entwicklungszyklus hat Forge das Spiel so gepatcht, dass die Datenpakete beim Laden einer vorhandenen Welt zweimal neu geladen werden, um ein Problem mit der Verschiebung der Biom-ID zu beheben. Leider dauert das Neuladen von Datenpaketen oft mehr als 30 Sekunden, was die weltweiten Ladezeiten stark beeinträchtigt.\n\nModernFix nimmt die notwendigen Änderungen vor, um dieses Neuladen zu vermeiden, basierend auf der unvollendeten Forge PR #8163.\n\nDiese Änderung wurde von Forge in 1.18 entfernt, aber dann wurde in 1.19 *erneut* ein ähnlicher Patch hinzugefügt, um zu beheben, dass Mod-Datenpakete beim Erstellen neuer Einzelspieler-Welten nicht geladen wurden. Glücklicherweise ist das Problem in 1.19 auf den Welterstellungsbildschirm beschränkt, und bestehende Welten erfordern nur ein einziges Neuladen. Dies verdoppelt jedoch immer noch die Länge der Verzögerungsspitze, wenn in 1.19 auf „Neue Welt erstellen“ geklickt wird, und daher nimmt ModernFix erneut Änderungen vor, um kein redundantes Neuladen durchzuführen.",
  "modernfix.option.mixin.perf.state_definition_construct": "Alle Versionen. Nur aktiviert, wenn FerriteCore installiert ist. Nutzt die Handhabung von Blockzuständen durch FerriteCore, um deren Erstellung zu beschleunigen. Dies kann dazu beitragen, den Start von Mods zu beschleunigen, die viele Blockzustände hinzufügen, wie zum Beispiel Möbel-Mods.",
  "modernfix.option.mixin.perf.sync_executor_sleep": "Alle Versionen. Verhindert, dass der Hauptthread im Leerlauf läuft und einen CPU-Kern verbraucht, während er auf den Abschluss der Modloading-Worker wartet.",
  "modernfix.option.mixin.perf.thread_priorities": "Alle Versionen. Passt die Worker- und Server-Thread-Prioritäten so an, dass sie niedriger sind als die des Client-Threads. Dies trägt dazu bei, die FPS-Stabilität auf Maschinen mit wenigen CPU-Kernen zu verbessern, vorausgesetzt, dass die verwendete Java-Implementierung Prioritäten berücksichtigt.",
  "modernfix.option.mixin.perf.use_integrated_resources": "Meistens für 1.16. Patcht JEResources, um beim Einzelspieler-Spielen die Beutetabellendaten des integrierten Servers zu verwenden, anstatt Beutetabellen sinnlos neu zu laden. Spart beim JEI-Start noch ein paar Sekunden.",
  "modernfix.option.mixin.bugfix.concurrency": "Die Patches in dieser Gruppe beheben Parallelitätsprobleme in Minecraft und/oder Forge. Die meisten davon führen zu seltenen, schwer zu diagnostizierenden Abstürzen beim Laden.",
  "modernfix.option.mixin.bugfix.edge_chunk_not_saved": "Diese Option ist eine Portierung des Chunk Saving Fix-Mods von SuperCoder (da ich zu diesem Zeitpunkt nicht wusste, dass sie bereits für Forge verfügbar war).",
  "modernfix.option.mixin.bugfix.mc218112": "Diese Option behebt einen Deadlock, der auftreten kann, wenn bei der Verarbeitung von Entitätsdaten eine Ausnahme ausgelöst wird. Vanilla entsperrt den Datenmanager nicht korrekt, wenn es sollte. Dies wird im Bugtracker als MC-218112 verfolgt und von Mojang in 1.17 behoben.",
  "modernfix.option.mixin.bugfix.packet_leak": "**Experimentell**, standardmäßig nicht aktiviert. Ein Versuch, das Problem mit dem Speicherverlust zu beheben, das auftritt, wenn 1.16 lange genug gespielt wird.",
  "modernfix.option.mixin.bugfix.paper_chunk_patches": "1.18 und neuer. **Eine wichtige Optimierung.** Portiert einen Patch von Paper, der Probleme in 1.17 mit Chunkloading behebt, das große Speichermengen erfordert und viele „CompletableFuture“-Instanzen generiert. 1.18+ sind jetzt in der Lage, Welten auf nur 400 MB Speicher zu laden, wie es 1.16 konnte.",
  "modernfix.option.mixin.bugfix.tf_cme_on_load": "Patcht Twilight Forest, um ein nicht-threadsicheres Client-Setup wie vorgesehen mit dem Haupt-Thread und nicht mit dem FML-Worker-Thread durchzuführen.",
  "modernfix.option.mixin.feature.branding": "Fügt ModernFix zur Branding-Liste auf dem Titelbildschirm und auch auf dem F3-Bildschirm hinzu.",
  "modernfix.option.mixin.feature.direct_stack_trace": "Normalerweise deaktiviert, kann aktiviert werden, um zu erzwingen, dass der Raw-Stack-Trace im Protokoll ausgegeben wird, wenn ein Absturz auftritt. Gelegentlich funktioniert das Absturzberichtssystem von Vanilla nicht richtig und liefert einen völlig irrelevanten Stack-Trace/Bericht.",
  "modernfix.option.mixin.feature.measure_time": "Verwendet ein paar Injektionen, um die Weltladezeit, die Neuladezeit von Datenpaketen, die Neuladezeit von Ressourcen und die Bootstrap-Zeit zu messen, und fügt die erforderlichen Hooks hinzu, um die ungenutzte Profiler-Logik von Vanilla für das Neuladen von Ressourcen zu aktivieren, sofern entsprechend konfiguriert.",
  "modernfix.option.mixin.feature.spam_thread_dump": "**Nur für Debugzwecke zu verwenden.** Bewirkt, dass alle 60 Sekunden ein Thread-Dump im Protokoll ausgegeben wird. Dies kann dabei helfen, unerklärliche Einfrierungen während des Ladens/Spielablaufs zu diagnostizieren.",
  "modernfix.option.mixin.bugfix.chunk_deadlock": "Versucht Blocksystem-Deadlocks zu verhindern oder zusätzliche Debug-Informationen im Protokoll bereitzustellen, wenn sie auftreten. Diese Deadlocks äußern sich normalerweise darin, dass der Server auf unbestimmte Zeit einfriert (z. B. wenn sich Entitäten nicht bewegen), während der Client weiterhin einwandfrei funktioniert.",
  "modernfix.option.mixin.bugfix.chunk_deadlock.valhesia": "Patcht Valhesia Structures, um ein Problem in seinem Code zu beheben, das häufige Worldgen-/Chunkloading-Deadlocks verursacht.",
  "modernfix.option.mixin.bugfix.cofh_core_crash": "Behebt ein Multithreading-Problem in CoFH Core, das beim Start selten zu Abstürzen führen kann.",
  "modernfix.option.mixin.bugfix.ctm_resourceutil_cme": "Behebt ein Multithreading-Problem in ConnectedTexturesMod, das beim Start selten zu Abstürzen führen kann.",
  "modernfix.option.mixin.bugfix.ender_dragon_leak": "Behebt einen Speicherverlust in Vanilla, der dadurch verursacht wurde, dass der Ender-Drache einen Verweis auf die vorherige Client-Welt beibehielt.",
  "modernfix.option.mixin.bugfix.entity_load_deadlock": "Behebt viele Probleme, bei denen EntityJoinWorldEvent/EntityJoinLevelEvent einen Worldgen-Deadlock verursacht, indem das Laden von Entitäten leicht verzögert wird. Sollte jedoch keine spürbaren Verhaltensänderungen im Spiel verursachen.",
  "modernfix.option.mixin.bugfix.fix_config_crashes": "Behebt, dass Forge-Konfigurationen beim Starten des Spiels gelegentlich beschädigt werden.",
  "modernfix.option.mixin.bugfix.item_cache_flag": "Behebt MC-258939",
  "modernfix.option.mixin.bugfix.preserve_early_window_pos": "Sorgt dafür, dass das Spielfenster seine bestehende Größe behält, wenn die Kontrolle vom frühen Laden von Forge an den Minecraft-Code übergeben wird. Behebt das Problem, dass sich das Fenster nach dem Ziehen usw. zurück in die Mitte des Bildschirms teleportiert.",
  "modernfix.option.mixin.bugfix.refinedstorage.te_bug": "Behebt, dass externe Speicherblöcke von Refined Storage gelegentlich den Inhalt von Schubladen usw. nicht anzeigen, wenn sie geladen werden. Backport von Refined Storage PR #3435, der nur auf 1.18 und höher angewendet wurde.",
  "modernfix.option.mixin.bugfix.remove_block_chunkloading": "Behebt, dass Zombie-Schweinemenschen den 0, 0-Block auf Forge ständig geladen halten. Backport von Forge PR #8583.",
  "modernfix.option.mixin.bugfix.starlight_emptiness": "Behebt einen gelegentlichen Absturz von Starlight, der dadurch verursacht wurde, dass Leerekarten nicht initialisiert wurden. Backport des gleichen Fixes in Starlight für 1.18.x.",
  "modernfix.option.mixin.core": "Für die Funktion von ModernFix sind Kernpatches erforderlich",
  "modernfix.option.mixin.devenv": "Patches, die bei der Ausführung in einer Entwicklungsumgebung zur Geschwindigkeitsverbesserung und/oder zum Testen verwendet werden",
  "modernfix.option.mixin.safety": "Parallelitätspatches zur Vermeidung von Abstürzen beim Start",
  "modernfix.option.mixin.feature.integrated_server_watchdog": "Fügt den Vanilla-Watchdog auch Einzelspieler-Welten hinzu, druckt jedoch nur die Stacktraces aus, anstatt die Welt gewaltsam zu beenden. Diese Version enthält die Funktionalität von Fullstack Watchdog, letztere wird jedoch weiterhin für den Mehrspielermodus benötigt.",
  "modernfix.option.mixin.feature.snapshot_easter_egg": "Fügt Easter-Egg-Funktionen hinzu (beeinträchtigt weder die visuelle Darstellung noch das Verhalten von Vanilla), wenn es auf einer Snapshot-Version ausgeführt wird.",
  "modernfix.option.mixin.feature.spark_profile_launch": "Wenn diese Option aktiviert ist und eine kompatible Version von Spark installiert ist, wird die gesamte Startsequenz bis zum Hauptmenü profiliert.",
  "modernfix.option.mixin.feature.warn_missing_perf_mods": "Zeigt beim Start eine Warnung an, wenn andere Leistungsmodifikationen, die als wesentlich und hochkompatibel gelten, nicht vorhanden sind",
  "modernfix.option.mixin.launch.class_search_cache": "Ersetzt den Ressourcenfinder von Forge (der zum Auffinden von Spiel- und Modcodes verwendet wird) durch eine deutlich schnellere Version, was den Start beschleunigt",
  "modernfix.option.mixin.perf.clear_fabric_mapping_tables": "Reduziert die Speichernutzung durch Löschen von Mapping-Datenstrukturen im Fabric Loader, die entweder redundant sind oder von Mods selten verwendet werden. Aus Kompatibilitätsgründen standardmäßig deaktiviert.",
  "modernfix.option.mixin.perf.clear_mixin_classinfo": "Erzwingt das Laden aller Mixins, wenn der Start abgeschlossen ist, und löscht dann die Mixin-Datenstrukturen, um den größten Teil des Speicherbedarfs von Mixin zu entfernen. Aus Kompatibilitätsgründen standardmäßig deaktiviert.",
  "modernfix.option.mixin.perf.deduplicate_wall_shapes": "Bewirkt, dass die meisten Wandblöcke dasselbe Formobjekt haben, anstatt dass jeder eine eigene Kopie hat. Kann den Speicherverbrauch erheblich reduzieren, wenn durch Mods viele Wandblöcke hinzugefügt werden.",
  "modernfix.option.mixin.perf.dynamic_resources.ae2": "AE2-Kompatibilitätspatch für dynamische Ressourcen",
  "modernfix.option.mixin.perf.dynamic_resources.ctm": "CTM-Kompatibilitätspatch für dynamische Ressourcen",
  "modernfix.option.mixin.perf.dynamic_resources.rs": "Verfeinerter Speicherkompatibilitätspatch für dynamische Ressourcen",
  "modernfix.option.mixin.perf.dynamic_resources.supermartijncore": "SuperMartijn642CoreLib-Kompatibilitätspatch für dynamische Ressourcen",
  "modernfix.option.mixin.perf.dynamic_resources.diagonalfences": "Diagonal Fences-Kompatibilitätspatch für dynamische Ressourcen",
  "modernfix.option.mixin.perf.faster_advancements": "Schreibt die Fortschrittsprüfungslogik neu, um schneller zu sein und in großen Paketen keinen StackOverflowError zu verursachen. Port of Advancements Debug von Fabric.",
  "modernfix.option.mixin.perf.patchouli_deduplicate_books": "Behebung eines Fehlers, bei dem in Patchouli-Büchern viele leere Elemente mit NBT-Tags gespeichert werden, wodurch die Speichernutzung reduziert wird.",
  "modernfix.option.mixin.perf.remove_spawn_chunks": "Entfernt Spawn-Stücke vollständig aus dem Spiel. Sie werden im Gegensatz zu Ksyxis überhaupt nicht mehr geladen.",
  "modernfix.option.mixin.perf.use_integrated_resources.jepb": "",
  "modernfix.option.mixin.perf.use_integrated_resources.jeresources": "",
  "modernfix.option.mixin.bugfix.blueprint_modif_memory_leak": "Behebt den Verlust von Vanilla-Ressourcen durch den ObjectModificationManager von Blueprint und reduziert so die Speichernutzung. Obwohl der Fix in PR #195 beigesteuert wurde, wurde noch keine Veröffentlichung vorgenommen.",
  "modernfix.option.mixin.bugfix.removed_dimensions": "Behebt das Problem, bei dem das Spiel Welten nicht laden konnte, wenn Dimensionsmods entfernt wurden. Backport von Forge PR #8959.",
  "modernfix.option.mixin.perf.compact_bit_storage": "Behebt Speicherverschwendung, die dadurch verursacht wird, dass einige ältere Server (z. B. Hypixel) leere Blöcke senden, als ob sie Blöcke enthielten. Reduziert die Speichernutzung auf diesen Servern erheblich.",
  "modernfix.option.mixin.perf.deduplicate_climate_parameters": "Dedupliziert Klimaparameterobjekte, die vom neuen Biomsystem verwendet werden, kann etwa 2 MB einsparen, verlangsamt aber auch das Neuladen des Datenpakets etwas.",
  "modernfix.option.mixin.perf.dynamic_entity_renderers": "Konstruiert Entitätsmodelle beim ersten Mal, wenn sie angezeigt werden, und nicht beim Start. Einige Mods sind mit dieser Option nicht kompatibel und führen zu Abstürzen von EntityRenderer.",
  "modernfix.option.mixin.perf.twilightforest.structure_spawn_fix": "Behebt Verzögerungen, die dadurch verursacht werden, dass Twilight Forest Worldgen Strukturen sehr ineffizient überprüft",
  "modernfix.option.mixin.perf.fast_forge_dummies": "Beschleunigt das Einfrieren der Forge-Registrierung beim Start durch die Verwendung eines schnelleren Codepfads",
  "modernfix.option.mixin.perf.tag_id_caching": "Beschleunigt die Verwendung von Tag-Einträgen, indem das Standortobjekt zwischengespeichert wird, anstatt es jedes Mal neu zu erstellen",
  "modernfix.option.mixin.feature.disable_unihex_font": "Entfernen Sie die Unicode-Schriftart, sparen Sie 10 MB, führen aber dazu, dass Sonderzeichen nicht mehr gerendert werden",
  "modernfix.option.mixin.bugfix.world_leaks": "Reduziert die Speichernutzung alter clientseitiger Welten, die nach dem Dimensionswechsel nicht mehr benötigt werden. Normalerweise handelt es sich dabei um Müll, der in Vanilla gesammelt wird, aber Mods behalten manchmal Verweise darauf.",
  "modernfix.option.mixin.perf.compact_mojang_registries": "(Fabric) Experimentelle Option, die die Speichernutzung von Registern um etwa 50 % reduziert. In den meisten Modpacks nicht nützlich, es sei denn, sie enthalten Millionen von Blöcken und Gegenständen.",
  "modernfix.option.mixin.perf.dynamic_block_codecs": "Vermeidet das Speichern eines Codecs für jeden Block (Zustand) und generiert und speichert ihn stattdessen bei Bedarf im laufenden Betrieb. Im Allgemeinen lohnt es sich nicht, es zu aktivieren, es sei denn, Sie haben eine Million Blöcke/Elemente.",
  "modernfix.option.mixin.perf.faster_command_suggestions": "Verringern Sie Verzögerungen, wenn beim Eingeben eines Befehls Hunderttausende Vorschläge eingehen",
  "modernfix.option.mixin.perf.mojang_registry_size": "Behebt ein Problem, das dazu führt, dass sich die Registrierung von Blöcken/Elementen proportional zur bereits registrierten Anzahl verlangsamt. Dies verbessert die Startzeit."
}
