{
  "key.modernfix": "ModernFix",
  "key.modernfix.config": "Abrir pantalla de configuración",
  "modernfix.jei_load": "Cargando JEI, esto puede llevar un tiempo",
  "modernfix.no_lazydfu": "LazyDFU no está instalado. Si Minecraft necesita actualizar los datos del juego desde una versión anterior, es posible que haya una notable demora.",
  "modernfix.no_ferritecore": "FerriteCore no está instalado. El uso de memoria será muy alto.",
  "modernfix.connectedness_dynresoruces": "Connectedness y la opción de recursos dinámicos de ModernFix no son compatibles. Elimina Connectedness o desactiva los recursos dinámicos en la configuración de ModernFix.",
  "modernfix.perf_mod_warning": "Se recomienda instalar los mods, pero las advertencias se pueden desactivar en la configuración de ModernFix.",
  "modernfix.config": "Configuración de mixins de ModernFix",
  "modernfix.config.done_restart": "Hecho (se requiere reiniciar)",
  "modernfix.config.wiki": "Abrir wiki",
  "modernfix.message.reload_config": "Se detectó un cambio en el archivo de configuración del mod. Para evitar cargar archivos que aún no se hayan guardado, se debe activar la recarga ejecutando /mfrc.",
  "modernfix.option.on": "activado",
  "modernfix.option.off": "desactivado",
  "modernfix.option.disabled": "desactivado",
  "modernfix.option.enabled": "activado",
  "modernfix.option.mod_override": " por mods [%s]",
  "modernfix.config.not_default": " (modificado)",
  "asynclocator.map.locating": "Mapa (Localizando...)",
  "asynclocator.map.none": "Mapa (No se encontró ninguna característica cercana)",
  "modernfix.option.category.performance": "Rendimiento",
  "modernfix.option.category.performance.description": "Funciones que ayudan a mejorar el rendimiento del juego/inicio",
  "modernfix.option.category.bugfixes": "Correcciones de errores",
  "modernfix.option.category.bugfixes.description": "Correcciones fundamentales para mejorar la estabilidad del juego",
  "modernfix.option.category.troubleshooting": "Solución de problemas/Utilidades",
  "modernfix.option.category.troubleshooting.description": "Funciones destinadas a ayudar a diagnosticar problemas",
  "modernfix.option.category.expert_only": "Solo expertos",
  "modernfix.option.category.expert_only.description": "No cambies esto a menos que sepas lo que estás haciendo",
  "modernfix.option.name.mixin.perf.async_jei": "Carga de JEI en segundo plano",
  "modernfix.option.mixin.perf.async_jei": "Solo versión 1.16. **Una optimización clave.** Parchea JEI para realizar su recarga en un hilo en segundo plano, eliminando por completo la larga demora que agrega a la carga del mundo.",
  "modernfix.option.mixin.perf.async_locator": "Solo versión 1.16. Retroporta los parches del mod Async Locator para eliminar los bloqueos del servidor asociados con `/locate`, generación de tablas de botín, etc.",
  "modernfix.option.mixin.perf.biome_zoomer": "Solo versión 1.16. Optimización menor para mejorar el rendimiento del zoom de biomas utilizando la lógica de la versión 1.18.",
  "modernfix.option.mixin.perf.blast_search_trees": "Todas las versiones. Si se instala REI o JEI, se deshabilita la construcción de los árboles de búsqueda vanilla para la búsqueda creativa, y en su lugar se utiliza la implementación de búsqueda de estos mods. Esto ahorra varios segundos durante la carga del mundo y probablemente también ahorra algo de RAM (aunque no lo he medido).",
  "modernfix.option.mixin.perf.boost_worker_count": "Solo versión 1.16. Elimina el límite fijo en la cantidad de hilos de trabajo, similar a lo que hizo Mojang en la versión 1.18.",
  "modernfix.option.mixin.perf.cache_blockstate_cache_arrays": "Todas las versiones. Evita crear copias nuevas de matrices de enumeración cada vez que se inicializa una caché de estados de bloque. Optimización menor, pero fácil de hacer.",
  "modernfix.option.mixin.perf.cache_model_materials": "Todas las versiones. Memoiza la colección de `RenderMaterial` (texturas) y la lista de dependencias que los modelos devuelven en lugar de requerir que se recalculen en cada solicitud. Ayuda a acelerar el proceso de carga/horneado del modelo.",
  "modernfix.option.mixin.perf.cache_strongholds": "Todas las versiones. Guarda la lista generada de posiciones de fortalezas en el mundo en lugar de regenerarla en cada carga del mundo. Ahorra un poco de tiempo en la versión 1.16 y mucho más en las versiones 1.18 y 1.19.",
  "modernfix.option.mixin.perf.cache_upgraded_structures": "Todas las versiones. Muchos mods incluyen archivos de estructuras desactualizados, lo que requiere que el juego los actualice usando DFU cada vez que se cargan. Esto puede ser bastante lento. Este parche agrega lógica para guardar la versión actualizada de la estructura y reutilizarla en la siguiente carga. Para manejar el caso en que el mod cambia un archivo de estructura pero no el nombre, se compara el hash del archivo original con la versión en caché y, si no coinciden, la estructura se actualizará nuevamente.",
  "modernfix.option.mixin.perf.compress_biome_container": "Solo versión 1.16. Optimización menor tomada de Hydrogen, que intenta ahorrar espacio en el contenedor de biomas cuando es posible. Esto se desactiva automáticamente si se instalan mods conflictivos como BetterEnd o Chocolate.",
  "modernfix.option.mixin.perf.datapack_reload_exceptions": "Todas las versiones. Reduce el spam en el registro y posiblemente mejora ligeramente la velocidad de carga al no imprimir las trazas de pila para algunas excepciones comúnmente lanzadas durante la recarga de datapacks (por ejemplo, elementos faltantes en tablas de botín/recetas). El mensaje aún se imprime.",
  "modernfix.option.mixin.perf.dedicated_reload_executor": "Todas las versiones. Mueve la recarga de paquetes de recursos y paquetes de datos a un grupo de trabajadores dedicado en lugar de utilizar los hilos predeterminados `Worker-Main`. Esto permite que los mods de Smooth Boot mejoren potencialmente el rendimiento en el modo de un solo jugador durante la ejecución, sin ralentizar el inicio debido a un recuento limitado de hilos.",
  "modernfix.option.mixin.perf.deduplicate_location": "Todas las versiones, pero desactivado de forma predeterminada debido al impacto en el tiempo de carga. Deduplica los espacios de nombres y las rutas de ubicación de recursos. Esto ahorra memoria RAM, pero también aumenta el costo de construir una nueva `ResourceLocation` en gran medida.",
  "modernfix.option.mixin.perf.dynamic_dfu": "Todas las versiones. Modifica la inicialización de DFU para que ocurra la primera vez que se necesite actualizar algo. Esto suena similar a LazyDFU, pero se implementa de manera distinta, ya que evita cargar *cualquier* clase/estructura de DFU, mientras que LazyDFU solo deshabilita la optimización de reglas. Básicamente, esta opción es una versión más segura de DataFixerSlayer, ya que aún se cargará DFU cuando sea necesario.\n\nNormalmente, se recomienda seguir utilizando LazyDFU incluso con esta opción habilitada, ya que, de lo contrario, la optimización de reglas de DFU causará retrasos.",
  "modernfix.option.mixin.perf.dynamic_resources": "Todas las versiones. Consulta https://github.com/embeddedt/ModernFix/wiki/Dynamic-Resources-FAQ.",
  "modernfix.option.mixin.perf.dynamic_sounds": "Todas las versiones. Permite que el juego descargue sonidos en lugar de que los sonidos persistan indefinidamente después de cargarse.",
  "modernfix.option.mixin.perf.dynamic_structure_manager": "Todas las versiones. Permite que el juego descargue archivos de estructuras después de que concluya la generación en lugar de mantenerlos cargados para siempre.",
  "modernfix.option.mixin.perf.fast_registry_validation": "Todas las versiones. Forge busca innecesariamente un método mediante reflexión cada vez que se valida un registro. Este parche simplemente almacena en caché el valor devuelto, ya que será el mismo cada vez.",
  "modernfix.option.mixin.perf.faster_font_loading": "Todas las versiones. Optimiza el renderizador de fuentes para cargar fuentes más rápido, acelerando la recarga de recursos.",
  "modernfix.option.mixin.perf.faster_item_rendering": "Todas las versiones. Evita renderizar los lados de los objetos en las GUIs. (Sí, parece que el juego base hace eso.)\n\nEsto puede triplicar los FPS con un mod como REI/JEI instalado en GPUs más débiles, si hay suficientes objetos visibles. Desactivado de forma predeterminada, ya que es nuevo y no se ha probado mucho, pero debería ser seguro. El problema más probable es que los objetos sean completamente invisibles en las interfaces gráficas o que parezcan planos en el mundo.",
  "modernfix.option.mixin.perf.faster_texture_loading": "Todas las versiones anteriores a la 1.19.4. Evita leer las texturas dos veces (la primera vez utilizando un camino de código muy lento) y en su lugar realiza una carga más rápida (similar a la versión 1.19.3+).",
  "modernfix.option.mixin.perf.faster_texture_stitching": "Todas las versiones. Permite que el juego utilice un sistema de unión de texturas más rápido, originalmente escrito por SuperCoder79 para lwjgl3ify en la versión 1.7.10, lo que puede ahorrar algo de tiempo durante la carga. Rara vez, se ha informado que esto causa artefactos extraños en bloques o en interfaces gráficas, esto puede ser un error de Sodium.",
  "modernfix.option.mixin.perf.jeresources_startup": "Solo versión 1.16. Optimiza Just Enough Resources para no recrear innecesariamente entidades de aldeanos muchas veces para la misma profesión, lo que ahorra tiempo durante el inicio de JEI.",
  "modernfix.option.mixin.perf.kubejs": "Solo versión 1.16. Optimizaciones para KubeJS para evitar copiar innecesariamente `ItemStack`, etc., lo que reduce el tiempo necesario para cargar datapacks.",
  "modernfix.option.mixin.perf.model_optimizations": "Todas las versiones. Implementa optimizaciones para acelerar el proceso de carga de modelos.",
  "modernfix.option.mixin.perf.nbt_memory_usage": "Todas las versiones. Utiliza un mapa de respaldo más eficiente para las etiquetas NBT compuestas que deduplica los nombres de clave y también utiliza un mapa de matriz para compuestos muy pequeños. Esto reduce la sobrecarga de almacenar muchas etiquetas compuestas en memoria.",
  "modernfix.option.mixin.perf.nuke_empty_chunk_sections": "Solo versión 1.16, inspirado en Hydrogen. Evita almacenar en memoria secciones de fragmentos llenas de aire, en lugar de marcarlas como vacías.",
  "modernfix.option.mixin.perf.reduce_blockstate_cache_rebuilds": "Todas las versiones. **Una optimización clave.** Las versiones más recientes de Minecraft (después de la 1.12) implementaron un sistema de caché de estados de bloque que almacena en caché información frecuentemente utilizada sobre un estado de bloque, como si es sólido, su forma de colisión, etc. Reconstruir esta caché es bastante rápido en el juego base (solo lleva uno o dos segundos), pero es bastante lento con muchos mods instalados, ya que hay muchos más estados de bloque presentes en el juego que todos deben reconstruir sus cachés.\n\nEste problema se agrava con Forge, ya que la caché se reconstruye en muchos puntos donde los datos casi con seguridad no se utilizarían antes de la próxima reconstrucción. Ejemplos incluyen justo antes de llegar al menú principal (durante la etapa de \"Congelación de datos\"), así como ¡múltiples veces! cuando se carga un mundo.\n\nModernFix resuelve este cuello de botella de rendimiento haciendo que las reconstrucciones de caché sean perezosas. Cada estado de bloque reconstruye su caché la primera vez que se accede a los datos. En cualquier momento en que vanilla o Forge intenten reconstruir cachés para todos los estados de bloque, esto se redirige a simplemente invalidar la caché en cada estado de bloque en su lugar.\n\nEsto no debería tener ningún impacto en el TPS después de que concluya el inicio.",
  "modernfix.option.mixin.perf.remove_biome_temperature_cache": "Todas las versiones. Elimina la caché de temperatura de los biomas como lo hace Lithium en las versiones modernas.",
  "modernfix.option.mixin.perf.resourcepacks": "Todas las versiones. **Una optimización clave.** Los lanzamientos en las versiones modernas están fuertemente limitados por el acceso al sistema de archivos. Se realizan muchas solicitudes con frecuencia a los paquetes de recursos para listar recursos o verificar si existe un recurso determinado, y cada una de estas solicitudes resulta en una llamada API de archivos muy lenta.\n\nModernFix elimina por completo la mayor parte del cuello de botella simplemente almacenando en caché una lista de todos los recursos que existen en los paquetes de recursos proporcionados por mods y en el juego base. La caché se reconstruye al recargar los recursos (excepto los recursos del juego base, ya que nunca deberían cambiar mientras el juego se esté ejecutando).\n\nNo se conocen problemas de compatibilidad con este parche, excepto OptiFine (sus recursos CTM no se cargan correctamente). Sin embargo, no recomiendo usar OptiFine en ningún escenario, ya que agrega varios minutos al tiempo de inicio por sí solo y no se ha probado con ModernFix en absoluto.",
  "modernfix.option.mixin.perf.reuse_datapacks": "Solo versión 1.16. Intenta acelerar el cambio entre mundos de un solo jugador al omitir la recarga de datapacks cuando sea posible. Puede causar problemas de compatibilidad con algunos mods, pero actualmente está habilitado de forma predeterminada.",
  "modernfix.option.mixin.perf.rewrite_registry": "Todas las versiones. **Actualmente semi-roto.** Reemplaza agresivamente algunas partes internas del sistema de registro de Forge con versiones más rápidas, sin embargo, actualmente causa congelamientos al cargar algunos paquetes de mods. Desactivado de forma predeterminada por razones obvias.",
  "modernfix.option.mixin.perf.skip_first_datapack_reload": "Solo versiones 1.16 y 1.19. **Una optimización clave.**\n\nEn medio del ciclo de desarrollo de la versión 1.16, Forge parcheó el juego para recargar los datapacks dos veces al cargar un mundo existente, con el fin de solucionar un problema con el desplazamiento de ID de biomas. Desafortunadamente, las recargas de datapacks a menudo tardan más de 30 segundos, por lo que esto afecta gravemente los tiempos de carga del mundo.\n\nModernFix realiza los cambios necesarios para evitar esta recarga, basándose en el PR #8163 inacabado de Forge.\n\nEste cambio fue eliminado por Forge en la versión 1.18, pero luego se agregó un parche similar *nuevamente* en la versión 1.19 para solucionar el problema de que los datapacks de mods no se cargaban al crear nuevos mundos de un solo jugador. Afortunadamente, el problema se limita a la pantalla de creación de mundos en la versión 1.19, y los mundos existentes solo requieren una recarga. Sin embargo, esto duplica la duración del pico de lag al hacer clic en \"Crear nuevo mundo\" en la versión 1.19, por lo que ModernFix nuevamente realiza cambios para no realizar una recarga redundante.",
  "modernfix.option.mixin.perf.state_definition_construct": "Todas las versiones. Habilitado solo si FerriteCore está instalado. Aprovecha el manejo de los blockstates de FerriteCore para acelerar su creación. Esto puede ayudar a acelerar el lanzamiento con mods que agregan muchos blockstates, como mods de muebles.",
  "modernfix.option.mixin.perf.sync_executor_sleep": "Todas las versiones. Evita que el hilo principal espere inútilmente consumiendo un núcleo de CPU mientras espera a que los trabajadores de carga de mods terminen.",
  "modernfix.option.mixin.perf.thread_priorities": "Todas las versiones. Ajusta las prioridades de los hilos de trabajo y del servidor para que sean más bajas que las del hilo del cliente. Esto ayuda a mejorar la estabilidad de los FPS en máquinas con pocos núcleos de CPU, siempre que la implementación de Java utilizada respete las prioridades.",
  "modernfix.option.mixin.perf.use_integrated_resources": "Principalmente para la versión 1.16. Parchea JEResources para utilizar los datos de las tablas de botín del servidor integrado si se juega en modo un jugador, en lugar de volver a cargar innecesariamente las tablas de botín. Ahorra unos segundos adicionales durante el inicio de JEI.",
  "modernfix.option.mixin.bugfix.concurrency": "Los parches de este grupo solucionan problemas relacionados con la concurrencia en Minecraft y/o Forge. La mayoría de ellos resultan en bloqueos raros y difíciles de diagnosticar durante la carga.",
  "modernfix.option.mixin.bugfix.edge_chunk_not_saved": "Esta opción es una versión del mod Chunk Saving Fix de SuperCoder (porque no me di cuenta de que ya estaba disponible para Forge en ese momento).",
  "modernfix.option.mixin.bugfix.mc218112": "Esta opción soluciona un bloqueo que puede ocurrir si se produce una excepción al procesar los datos de una entidad. Vanilla no desbloquea correctamente el administrador de datos cuando debería hacerlo. Esto se registra como MC-218112 en el rastreador de errores y fue solucionado por Mojang en la versión 1.17.",
  "modernfix.option.mixin.bugfix.packet_leak": "**Experimental**, no habilitado de forma predeterminada. Un intento de solución para el problema de fuga de memoria que ocurre después de jugar lo suficiente en la versión 1.16.",
  "modernfix.option.mixin.bugfix.paper_chunk_patches": "Versión 1.18 y posterior. **Una optimización clave.** Parchea un problema en la carga de chunks en la versión 1.17 que requiere grandes cantidades de memoria y genera muchas instancias de `CompletableFuture`. A partir de la versión 1.18, ahora es posible cargar mundos con solo 400MB de memoria, al igual que en la versión 1.16.",
  "modernfix.option.mixin.bugfix.tf_cme_on_load": "Parchea Twilight Forest para realizar la configuración del cliente que no es segura para subprocesos utilizando el hilo principal, como debería ser, en lugar del hilo de trabajo de FML.",
  "modernfix.option.mixin.feature.branding": "Agrega ModernFix a la lista de marcas en la pantalla de inicio y también en la pantalla F3.",
  "modernfix.option.mixin.feature.direct_stack_trace": "Normalmente desactivado, se puede habilitar para forzar que la traza de la pila sin procesar se registre en el registro cuando ocurre un bloqueo. Ocasionalmente, el sistema de informes de bloqueo de Vanilla no funciona correctamente y proporciona una traza de pila/informe completamente irrelevante.",
  "modernfix.option.mixin.feature.measure_time": "Utiliza un par de inyecciones para medir el tiempo de carga del mundo, el tiempo de recarga de los datapacks, el tiempo de recarga de recursos, el tiempo de inicio y agrega los ganchos necesarios para habilitar la lógica de perfilador no utilizada de Vanilla para la recarga de recursos si está configurado de esa manera.",
  "modernfix.option.mixin.feature.spam_thread_dump": "**Solo para fines de depuración.** Provoca que se registre una volcado de hilos en el registro cada 60 segundos. Esto puede ayudar a diagnosticar bloqueos inexplicables durante la carga/juego.",
  "modernfix.option.mixin.bugfix.chunk_deadlock": "Intenta prevenir bloqueos del sistema de chunks o proporcionar información de depuración adicional en el registro cuando ocurren. Estos bloqueos generalmente se manifiestan como el congelamiento indefinido del servidor (por ejemplo, entidades que no se mueven), mientras que el cliente sigue funcionando correctamente.",
  "modernfix.option.mixin.bugfix.chunk_deadlock.valhesia": "Parchea Valhesia Structures para solucionar un problema en su código que causa bloqueos frecuentes de generación de mundo/carga de chunks.",
  "modernfix.option.mixin.bugfix.cofh_core_crash": "Soluciona un problema de multihilo en CoFH Core que puede causar bloqueos raros durante el inicio.",
  "modernfix.option.mixin.bugfix.ctm_resourceutil_cme": "Soluciona un problema de multihilo en ConnectedTexturesMod que puede causar bloqueos raros durante el inicio.",
  "modernfix.option.mixin.bugfix.ender_dragon_leak": "Soluciona una fuga de memoria en Vanilla causada por el dragón del End que retiene una referencia al mundo del cliente anterior.",
  "modernfix.option.mixin.bugfix.entity_load_deadlock": "Soluciona muchos problemas en los que EntityJoinWorldEvent/EntityJoinLevelEvent causan un bloqueo de generación de mundo, retrasando ligeramente la carga de entidades. Sin embargo, no debería causar cambios perceptibles en el comportamiento del juego.",
  "modernfix.option.mixin.bugfix.fix_config_crashes": "Soluciona problemas ocasionales en los que las configuraciones de Forge se corrompen al iniciar el juego.",
  "modernfix.option.mixin.bugfix.item_cache_flag": "Soluciona MC-258939",
  "modernfix.option.mixin.bugfix.preserve_early_window_pos": "Hace que la ventana del juego mantenga su tamaño existente cuando el control se transfiere del inicio temprano de Forge al código de Minecraft. Soluciona el problema de que la ventana vuelva a la posición central de la pantalla después de arrastrarla, etc.",
  "modernfix.option.mixin.bugfix.refinedstorage.te_bug": "Soluciona el problema de que los bloques de almacenamiento externo de Refined Storage ocasionalmente no muestren el contenido de los cajones, etc. cuando se cargan. Es una versión anterior de la solución propuesta en Refined Storage PR #3435, que solo se aplicó a la versión 1.18 y posteriores.",
  "modernfix.option.mixin.bugfix.remove_block_chunkloading": "Soluciona el problema de que los pigmen zombis mantengan el chunk 0, 0 cargado perpetuamente en Forge. Es una versión anterior de la solución propuesta en Forge PR #8583.",
  "modernfix.option.mixin.bugfix.starlight_emptiness": "Soluciona un bloqueo ocasional de Starlight debido a que los mapas de vacío no se inicializan. Es una versión anterior de la misma solución en Starlight para la versión 1.18.x.",
  "modernfix.option.mixin.core": "Parches principales necesarios para que ModernFix funcione",
  "modernfix.option.mixin.devenv": "Parches utilizados al ejecutar en un entorno de desarrollo, para mejorar la velocidad y/o realizar pruebas",
  "modernfix.option.mixin.safety": "Parches de concurrencia para evitar bloqueos durante el inicio",
  "modernfix.option.mixin.feature.integrated_server_watchdog": "Agrega el watchdog de Vanilla a los mundos de un jugador también, pero solo muestra las trazas de pila en lugar de terminar el mundo de forma forzada. Esta versión incluye la funcionalidad de Fullstack Watchdog, pero este último aún es necesario para el modo multijugador.",
  "modernfix.option.mixin.feature.snapshot_easter_egg": "Agrega características de huevos de Pascua (no afecta ninguna visualización o comportamiento de Vanilla) cuando se ejecuta en una versión de snapshot.",
  "modernfix.option.mixin.feature.spark_profile_launch": "Si está habilitado y se instala una versión compatible de Spark, se realizará un perfilado de toda la secuencia de inicio hasta el menú principal.",
  "modernfix.option.mixin.feature.warn_missing_perf_mods": "Muestra una advertencia al iniciar si no están presentes otros mods de rendimiento considerados esenciales y altamente compatibles.",
  "modernfix.option.mixin.launch.class_search_cache": "Reemplaza el buscador de recursos de Forge (utilizado para encontrar el código del juego y de un mod) con una versión significativamente más rápida, acelerando el inicio",
  "modernfix.option.mixin.perf.clear_fabric_mapping_tables": "Reduce el uso de memoria al limpiar las estructuras de datos de mapeo en Fabric Loader que son redundantes o rara vez utilizadas por los mods. Desactivado de forma predeterminada por razones de compatibilidad.",
  "modernfix.option.mixin.perf.clear_mixin_classinfo": "Carga forzada de todos los mixins cuando finaliza el inicio y luego limpia las estructuras de datos de mixin para eliminar la mayor parte de la huella de memoria de Mixin. Desactivado de forma predeterminada por razones de compatibilidad.",
  "modernfix.option.mixin.perf.deduplicate_wall_shapes": "Hace que la mayoría de los bloques de pared compartan el mismo objeto de forma en lugar de tener su propia copia. Puede reducir considerablemente el uso de memoria cuando se agregan muchos bloques de pared mediante mods.",
  "modernfix.option.mixin.perf.dynamic_resources.ae2": "Parche de compatibilidad de AE2 para recursos dinámicos",
  "modernfix.option.mixin.perf.dynamic_resources.ctm": "Parche de compatibilidad de CTM para recursos dinámicos",
  "modernfix.option.mixin.perf.dynamic_resources.rs": "Parche de compatibilidad de Refined Storage para recursos dinámicos",
  "modernfix.option.mixin.perf.dynamic_resources.supermartijncore": "Parche de compatibilidad de SuperMartijn642CoreLib para recursos dinámicos",
  "modernfix.option.mixin.perf.dynamic_resources.diagonalfences": "Parche de compatibilidad de Diagonal Fences para recursos dinámicos",
  "modernfix.option.mixin.perf.faster_advancements": "Reescribe la lógica de verificación de avances para que sea más rápida y no cause StackOverflowError en paquetes grandes. Portado de Advancements Debug de Fabric.",
  "modernfix.option.mixin.perf.patchouli_deduplicate_books": "Soluciona el problema de que Patchouli books almacene muchos elementos vacíos con etiquetas NBT, reduciendo el uso de memoria.",
  "modernfix.option.mixin.perf.remove_spawn_chunks": "Elimina por completo los chunks de Spawn en el juego. Ya no se cargan en absoluto, a diferencia de Ksyxis.",
  "modernfix.option.mixin.perf.use_integrated_resources.jepb": "",
  "modernfix.option.mixin.perf.use_integrated_resources.jeresources": "",
  "modernfix.option.mixin.bugfix.blueprint_modif_memory_leak": "Soluciona la fuga de memoria de ObjectModificationManager en Blueprint, reduciendo el uso de memoria. A pesar de que la solución se contribuyó en PR #195, aún no se ha realizado un lanzamiento.",
  "modernfix.option.mixin.bugfix.removed_dimensions": "Soluciona el problema de que el juego no carga los mundos si se eliminan los mods de dimensiones. Retroport de Forge PR #8959.",
  "modernfix.option.mixin.perf.compact_bit_storage": "Soluciona el desperdicio de memoria causado por algunos servidores antiguos (por ejemplo, Hypixel) que envían chunks vacíos como si contuvieran bloques. Reduce significativamente el uso de memoria en estos servidores.",
  "modernfix.option.mixin.perf.deduplicate_climate_parameters": "Duplica los objetos de parámetros climáticos utilizados por el nuevo sistema de biomas, puede ahorrar ~2MB pero también ralentiza la recarga de datapacks.",
  "modernfix.option.mixin.perf.dynamic_entity_renderers": "Construye los modelos de entidad la primera vez que se ven en lugar de durante el lanzamiento. Algunos mods no son compatibles con esta opción y causarán bloqueos de EntityRenderer.",
  "modernfix.option.mixin.perf.twilightforest.structure_spawn_fix": "Soluciona el lag causado por la generación de estructuras de Twilight Forest que verifica las estructuras de manera muy ineficiente.",
  "modernfix.option.mixin.perf.fast_forge_dummies": "Acelera la congelación del registro de Forge durante el lanzamiento utilizando un camino más rápido.",
  "modernfix.option.mixin.perf.tag_id_caching": "Acelera el uso de entradas de etiquetas almacenando en caché el objeto de ubicación en lugar de recrearlo cada vez.",
  "modernfix.option.mixin.feature.disable_unihex_font": "Elimina la fuente Unicode, ahorra 10MB pero hace que los caracteres especiales no se muestren.",
  "modernfix.option.mixin.bugfix.world_leaks": "Reduce el uso de memoria de los mundos antiguos del lado del cliente que no son necesarios después de cambiar de dimensiones. Normalmente, estos son recolectados por el recolector de basura en vanilla, pero los mods a veces retienen referencias a ellos.",
  "modernfix.option.mixin.perf.compact_mojang_registries": "(Fabric) Opción experimental que reduce el uso de memoria de los registros en aproximadamente un 50%. No es útil en la mayoría de los paquetes de mods a menos que contengan millones de bloques e ítems.",
  "modernfix.option.mixin.perf.dynamic_block_codecs": "Evita almacenar un codec para cada bloque(estado) y en su lugar lo genera y almacena en caché cuando es necesario. Generalmente no vale la pena habilitarlo a menos que tengas un millón de bloques/ítems.",
  "modernfix.option.mixin.perf.faster_command_suggestions": "Mitiga el lag cuando hay cientos de miles de sugerencias al escribir un comando.",
  "modernfix.option.mixin.perf.mojang_registry_size": "Soluciona un problema que hace que el registro de bloques/ítems se ralentice proporcionalmente al número ya registrado. Esto mejora el tiempo de inicio.",
  "modernfix.option.mixin.bugfix.entity_pose_stack": "Soluciona el problema de Forge #9118, donde los mods pueden causar bloqueos de renderización indeterminables al empujar la pila de matrices sin desapilarla.",
  "modernfix.option.mixin.bugfix.file_dialog_title": "Soluciona un problema de seguridad con el cuadro de diálogo de configuración de generación de mundos.",
  "modernfix.option.mixin.bugfix.forge_vehicle_packets": "Soluciona un error introducido por un parche de Forge que hace que se envíen cantidades excesivas de paquetes de datos de chunks al jugador si está montando un vehículo en un borde de chunk.",
  "modernfix.option.mixin.bugfix.mantle_model_cme": "Soluciona un error en Mantle que puede causar bloqueos aleatorios de ConcurrentModificationException al renderizar contenido de Tinkers Construct.",
  "modernfix.option.mixin.bugfix.model_data_manager_cme": "Soluciona problemas de diseño en el sistema ModelDataManager de Forge que pueden causar problemas de concurrencia inesperados.",
  "modernfix.option.mixin.bugfix.recipe_book_type_desync": "Soluciona que los clientes de Forge se desconecten al conectarse a un servidor vanilla si los mods agregan tipos de entradas de libro de recetas personalizadas.",
  "modernfix.option.mixin.bugfix.unsafe_modded_shape_caches": "Soluciona varias ConcurrentModificationExceptions que pueden ocurrir en mods de contenido al calcular las formas de los bloques.",
  "modernfix.option.mixin.feature.stalled_chunk_load_detection": "Esta opción puede ayudar a detectar la causa de las congelaciones de carga de chunks. Sin embargo, dejarla habilitada puede causar un rendimiento ligeramente peor.",
  "modernfix.option.mixin.perf.fix_loop_spin_waiting": "Soluciona el consumo excesivo de recursos de CPU de la función de espera incorporada de Minecraft.",
  "modernfix.option.mixin.perf.forge_cap_retrieval": "Pequeña micro-optimización que hace que la recuperación de datos de entidad personalizados sea ligeramente más eficiente en Forge.",
  "modernfix.option.mixin.perf.forge_registry_lambda": "Soluciona errores en Forge que llevan a una asignación excesiva en métodos de registro en caliente."
}
