{
  "key.modernfix": "ModernFix",
  "key.modernfix.config": "Apri la schermata configurazione",
  "modernfix.jei_load": "Caricamento JEI in corso, potrebbe richiedere un po' di tempo",
  "modernfix.no_lazydfu": "LazyDFU non è installato. Se Minecraft deve aggiornare i dati di gioco da una versione precedente, potrebbe esserci un notevole lag.",
  "modernfix.no_ferritecore": "FerriteCore non è installato. L'uso della memoria sarà molto elevato.",
  "modernfix.connectedness_dynresoruces": "Connectedness e l'opzione risorse dinamiche di ModernFix non sono compatibili. Rimuovi Connectedness o disabilita le risorse dinamiche nella configurazione di ModernFix.",
  "modernfix.perf_mod_warning": "Si consiglia di installare le mod, ma gli avvertimenti possono essere disabilitati nella configurazione di ModernFix.",
  "modernfix.config": "Configurazione mixin ModernFix",
  "modernfix.config.done_restart": "Fatto (riavvio richiesto)",
  "modernfix.message.reload_config": "È stata rilevata una modifica al file di configurazione. Per evitare di caricare file che non sono ancora stati salvati, è necessario avviare nuovamente il caricamento eseguendo /mfrc.",
  "modernfix.option.on": "attivo",
  "modernfix.option.off": "disattivo",
  "modernfix.option.disabled": "disabilitato",
  "modernfix.option.enabled": "abilitato",
  "modernfix.option.mod_override": " da mod [%s]",
  "modernfix.config.not_default": " (modificato)",
  "asynclocator.map.locating": "Mappa (Ricerca in corso...)",
  "asynclocator.map.none": "Mappa (Nessuna caratteristica vicina trovata)",
  "modernfix.option.category.performance": "Prestazioni",
  "modernfix.option.category.performance.description": "Funzionalità che aiutano a migliorare le prestazioni di gioco/avvio",
  "modernfix.option.category.bugfixes": "Risoluzione errori",
  "modernfix.option.category.bugfixes.description": "Correzioni di bug di base per migliorare la stabilità del gioco",
  "modernfix.option.category.troubleshooting": "Risoluzione di problemi/Strumenti",
  "modernfix.option.category.troubleshooting.description": "Funzionalità pensate per assistere nella diagnosi dei problemi",
  "modernfix.option.category.expert_only": "Solo per esperti",
  "modernfix.option.category.expert_only.description": "Non modificare a meno che tu sappia cosa stai facendo",
  "modernfix.option.name.mixin.perf.async_jei": "Caricamento JEI in background",
  "modernfix.option.mixin.perf.async_jei": "Solo per la versione 1.16. **Un'ottimizzazione fondamentale.** Parcheggia JEI per eseguire il ricaricamento su un thread in background, eliminando completamente il lungo ritardo che aggiunge al caricamento del mondo.",
  "modernfix.option.mixin.perf.async_locator": "Solo per la versione 1.16. Riporta le patch di Async Locator mod per eliminare i blocchi del server associati a `/locate`, generazione di tabelle del bottino, ecc.",
  "modernfix.option.mixin.perf.biome_zoomer": "Solo per la versione 1.16. Ottimizzazione minore per migliorare le prestazioni del zoom sulla biome usando la logica dalla versione 1.18.",
  "modernfix.option.mixin.perf.blast_search_trees": "Tutte le versioni. Se sono installate REI o JEI, la costruzione delle tabelle di ricerca vanilla per la ricerca creativa viene disabilitata e la ricerca viene invece effettuata utilizzando le implementazioni di ricerca di queste mod. Questo risparmia alcuni secondi durante il caricamento del mondo e probabilmente risparmia anche un po' di RAM (sebbene non sia stato misurato).",
  "modernfix.option.mixin.perf.boost_worker_count": "Solo per la versione 1.16. Rimuove il limite codificato sul conteggio dei thread dei lavoratori, simile a quanto fatto da Mojang nella versione 1.18.",
  "modernfix.option.mixin.perf.cache_blockstate_cache_arrays": "Tutte le versioni. Evita di creare copie nuove di array enumerativi ogni volta che viene inizializzata una cache di blockstate. Ottimizzazione minore, ma semplice da fare.",
  "modernfix.option.mixin.perf.cache_model_materials": "Tutte le versioni. Memorizza la collezione `RenderMaterial` (texture) e la lista delle dipendenze che i modelli restituiscono invece di richiederne il calcolo ad ogni richiesta. Aiuta ad accelerare il processo di caricamento/modellazione dei modelli.",
  "modernfix.option.mixin.perf.cache_strongholds": "Tutte le versioni. Salva l'elenco generato delle posizioni delle fortezze con il mondo, invece di rigenerarlo ad ogni caricamento del mondo. Risparmia un po' di tempo nella versione 1.16, e molto di più nelle versioni 1.18 e 1.19.",
  "modernfix.option.mixin.perf.cache_upgraded_structures": "Tutte le versioni. Molti mod includono file di strutture obsoleti, il che richiede al gioco di aggiornarli utilizzando DFU ogni volta che vengono caricati. Questo può essere piuttosto lento. Questa patch aggiunge una logica per invece salvare la versione aggiornata della struttura e riutilizzarla al caricamento successivo. Per gestire il caso in cui il mod cambia un file di struttura ma non il nome, l'hash del file originale viene confrontato con la versione in cache e se non corrispondono la struttura verrà nuovamente aggiornata.",
  "modernfix.option.mixin.perf.compress_biome_container": "Solo per la versione 1.16. Ottimizzazione minore presa in prestito da Hydrogen, che cerca di risparmiare spazio nel contenitore della biome quando possibile. Questo viene disabilitato automaticamente se sono installati mod in conflitto come BetterEnd o Chocolate.",
  "modernfix.option.mixin.perf.datapack_reload_exceptions": "Tutte le versioni. Riduce lo spam nei log e potrebbe migliorare leggermente la velocità di caricamento evitando di stampare le tracce dello stack per alcune eccezioni comunemente generate durante il ricaricamento dei datapack (ad esempio, oggetti mancanti nelle tabelle di bottino/ricette). Il messaggio verrà comunque stampato.",
  "modernfix.option.mixin.perf.dedicated_reload_executor": "Tutte le versioni. Sposta il ricaricamento dei resource pack e dei datapack in un pool di thread dedicato anziché utilizzare i thread predefiniti `Worker-Main`. Questo consente ai mod Smooth Boot di potenzialmente migliorare le prestazioni in modalità singleplayer durante l'esecuzione, senza rallentare l'avvio a causa di un conteggio limitato di thread.",
  "modernfix.option.mixin.perf.deduplicate_location": "Tutte le versioni, ma disabilitato per impostazione predefinita a causa dell'impatto sui tempi di caricamento. Duplica i namespace e i percorsi delle risorse. Questo risparmia memoria, ma aumenta anche il costo di costruzione di una nuova `ResourceLocation` in modo significativo.",
  "modernfix.option.mixin.perf.dynamic_dfu": "Tutte le versioni. Modifica l'inizializzazione di DFU in modo che avvenga la prima volta che è necessario eseguire un aggiornamento. Questo è simile a LazyDFU, ma si differenzia in quanto evita di caricare *qualsiasi* classe/struttura dati DFU, mentre LazyDFU disabilita solo l'ottimizzazione delle regole. Fondamentalmente, questa opzione è una versione più sicura di DataFixerSlayer, in quanto caricherà comunque DFU quando necessario.\n\nIn genere dovresti continuare a utilizzare LazyDFU anche con questa opzione abilitata, in quanto l'ottimizzazione delle regole DFU altrimenti causerà lag.",
  "modernfix.option.mixin.perf.dynamic_resources": "Tutte le versioni. Vedi https://github.com/embeddedt/ModernFix/wiki/Dynamic-Resources-FAQ.",
  "modernfix.option.mixin.perf.dynamic_structure_manager": "Tutte le versioni. Consente al gioco di scaricare i file delle strutture dopo la generazione, anziché mantenerli caricati per sempre.",
  "modernfix.option.mixin.perf.fast_registry_validation": "Tutte le versioni. Forge cerca inutilmente un metodo tramite riflessione ogni volta che viene convalidato un registro. Questa patch semplicemente memorizza nella cache il valore restituito poiché sarà lo stesso ogni volta.",
  "modernfix.option.mixin.perf.faster_font_loading": "Tutte le versioni. Ottimizza il renderer dei font per caricare i font più velocemente, velocizzando il ricaricamento delle risorse.",
  "modernfix.option.mixin.perf.faster_item_rendering": "Tutte le versioni. Evita di renderizzare i lati degli oggetti nelle interfacce utente (GUI). (Sì, sembra che anche il gioco di base lo faccia.)\n\nQuesto può triplicare il frame rate (FPS) con un mod come REI/JEI installato su GPU meno potenti, se sono visibili abbastanza oggetti. Disabilitato per impostazione predefinita poiché è una funzionalità nuova e non testata molto, ma dovrebbe essere sicuro. Il problema più probabile è che gli oggetti siano completamente invisibili nelle interfacce utente (GUI) o che appaiano piatti nel mondo.",
  "modernfix.option.mixin.perf.faster_texture_loading": "Tutte le versioni precedenti alla 1.19.4. Evita di leggere le texture due volte (la prima volta utilizzando un percorso di codice molto lento) e invece ne effettua un caricamento più veloce (simile a 1.19.3+).",
  "modernfix.option.mixin.perf.faster_texture_stitching": "Tutte le versioni. Consente al gioco di utilizzare un sistema di cucitura delle texture più veloce, originariamente sviluppato da SuperCoder79 per lwjgl3ify su 1.7.10, che può risparmiare tempo durante il caricamento. Raramente si è riscontrato che causi artefatti strani su blocchi o interfacce utente (GUI), potrebbe essere un errore di Sodium.",
  "modernfix.option.mixin.perf.jeresources_startup": "Solo 1.16. Ottimizza Just Enough Resources in modo da non ricreare inutilmente le entità dei villaggi molte volte per la stessa professione, risparmiando tempo durante l'avvio di JEI.",
  "modernfix.option.mixin.perf.kubejs": "Solo 1.16. Ottimizzazioni per KubeJS per evitare copie inutili di `ItemStack`, ecc., riducendo il tempo richiesto per caricare i datapack.",
  "modernfix.option.mixin.perf.model_optimizations": "Tutte le versioni. Implementa ottimizzazioni per velocizzare il processo di caricamento dei modelli.",
  "modernfix.option.mixin.perf.nbt_memory_usage": "Tutte le versioni. Utilizza una mappa di supporto più efficiente per i tag NBT composti che deduplica i nomi chiave e utilizza anche una mappa di array per i composti molto piccoli. Ciò riduce l'onere di memorizzare molti tag composti in memoria.",
  "modernfix.option.mixin.perf.nuke_empty_chunk_sections": "Solo 1.16, ispirato a Hydrogen. Evita di memorizzare in memoria le sezioni di chunk piene di aria, segnalandole invece come vuote.",
  "modernfix.option.mixin.perf.remove_biome_temperature_cache": "Tutte le versioni. Rimuove la cache delle temperature dei biome come fa Lithium nelle versioni moderne.",
  "modernfix.option.mixin.perf.resourcepacks": "Tutte le versioni. **Un'ottimizzazione fondamentale.** I lanci nelle versioni moderne sono fortemente rallentati dall'accesso al filesystem. Molte richieste vengono fatte frequentemente ai pacchetti di risorse per elencare le risorse o verificare se esiste una risorsa specifica, e ognuna di queste richieste produce una chiamata API al file molto lenta.\n\nModernFix elimina completamente la maggior parte del collo di bottiglia semplicemente memorizzando in cache un elenco di tutte le risorse presenti nei pacchetti di risorse forniti dai mod e in quelli vanilla. La cache viene ricostruita alla ricarica delle risorse (ad eccezione delle risorse vanilla, poiché non dovrebbero mai cambiare mentre il gioco è in esecuzione).\n\nNon ci sono problemi di compatibilità noti con questa patch, ad eccezione di OptiFine (le sue risorse CTM non vengono caricate correttamente). Tuttavia, non consiglio di utilizzare OptiFine in nessuno scenario, poiché aggiunge diversi minuti all'avvio da solo e non è testato con ModernFix.",
  "modernfix.option.mixin.perf.reuse_datapacks": "Solo versione 1.16. Tenta di velocizzare il passaggio tra mondi in giocatore singolo saltando il riavvio dei datapack quando possibile. Potrebbe causare problemi di compatibilità con alcuni mod, ma è abilitato per impostazione predefinita.",
  "modernfix.option.mixin.perf.rewrite_registry": "Tutte le versioni. **Attualmente semi-rotto.** Sostituisce aggressivamente alcune parti interne del sistema di registro di Forge con versioni più veloci, tuttavia attualmente causa blocchi durante il caricamento di alcuni modpack. Disabilitato per impostazione predefinita per ovvi motivi.",
  "modernfix.option.mixin.perf.skip_first_datapack_reload": "Solo versioni 1.16 e 1.19. **Un'ottimizzazione fondamentale.**\n\nNel mezzo del ciclo di sviluppo 1.16, Forge ha patchato il gioco per ricaricare i datapack due volte quando si caricava un mondo esistente, al fine di risolvere un problema di spostamento dell'ID dei biome. Purtroppo, le ricariche dei datapack richiedono spesso più di 30 secondi e quindi questo influisce molto sui tempi di caricamento del mondo.\n\nModernFix apporta le modifiche necessarie per evitare questa ricarica, basandosi sulla pull request incompiuta di Forge #8163.\n\nQuesta modifica è stata rimossa da Forge nella versione 1.18, ma poi una patch simile è stata aggiunta *nuovamente* nella versione 1.19 per risolvere il problema dei datapack dei mod che non venivano caricati durante la creazione di nuovi mondi in giocatore singolo. Fortunatamente, il problema è limitato alla schermata di creazione del mondo nella versione 1.19, e i mondi esistenti richiedono solo una ricarica. Tuttavia, questo raddoppia comunque la durata della lag spike quando si fa clic su \"Crea nuovo mondo\" nella versione 1.19, quindi ModernFix apporta nuovamente modifiche per evitare una ricarica ridondante.",
  "modernfix.option.mixin.perf.state_definition_construct": "Tutte le versioni. Abilitato solo se è installato FerriteCore. Sfrutta la gestione dei blockstate di FerriteCore per accelerarne la creazione. Questo può aiutare ad accelerare l'avvio con mod che aggiungono molti blockstate, come ad esempio le mod di mobili.",
  "modernfix.option.mixin.perf.sync_executor_sleep": "Tutte le versioni. Evita che il thread principale giri inutilmente consumando un core della CPU mentre aspetta che i lavoratori di caricamento dei mod finiscano.",
  "modernfix.option.mixin.perf.thread_priorities": "Tutte le versioni. Regola le priorità dei thread dei lavoratori e del server in modo che siano inferiori al thread del client. Questo aiuta a migliorare la stabilità degli FPS su macchine con pochi core della CPU, purché l'implementazione Java in uso rispetti le priorità.",
  "modernfix.option.mixin.perf.use_integrated_resources": "Principalmente per la versione 1.16. Corregge JEResources affinché utilizzi i dati delle tabelle del bottino del server integrato se si gioca in giocatore singolo, anziché ricaricare inutilmente le tabelle del bottino. Risparmia alcuni secondi in più durante l'avvio di JEI.",
  "modernfix.option.mixin.bugfix.concurrency": "Le patch in questo gruppo risolvono problemi legati alla concorrenza in Minecraft e/o Forge. La maggior parte di esse provoca crash rari e difficili da diagnosticare durante il caricamento.",
  "modernfix.option.mixin.bugfix.edge_chunk_not_saved": "Questa opzione è un porting della mod Chunk Saving Fix di SuperCoder (perché non mi sono reso conto che era già disponibile per Forge all'epoca).",
  "modernfix.option.mixin.bugfix.mc218112": "Questa opzione risolve un deadlock che può verificarsi se viene lanciata un'eccezione durante l'elaborazione dei dati dell'entità. Vanilla non sblocca correttamente il gestore dei dati quando dovrebbe farlo. Questo è tracciato come MC-218112 nel bug tracker ed è stato corretto da Mojang nella versione 1.17.",
  "modernfix.option.mixin.bugfix.packet_leak": "**Sperimentale**, non abilitato per impostazione predefinita. Un tentativo di correzione per il problema di perdita di memoria che si verifica dopo aver giocato abbastanza a lungo nella versione 1.16.",
  "modernfix.option.mixin.bugfix.paper_chunk_patches": "Versioni 1.18 e successive. **Un'ottimizzazione fondamentale.** Porta una patch da Paper che risolve i problemi nella versione 1.17 con il caricamento dei chunk che richiede enormi quantità di memoria e genera molte istanze di `CompletableFuture`. Le versioni 1.18+ ora possono caricare mondi con soli 400MB di memoria come poteva fare la 1.16.",
  "modernfix.option.mixin.bugfix.tf_cme_on_load": "Modifica Twilight Forest per eseguire la configurazione client non thread-safe utilizzando il thread principale, come dovrebbe fare, anziché il thread worker FML.",
  "modernfix.option.mixin.feature.branding": "Aggiunge ModernFix all'elenco del marchio nella schermata dei titoli e anche alla schermata F3.",
  "modernfix.option.mixin.feature.direct_stack_trace": "Di solito disabilitato, può essere abilitato per forzare la traccia dello stack grezzo da registrare quando si verifica un crash. Occasionalmente, il sistema di report dei crash di Vanilla non funziona correttamente e fornisce una traccia/report dello stack completamente irrilevante.",
  "modernfix.option.mixin.feature.measure_time": "Utilizza alcune iniezioni per misurare il tempo di caricamento del mondo, il tempo di ricarica dei datapack, il tempo di ricarica delle risorse, il tempo di avvio e aggiunge i ganci necessari per abilitare la logica del profiler inutilizzata di Vanilla per la ricarica delle risorse, se configurato.",
  "modernfix.option.mixin.feature.spam_thread_dump": "**Da utilizzare solo per scopi di debug.** Fa sì che venga registrato un thread dump nel registro ogni 60 secondi. Questo può aiutare a diagnosticare i blocchi inspiegabili durante il caricamento/gioco.",
  "modernfix.option.mixin.bugfix.chunk_deadlock": "Tenta di prevenire i blocchi del sistema di chunk o fornisce informazioni di debug aggiuntive nel registro quando si verificano. Questi blocchi di solito si manifestano come il server che si blocca indefinitamente (ad esempio, le entità non si muovono), mentre il client continua a funzionare normalmente.",
  "modernfix.option.mixin.bugfix.chunk_deadlock.valhesia": "Modifica Valhesia Structures per risolvere un problema nel suo codice che causa blocchi frequenti del worldgen/caricamento dei chunk.",
  "modernfix.option.mixin.bugfix.cofh_core_crash": "Corregge un problema di multithreading in CoFH Core che può causare crash rari durante l'avvio.",
  "modernfix.option.mixin.bugfix.ctm_resourceutil_cme": "Corregge un problema di multithreading in ConnectedTexturesMod che può causare crash rari durante l'avvio.",
  "modernfix.option.mixin.bugfix.ender_dragon_leak": "Corregge una perdita di memoria in Vanilla causata dal drago dell'End che mantiene un riferimento al mondo client precedente.",
  "modernfix.option.mixin.bugfix.entity_load_deadlock": "Corregge molti problemi in cui EntityJoinWorldEvent/EntityJoinLevelEvent causano un blocco del worldgen, ritardando leggermente il caricamento dell'entità. Non dovrebbe, tuttavia, causare cambiamenti di comportamento visibili in gioco.",
  "modernfix.option.mixin.bugfix.fix_config_crashes": "Corregge il problema di Forge delle configurazioni che occasionalmente diventano corrotte durante il lancio del gioco.",
  "modernfix.option.mixin.bugfix.item_cache_flag": "Corregge MC-258939",
  "modernfix.option.mixin.bugfix.preserve_early_window_pos": "Fa sì che la finestra di gioco mantenga le sue dimensioni esistenti quando il controllo passa dal caricamento anticipato di Forge al codice di Minecraft. Corregge il problema della finestra che torna al centro dello schermo dopo essere stata trascinata, ecc.",
  "modernfix.option.mixin.bugfix.refinedstorage.te_bug": "Corregge i blocchi di archiviazione esterna di Refined Storage che occasionalmente non mostrano i contenuti dei cassetti, ecc. quando vengono caricati. Backport di Refined Storage PR #3435, che è stato applicato solo alla versione 1.18 e successive.",
  "modernfix.option.mixin.bugfix.remove_block_chunkloading": "Corregge il fatto che i maiali zombie tengano perpetuamente caricato il chunk 0, 0 su Forge. Backport di Forge PR #8583.",
  "modernfix.option.mixin.bugfix.starlight_emptiness": "Corregge un crash occasionale di Starlight dovuto all'inizializzazione non corretta delle mappe di vuoto. Backport della stessa correzione in Starlight per la versione 1.18.x.",
  "modernfix.option.mixin.core": "Patch di base necessarie per far funzionare ModernFix",
  "modernfix.option.mixin.perf.reduce_blockstate_cache_rebuilds": "Tutte le versioni. **Un'ottimizzazione fondamentale.** Le versioni più recenti di Minecraft (dopo la 1.12) hanno implementato un sistema di cache dei blockstate che memorizza le informazioni frequentemente utilizzate su un blockstate, come ad esempio se è solido, la sua forma di collisione, ecc. Ricostruire questa cache è abbastanza veloce nella versione standard (richiede solo uno o due secondi), ma è molto lento con molti mod installati, poiché sono presenti molti più blockstate nel gioco che devono tutti avere le loro cache ricostruite.\n\nQuesto problema viene esacerbato da Forge poiché la cache viene ricostruita in molti punti quando i dati sarebbero quasi certamente inutilizzati prima della successiva ricostruzione. Esempi includono subito prima di raggiungere il menu principale (durante la fase \"Freezing data\"), nonché più volte (!) quando viene caricato un mondo.\n\nModernFix risolve questo collo di bottiglia delle prestazioni rendendo invece le ricostruzioni della cache pigre. Ogni blockstate ricostruisce la sua cache la prima volta che i dati vengono acceduti. In qualsiasi momento in cui Vanilla o Forge tenterebbero di ricostruire le cache per tutti i blockstate, questo viene ridirezionato per invalidare semplicemente la cache su ciascun blockstate.\n\nQuesto non dovrebbe avere alcun impatto sul TPS dopo che l'avvio è concluso.",
  "modernfix.option.mixin.devenv": "Patch utilizzate durante l'esecuzione in un ambiente di sviluppo, per miglioramenti di velocità e/o test",
  "modernfix.option.mixin.safety": "Patch di concorrenza per prevenire crash durante il lancio",
  "modernfix.option.mixin.feature.integrated_server_watchdog": "Aggiunge il watchdog vanilla anche ai mondi in giocatore singolo, ma stampa solo le tracce dello stack anziché terminare forzatamente il mondo. Questa versione include la funzionalità di Fullstack Watchdog, ma quest'ultimo è comunque necessario per il multiplayer.",
  "modernfix.option.mixin.feature.snapshot_easter_egg": "Aggiunge funzionalità easter egg (non influisce su alcuna visualizzazione o comportamento vanilla) quando si esegue una versione snapshot.",
  "modernfix.option.mixin.feature.spark_profile_launch": "Se abilitato e installata una versione compatibile di Spark, l'intera sequenza di avvio verrà profilata fino al menu principale.",
  "modernfix.option.mixin.feature.warn_missing_perf_mods": "Mostra un avviso all'avvio se altri mod per le prestazioni considerati essenziali e altamente compatibili non sono presenti",
  "modernfix.option.mixin.launch.class_search_cache": "Sostituisce il risolutore delle risorse di Forge (usato per trovare il codice del gioco e di un mod) con una versione significativamente più veloce, accelerando l'avvio",
  "modernfix.option.mixin.perf.clear_fabric_mapping_tables": "Riduce l'utilizzo della memoria cancellando le strutture di dati di mappatura in Fabric Loader che sono ridondanti o raramente utilizzate dai mod. Disabilitato per impostazione predefinita per motivi di compatibilità.",
  "modernfix.option.mixin.perf.clear_mixin_classinfo": "Carica forzatamente tutti i mixin quando il lancio termina e quindi cancella le strutture di dati di mixin per rimuovere gran parte della memoria di Mixin. Disabilitato per impostazione predefinita per motivi di compatibilità.",
  "modernfix.option.mixin.perf.deduplicate_wall_shapes": "Rende la maggior parte dei blocchi murari condividere lo stesso oggetto forma anziché avere ognuno la propria copia. Può ridurre notevolmente l'utilizzo della memoria quando vengono aggiunti molti blocchi murari dai mod.",
  "modernfix.option.mixin.perf.dynamic_resources.ae2": "Patch di compatibilità AE2 per le risorse dinamiche",
  "modernfix.option.mixin.perf.dynamic_resources.ctm": "Patch di compatibilità CTM per le risorse dinamiche",
  "modernfix.option.mixin.perf.dynamic_resources.rs": "Patch di compatibilità Refined Storage per le risorse dinamiche",
  "modernfix.option.mixin.perf.dynamic_resources.supermartijncore": "Patch di compatibilità SuperMartijn642CoreLib per le risorse dinamiche",
  "modernfix.option.mixin.perf.dynamic_resources.diagonalfences": "Patch di compatibilità Diagonal Fences per le risorse dinamiche",
  "modernfix.option.mixin.perf.faster_advancements": "Riscrive la logica di controllo degli avanzamenti per renderla più veloce e per evitare StackOverflowError in pacchetti grandi. Porting di Advancements Debug da Fabric.",
  "modernfix.option.mixin.perf.patchouli_deduplicate_books": "Risolve il problema dei libri di Patchouli che memorizzano molti oggetti vuoti con tag NBT, riducendo l'utilizzo della memoria.",
  "modernfix.option.mixin.perf.remove_spawn_chunks": "Rimuove completamente i chunk di spawn dal gioco. Non vengono più caricati affatto, a differenza di Ksyxis.",
  "modernfix.option.mixin.perf.use_integrated_resources.jepb": "",
  "modernfix.option.mixin.perf.use_integrated_resources.jeresources": "",
  "modernfix.option.mixin.bugfix.blueprint_modif_memory_leak": "Risolve la perdita di risorse vaniglia di ObjectModificationManager in Blueprint, riducendo l'utilizzo della memoria. Nonostante la correzione sia stata contribuita in PR #195, non è ancora stata rilasciata.",
  "modernfix.option.mixin.bugfix.removed_dimensions": "Risolve il problema del gioco che non riesce a caricare i mondi se vengono rimossi i mod delle dimensioni. Backport di Forge PR #8959.",
  "modernfix.option.mixin.perf.compact_bit_storage": "Corregge lo spreco di memoria causato da alcuni server legacy (ad esempio Hypixel) che inviano chunk vuoti come se contenessero blocchi. Riduce notevolmente l'utilizzo della memoria su questi server.",
  "modernfix.option.mixin.perf.deduplicate_climate_parameters": "Deduplica gli oggetti parametro del clima utilizzati dal nuovo sistema di biome, può risparmiare ~2MB ma rallenta leggermente la ricarica dei datapack.",
  "modernfix.option.mixin.perf.dynamic_entity_renderers": "Costruisce i modelli delle entità la prima volta che vengono visti anziché durante l'avvio. Alcuni mod non sono compatibili con questa opzione e causeranno crash di EntityRenderer.",
  "modernfix.option.mixin.perf.twilightforest.structure_spawn_fix": "Risolve il lag causato dal worldgen di Twilight Forest che controlla le strutture in modo molto inefficiente",
  "modernfix.option.mixin.perf.fast_forge_dummies": "Velocizza il congelamento del registro di Forge durante l'avvio utilizzando un percorso del codice più veloce",
  "modernfix.option.mixin.perf.tag_id_caching": "Velocizza l'uso delle voci dei tag memorizzando nella cache l'oggetto di posizione anziché ricrearlo ogni volta",
  "modernfix.option.mixin.feature.disable_unihex_font": "Rimuove il font Unicode, risparmiando 10MB ma causando la mancata visualizzazione dei caratteri speciali"
  }
