{
  "key.modernfix": "ModernFix",
  "key.modernfix.config": "설정 화면 열기",
  "modernfix.jei_load": "JEI 로딩 중, 시간이 걸릴 수 있습니다.",
  "modernfix.no_lazydfu": "LazyDFU가 설치되지 않았습니다. Minecraft가 이전 버전의 게임 데이터를 업데이트해야 할 경우, 눈에 띄는 지연이 발생할 수 있습니다.",
  "modernfix.no_ferritecore": "FerriteCore가 설치되지 않았습니다. 메모리 사용량이 매우 높아질 것입니다.",
  "modernfix.connectedness_dynresoruces": "Connectedness와 ModernFix의 동적 자원 옵션은 호환되지 않습니다. Connectedness를 제거하거나 ModernFix 설정에서 동적 자원을 비활성화하세요.",
  "modernfix.perf_mod_warning": "모드를 설치하는 것이 권장되지만, 경고를 ModernFix 설정에서 비활성화할 수 있습니다.",
  "modernfix.config": "ModernFix 믹스인 설정",
  "modernfix.config.done_restart": "완료 (재시작 필요)",
  "modernfix.config.wiki": "위키 열기",
  "modernfix.message.reload_config": "모드 설정 파일 변경이 감지되었습니다. 파일이 저장되지 않은 상태로 로딩되는 것을 방지하려면 /mfrc 명령어로 재로드를 실행해야 합니다.",
  "modernfix.option.on": "켜기",
  "modernfix.option.off": "끄기",
  "modernfix.option.disabled": "비활성화됨",
  "modernfix.option.enabled": "활성화됨",
  "modernfix.option.mod_override": " 모드 [%s]에 의해",
  "modernfix.config.not_default": " (수정됨)",
  "asynclocator.map.locating": "지도 (위치 확인 중...)",
  "asynclocator.map.none": "지도 (근처에 기능 없음)",
  "modernfix.option.category.performance": "성능",
  "modernfix.option.category.performance.description": "게임/런처 성능을 개선하는 기능",
  "modernfix.option.category.bugfixes": "버그 수정",
  "modernfix.option.category.bugfixes.description": "게임 안정성을 개선하는 핵심 버그 수정",
  "modernfix.option.category.troubleshooting": "문제 해결/유틸리티",
  "modernfix.option.category.troubleshooting.description": "문제 진단을 지원하는 기능",
  "modernfix.option.category.expert_only": "전문가 전용",
  "modernfix.option.category.expert_only.description": "무엇을 하고 있는지 확실하지 않으면 변경하지 마세요",
  "modernfix.option.name.mixin.perf.async_jei": "백그라운드 JEI 로딩",
  "modernfix.option.mixin.perf.async_jei": "1.16 전용. **주요 최적화.** JEI의 재로딩을 백그라운드 스레드에서 수행하도록 패치하여 월드 로딩 시 추가되는 긴 지연을 완전히 제거합니다.",
  "modernfix.option.mixin.perf.async_locator": "1.16 전용. `/locate`, 전리품 테이블 생성 등과 관련된 서버 동결을 제거하는 Async Locator 모드의 패치를 백포트합니다.",
  "modernfix.option.mixin.perf.biome_zoomer": "1.16 전용. 1.18의 로직을 사용하여 생물군계 확대기의 성능을 개선하는 소규모 최적화.",
  "modernfix.option.mixin.perf.blast_search_trees": "모든 버전. REI 또는 JEI가 설치된 경우, 크리에이티브 검색을 위한 기본 검색 트리의 구성이 비활성화되며, 대신 이러한 모드의 검색 구현을 사용하여 검색이 이루어집니다. 이로 인해 월드 로딩 시 몇 초의 시간이 절약되며, 아마도 일부 RAM도 절약될 것입니다 (측정된 바는 없습니다).",
  "modernfix.option.mixin.perf.boost_worker_count": "1.16 전용. 작업자 스레드 수에 대한 하드코딩된 상한을 제거하며, 이는 Mojang이 1.18에서 한 것과 유사합니다.",
  "modernfix.option.mixin.perf.cache_blockstate_cache_arrays": "모든 버전. 블록상태 캐시가 초기화될 때마다 열거형 배열의 새 복사본을 생성하지 않도록 합니다. 소규모 최적화지만, 구현하기는 쉽습니다.",
  "modernfix.option.mixin.perf.cache_model_materials": "모든 버전. 모델이 반환하는 `RenderMaterial` (텍스처) 컬렉션과 의존성 목록을 메모이즈하여 매 요청 시 재계산을 요구하지 않습니다. 모델 로드/베이크 프로세스를 가속화하는 데 도움이 됩니다.",
  "modernfix.option.mixin.perf.cache_strongholds": "모든 버전. 강철의 위치 목록을 생성한 후 월드와 함께 저장하며, 매번 월드 로드 시 다시 생성하지 않습니다. 1.16에서는 약간의 시간을 절약하고, 1.18 및 1.19에서는 훨씬 더 많은 시간을 절약합니다.",
  "modernfix.option.mixin.perf.cache_upgraded_structures": "모든 버전. 많은 모드가 구식 구조 파일을 제공하며, 이로 인해 게임이 DFU를 사용하여 파일을 매번 업그레이드해야 합니다. 이는 매우 느릴 수 있습니다. 이 패치는 업그레이드된 구조 버전을 저장하고 다음 로드 시 재사용하도록 합니다. 모드가 구조 파일의 이름은 변경하지 않고 내용을 변경하는 경우를 처리하기 위해, 원본 파일의 해시를 캐시된 버전과 비교하며 일치하지 않으면 구조가 다시 업그레이드됩니다.",
  "modernfix.option.mixin.perf.compress_biome_container": "1.16 전용. Hydrogen에서 차용한 소규모 최적화로, 가능한 경우 생물군계 컨테이너의 공간을 절약하려고 시도합니다. BetterEnd 또는 Chocolate과 같은 충돌 모드가 설치되면 자동으로 비활성화됩니다.",
  "modernfix.option.mixin.perf.datapack_reload_exceptions": "모든 버전. 일부 자주 발생하는 예외 (예: 전리품 테이블/레시피에서 누락된 항목) 동안 스택 추적을 인쇄하지 않으므로 로그 스팸을 줄이고 로딩 속도가 약간 개선될 수 있습니다. 메시지는 여전히 인쇄됩니다.",
  "modernfix.option.mixin.perf.dedicated_reload_executor": "모든 버전. 리소스 팩과 데이터 팩 재로드를 기본 `Worker-Main` 스레드 대신 전용 작업자 풀로 이동시킵니다. 이는 모드가 부드러운 부팅을 계속 지원하면서 제한된 스레드 수로 인해 런처 속도를 느리게 하지 않으면서 싱글플레이어 성능을 개선할 수 있게 합니다.",
  "modernfix.option.mixin.perf.deduplicate_location": "모든 버전, 하지만 로드 시간 영향으로 기본적으로 비활성화됨. 리소스 위치 네임스페이스와 경로의 중복을 제거합니다. 이는 RAM을 절약하지만 새 `ResourceLocation`을 구성하는 비용이 많이 증가합니다.",
  "modernfix.option.mixin.perf.dynamic_dfu": "모든 버전. DFU 초기화가 필요할 때 처음으로 발생하도록 수정합니다. 이는 LazyDFU와 비슷하지만, *어떠한* DFU 클래스/데이터 구조도 로드하지 않고 LazyDFU는 규칙 최적화만 비활성화합니다. 본질적으로, 이 옵션은 필요할 때 DFU를 로드하기 때문에 DataFixerSlayer의 더 안전한 버전입니다.\n\n이 옵션이 활성화된 경우에도 LazyDFU를 계속 사용하는 것이 좋습니다. 그렇지 않으면 DFU 규칙 최적화가 지연을 유발할 수 있습니다.",
  "modernfix.option.mixin.perf.dynamic_resources": "모든 버전. 자세한 내용은 https://github.com/embeddedt/ModernFix/wiki/Dynamic-Resources-FAQ를 참조하세요.",
  "modernfix.option.mixin.perf.dynamic_sounds": "모든 버전. 게임이 사운드를 언로드할 수 있게 하여 사운드가 로드된 후 무기한 유지되는 것을 방지합니다.",
  "modernfix.option.mixin.perf.dynamic_structure_manager": "모든 버전. 구조 파일 생성이 완료된 후 구조 파일을 언로드할 수 있게 하여 무한히 로드된 상태로 유지되는 것을 방지합니다.",
  "modernfix.option.mixin.perf.fast_registry_validation": "모든 버전. Forge는 레지스트리를 검증할 때마다 불필요하게 메서드를 반사로 조회합니다. 이 패치는 반환 값을 캐시하므로 매번 동일합니다.",
  "modernfix.option.mixin.perf.faster_font_loading": "모든 버전. 폰트 렌더러를 최적화하여 폰트 로딩을 빠르게 하여 리소스 리로드 속도를 높입니다.",
  "modernfix.option.mixin.perf.faster_item_rendering": "모든 버전. GUI에서 아이템의 측면을 렌더링하지 않습니다. (예, 기본적으로 이렇게 보입니다.)\n\n이 모드를 사용하면 약한 GPU에서 REI/JEI 모드가 설치된 경우 FPS가 세 배로 증가할 수 있습니다. 기본적으로 비활성화되어 있으며, 새로운 기능이어서 많이 테스트되지 않았지만, 안전해야 합니다. 가장 가능성 있는 문제는 GUI에서 아이템이 완전히 보이지 않거나, 월드에서 평평하게 보이는 것입니다.",
  "modernfix.option.mixin.perf.faster_texture_loading": "모든 버전 1.19.4 이전. 텍스처를 두 번 읽지 않고 (첫 번째는 매우 느린 코드 경로를 사용) 대신 더 빠른 로드를 수행합니다 (1.19.3+와 유사).",
  "modernfix.option.mixin.perf.faster_texture_stitching": "모든 버전. 게임이 1.7.10에서 SuperCoder79가 lwjgl3ify를 위해 작성한 더 빠른 텍스처 스티칭 시스템을 사용하게 하며, 로딩 중 시간을 절약할 수 있습니다. 드물게, 블록이나 GUI에서 이상한 아티팩트가 발생할 수 있으며, 이는 Sodium 버그일 수 있습니다.",
  "modernfix.option.mixin.perf.jeresources_startup": "1.16 전용. Just Enough Resources를 최적화하여 같은 직업의 마을 주민 엔티티를 불필요하게 재생성하지 않도록 하며, JEI 시작 시 시간을 절약합니다.",
  "modernfix.option.mixin.perf.kubejs": "1.16 전용. KubeJS를 최적화하여 불필요한 `ItemStack` 복사 등을 방지하여 데이터 팩 로딩 시간을 단축합니다.",
  "modernfix.option.mixin.perf.model_optimizations": "모든 버전. 모델 로딩 프로세스를 가속화하는 최적화를 구현합니다.",
  "modernfix.option.mixin.perf.nbt_memory_usage": "모든 버전. 키 이름을 중복 제거하고 매우 작은 compound에 배열 맵을 사용하는 보다 효율적인 백킹 맵을 사용합니다. 이는 많은 compound 태그를 메모리에 저장하는 오버헤드를 줄입니다.",
  "modernfix.option.mixin.perf.nuke_empty_chunk_sections": "1.16 전용, Hydrogen에서 영감을 받음. 공기로 가득 찬 청크 섹션을 메모리에 저장하지 않고 빈 것으로 표시합니다.",
  "modernfix.option.mixin.perf.reduce_blockstate_cache_rebuilds": "모든 버전. **주요 최적화.** 최신 Minecraft 버전(1.12 이후)은 블록상태 캐시 시스템을 구현하여 블록상태에 대한 자주 사용되는 정보를 캐시합니다. 이 캐시를 재구성하는 것은 기본적으로 빠르지만 (1~2초가 소요됨), 많은 모드가 설치된 경우에는 블록상태가 많아져서 느려질 수 있습니다.\n\n이 문제는 Forge에 의해 악화되며, 데이터가 다음 재구성 전에 거의 사용되지 않을 때 캐시가 여러 지점에서 재구성됩니다. 예를 들어, 메인 메뉴에 도달하기 직전("데이터 동결" 단계)과 월드 로드 시 여러 번 포함됩니다.\n\nModernFix는 캐시 재구성을 지연시켜 이 성능 병목 현상을 해결합니다. 각 블록상태는 데이터에 처음 접근할 때 캐시를 재구성합니다. Vanilla 또는 Forge가 모든 블록상태에 대해 캐시를 재구성하려고 할 때, 이는 각 블록상태의 캐시를 무효화하는 것으로 변경됩니다.\n\n이 변경은 시작 후 TPS에 영향을 미치지 않아야 합니다.",
  "modernfix.option.mixin.perf.remove_biome_temperature_cache": "모든 버전. 현대 버전의 Lithium처럼 생물군계 온도 캐시를 제거합니다.",
  "modernfix.option.mixin.perf.resourcepacks": "모든 버전. **주요 최적화.** 현대 버전에서는 파일 시스템 접근이 큰 병목 현상을 일으킵니다. 많은 요청이 리소스 팩에 대해 자원을 나열하거나 주어진 자원이 존재하는지 확인하며, 각 요청은 매우 느린 파일 API 호출을 초래합니다.\n\nModernFix는 모드 제공 및 기본 리소스 팩 내의 모든 자원의 목록을 캐시하여 대부분의 병목 현상을 완전히 제거합니다. 캐시는 리소스 리로드 시 재구성됩니다 (기본 리소스는 게임 실행 중 변경되지 않으므로 제외됩니다).\n\n이 패치와 호환성 문제는 알려져 있지 않지만 OptiFine과는 호환되지 않습니다 (OptiFine의 CTM 자원이 올바르게 로드되지 않습니다). 그러나 OptiFine을 사용하는 것을 권장하지 않으며, 이는 자체적으로 몇 분의 런칭 시간을 추가하고 ModernFix와 전혀 테스트되지 않았습니다.",
  "modernfix.option.mixin.perf.reuse_datapacks": "1.16 전용. 가능할 경우 데이터 팩 재로드를 건너뛰어 싱글플레이어 월드 간 전환 속도를 높이려고 합니다. 일부 모드와의 호환성 문제를 일으킬 수 있지만 현재 기본적으로 활성화되어 있습니다.",
  "modernfix.option.mixin.perf.rewrite_registry": "모든 버전. **현재 반파손 상태.** Forge 레지스트리 시스템의 일부 내부를 더 빠른 버전으로 교체합니다. 그러나 현재 일부 모드팩 로딩 시 정지 현상이 발생합니다. 명백한 이유로 기본적으로 비활성화되어 있습니다.",
  "modernfix.option.mixin.perf.skip_first_datapack_reload": "1.16 및 1.19 전용. **주요 최적화.**\n\n1.16 개발 주기 중 Forge는 기존 월드를 로드할 때 데이터 팩을 두 번 다시 로드하도록 패치했습니다. 이는 생물군계 ID 이동 문제를 해결하기 위한 것이었지만, 데이터 팩 재로드는 종종 30초 이상 소요되어 월드 로딩 시간이 심각하게 영향을 받습니다.\n\nModernFix는 Forge PR #8163의 미완성 버전을 기반으로 이 재로드를 방지하기 위한 필요한 변경을 수행합니다.\n\n이 변경은 1.18에서 Forge에 의해 제거되었지만, 1.19에서 새로운 싱글플레이어 월드 생성 시 모드 데이터 팩이 로드되지 않는 문제를 해결하기 위해 유사한 패치가 다시 추가되었습니다. 다행히도 이 문제는 1.19의 월드 생성 화면에만 국한되며 기존 월드는 한 번의 재로드만 필요합니다. 그러나 이는 여전히 1.19에서 "새 월드 생성" 클릭 시 지연 스파이크의 길이를 두 배로 늘리며, ModernFix는 중복 재로드를 수행하지 않도록 변경합니다.",
  "modernfix.option.mixin.perf.state_definition_construct": "모든 버전. FerriteCore가 설치된 경우에만 활성화됩니다. FerriteCore의 블록상태 처리 방식을 활용하여 블록상태 생성을 가속화합니다. 이는 많은 블록상태를 추가하는 모드 (예: 가구 모드)와 함께 런칭 속도를 높이는 데 도움이 될 수 있습니다.",
  "modernfix.option.mixin.perf.sync_executor_sleep": "모든 버전. 모드 로딩 작업자가 끝나기를 기다리면서 메인 스레드가 하나의 CPU 코어를 공회전하며 소모하지 않도록 합니다.",
  "modernfix.option.mixin.perf.thread_priorities": "모든 버전. 작업자 및 서버 스레드 우선 순위를 클라이언트 스레드보다 낮게 조정합니다. 이는 몇 개의 CPU 코어가 있는 머신에서 FPS 안정성을 개선하는 데 도움이 됩니다. 사용하는 Java 구현이 우선 순위를 존중하는 경우에만 적용됩니다.",
  "modernfix.option.mixin.perf.use_integrated_resources": "주로 1.16 전용. JEResources를 패치하여 싱글플레이어 플레이 시 통합 서버의 전리품 테이블 데이터를 사용하도록 하며, 무의미하게 전리품 테이블을 다시 로드하지 않습니다. JEI 시작 시 몇 초를 추가로 절약합니다.",
  "modernfix.option.mixin.bugfix.concurrency": "이 그룹의 패치는 Minecraft 및/또는 Forge 내의 동시성 관련 문제를 수정합니다. 대부분은 로딩 중 드물고 진단하기 어려운 충돌을 초래합니다.",
  "modernfix.option.mixin.bugfix.edge_chunk_not_saved": "이 옵션은 SuperCoder의 Chunk Saving Fix 모드를 포팅한 것입니다 (당시 이미 Forge용으로 사용 가능한 것을 인식하지 못했습니다).",
  "modernfix.option.mixin.bugfix.mc218112": "이 옵션은 엔티티 데이터 처리 중 예외가 발생하면 교착 상태가 발생하는 문제를 수정합니다. Vanilla은 데이터 관리자 잠금을 올바르게 해제하지 않습니다. 이는 버그 트래커에서 MC-218112로 추적되며, Mojang이 1.17에서 수정했습니다.",
  "modernfix.option.mixin.bugfix.packet_leak": "**실험적**, 기본적으로 비활성화됨. 1.16에서 충분히 오랜 시간 플레이한 후 발생하는 메모리 누수 문제를 해결하려고 시도합니다.",
  "modernfix.option.mixin.bugfix.paper_chunk_patches": "1.18 이상. **주요 최적화.** 1.17에서 청크 로딩 시 많은 메모리와 많은 `CompletableFuture` 인스턴스를 생성하는 문제를 해결하는 Paper 패치를 포팅합니다. 이제 1.18+는 1.16과 같이 400MB의 메모리로 월드를 로드할 수 있습니다.",
  "modernfix.option.mixin.bugfix.tf_cme_on_load": "Twilight Forest를 패치하여 FML 작업자 스레드가 아니라 메인 스레드를 사용하여 스레드-안전하지 않은 클라이언트 설정을 수행합니다.",
  "modernfix.option.mixin.feature.branding": "타이틀 화면 및 F3 화면에 ModernFix를 브랜딩 목록에 추가합니다.",
  "modernfix.option.mixin.feature.direct_stack_trace": "기본적으로 꺼져 있으며, 충돌 발생 시 원시 스택 추적을 로그에 덤프하도록 강제할 수 있습니다. 때때로 Vanilla의 충돌 보고서 시스템이 제대로 작동하지 않으며, 완전히 무관한 스택 추적/보고서를 제공합니다.",
  "modernfix.option.mixin.feature.measure_time": "월드 로드 시간, 데이터 팩 재로드 시간, 리소스 리로드 시간, 부트스트랩 시간 등을 측정하기 위해 몇 가지 주입을 사용하며, 설정된 경우 Vanilla의 사용되지 않는 프로파일러 로직을 리소스 리로드에 사용하도록 추가적인 후크를 추가합니다.",
  "modernfix.option.mixin.feature.spam_thread_dump": "**디버깅 목적으로만 사용됩니다.** 60초마다 스레드 덤프를 로그에 출력합니다. 이는 로딩/게임플레이 중 설명할 수 없는 정지를 진단하는 데 도움이 될 수 있습니다.",
  "modernfix.option.mixin.bugfix.chunk_deadlock": "청크 시스템 교착 상태를 방지하거나 발생 시 추가 디버깅 정보를 로그에 제공하려고 시도합니다. 이러한 교착 상태는 일반적으로 서버가 무기한 멈추는 것으로 나타나며 (예: 엔티티가 움직이지 않음), 클라이언트는 정상적으로 작동합니다.",
  "modernfix.option.mixin.bugfix.chunk_deadlock.valhesia": "Valhesia Structures의 코드를 패치하여 빈번한 월드 생성/청크 로딩 교착 상태를 해결합니다.",
  "modernfix.option.mixin.bugfix.cofh_core_crash": "CoFH Core의 멀티스레딩 문제를 수정하여 런칭 중 드물게 발생하는 충돌을 방지합니다.",
  "modernfix.option.mixin.bugfix.ctm_resourceutil_cme": "ConnectedTexturesMod의 멀티스레딩 문제를 수정하여 런칭 중 드물게 발생하는 충돌을 방지합니다.",
  "modernfix.option.mixin.bugfix.ender_dragon_leak": "엔더 드래곤이 이전 클라이언트 월드에 대한 참조를 유지하여 발생하는 메모리 누수를 수정합니다.",
  "modernfix.option.mixin.bugfix.entity_load_deadlock": "EntityJoinWorldEvent/EntityJoinLevelEvent가 월드 생성 교착 상태를 초래하는 여러 문제를 수정하며, 엔티티 로딩을 약간 지연시킵니다. 그러나 게임 내에서 눈에 띄는 동작 변화는 발생하지 않아야 합니다.",
  "modernfix.option.mixin.bugfix.fix_config_crashes": "게임 시작 시 Forge 설정이 가끔 손상되는 문제를 수정합니다.",
  "modernfix.option.mixin.bugfix.item_cache_flag": "MC-258939 문제를 수정합니다.",
  "modernfix.option.mixin.bugfix.preserve_early_window_pos": "Forge의 초기 로딩에서 Minecraft 코드로 제어가 넘어갈 때 게임 창의 기존 크기를 유지하도록 합니다. 창을 드래그한 후 화면 중앙으로 되돌아가는 문제 등을 수정합니다.",
  "modernfix.option.mixin.bugfix.refinedstorage.te_bug": "Refined Storage 외부 저장 블록이 로드될 때 드물게 서랍 등의 내용을 표시하지 않는 문제를 수정합니다. 이는 1.18 및 이후 버전에만 적용된 Refined Storage PR #3435의 백포트입니다.",
  "modernfix.option.mixin.bugfix.remove_block_chunkloading": "좀비 피그맨이 Forge에서 0, 0 청크를 영구적으로 로드하는 문제를 수정합니다. Forge PR #8583의 백포트입니다.",
  "modernfix.option.mixin.bugfix.starlight_emptiness": "빈도 수가 초기화되지 않아 발생하는 Starlight 충돌을 수정합니다. 1.18.x의 Starlight에 대한 동일한 수정의 백포트입니다.",
  "modernfix.option.mixin.core": "ModernFix가 작동하기 위해 필요한 핵심 패치입니다.",
  "modernfix.option.mixin.devenv": "개발 환경에서 실행할 때 사용되는 패치로, 속도 개선 및/또는 테스트를 위한 것입니다.",
  "modernfix.option.mixin.safety": "런칭 중 충돌을 방지하기 위한 동시성 패치입니다.",
  "modernfix.option.mixin.feature.integrated_server_watchdog": "싱글플레이어 월드에서도 기본 감시 도구를 추가하지만, 월드를 강제로 종료하기보다는 스택 추적을 출력합니다. 이 버전은 Fullstack Watchdog의 기능을 포함하지만, 멀티플레이어에는 여전히 Fullstack Watchdog이 필요합니다.",
  "modernfix.option.mixin.feature.snapshot_easter_egg": "스냅샷 버전에서 실행할 때 부활절 달걀 기능을 추가합니다 (기본 시각적 효과나 동작에는 영향을 미치지 않습니다).",
  "modernfix.option.mixin.feature.spark_profile_launch": "활성화되면, 호환 가능한 Spark 버전이 설치된 경우 전체 런칭 시퀀스가 메인 메뉴까지 프로파일링됩니다.",
  "modernfix.option.mixin.feature.warn_missing_perf_mods": "기타 필수적이고 호환성이 높은 성능 모드가 없을 경우 시작 시 경고를 표시합니다.",
  "modernfix.option.mixin.launch.class_search_cache": "게임 및 모드 코드를 찾는 데 사용되는 Forge의 리소스 탐색기를 더 빠른 버전으로 대체하여 런칭 속도를 높입니다.",
  "modernfix.option.mixin.perf.clear_fabric_mapping_tables": "메모리 사용을 줄이기 위해 Fabric Loader에서 중복되거나 모드에서 거의 사용되지 않는 매핑 데이터 구조를 삭제합니다. 호환성 문제로 기본적으로 비활성화되어 있습니다.",
  "modernfix.option.mixin.perf.clear_mixin_classinfo": "런칭이 완료되면 모든 믹스인을 강제로 로드하고, 그 후 믹스인 데이터 구조를 지워 Mixin의 메모리 사용량을 대부분 제거합니다. 호환성 문제로 기본적으로 비활성화되어 있습니다.",
  "modernfix.option.mixin.perf.deduplicate_wall_shapes": "대부분의 벽 블록이 각기 다른 복사본을 갖는 대신 동일한 형태 객체를 공유하도록 합니다. 모드에서 많은 벽 블록이 추가될 때 메모리 사용량을 상당히 줄일 수 있습니다.",
  "modernfix.option.mixin.perf.dynamic_resources.ae2": "AE2 호환성 패치입니다.",
  "modernfix.option.mixin.perf.dynamic_resources.ctm": "CTM 호환성 패치입니다.",
  "modernfix.option.mixin.perf.dynamic_resources.rs": "Refined Storage 호환성 패치입니다.",
  "modernfix.option.mixin.perf.dynamic_resources.supermartijncore": "SuperMartijn642CoreLib 호환성 패치입니다.",
  "modernfix.option.mixin.perf.dynamic_resources.diagonalfences": "Diagonal Fences 호환성 패치입니다.",
  "modernfix.option.mixin.perf.faster_advancements": "진척 상황 검사 로직을 재작성하여 속도를 높이고 큰 팩에서 StackOverflowError를 유발하지 않도록 합니다. Fabric에서 Advancements Debug의 포트입니다.",
  "modernfix.option.mixin.perf.patchouli_deduplicate_books": "Patchouli 책이 많은 빈 항목을 NBT 태그와 함께 저장하는 문제를 수정하여 메모리 사용량을 줄입니다.",
  "modernfix.option.mixin.perf.remove_spawn_chunks": "게임에서 스폰 청크를 완전히 제거합니다. Ksyxis와는 달리 이제는 전혀 로드되지 않습니다.",
  "modernfix.option.mixin.perf.use_integrated_resources.jepb": "",
  "modernfix.option.mixin.perf.use_integrated_resources.jeresources": "",
  "modernfix.option.mixin.bugfix.blueprint_modif_memory_leak": "Blueprint의 ObjectModificationManager가 vanilla 리소스를 유출하는 문제를 수정하여 메모리 사용량을 줄입니다. PR #195에서 기여된 수정이지만 아직 릴리스되지 않았습니다.",
  "modernfix.option.mixin.bugfix.removed_dimensions": "차원 모드가 제거되었을 때 게임이 월드를 로드하지 못하는 문제를 수정합니다. Forge PR #8959의 백포트입니다.",
  "modernfix.option.mixin.perf.compact_bit_storage": "일부 레거시 서버(예: Hypixel)가 빈 청크를 블록이 포함된 것처럼 보내는 문제로 인한 메모리 낭비를 수정합니다. 이러한 서버에서 메모리 사용량을 크게 줄입니다.",
  "modernfix.option.mixin.perf.deduplicate_climate_parameters": "새로운 생물 군계 시스템에서 사용되는 기후 매개변수 객체를 중복 제거하여 약 2MB를 절약할 수 있지만, 데이터팩 재로드 속도를 다소 느리게 할 수 있습니다.",
  "modernfix.option.mixin.perf.dynamic_entity_renderers": "런칭 중이 아니라 처음 보는 순간 엔티티 모델을 생성합니다. 일부 모드는 이 옵션과 호환되지 않으며, EntityRenderer 충돌을 일으킬 수 있습니다.",
  "modernfix.option.mixin.perf.twilightforest.structure_spawn_fix": "Twilight Forest 월드 생성이 구조를 비효율적으로 확인하여 발생하는 지연을 수정합니다.",
  "modernfix.option.mixin.perf.fast_forge_dummies": "런칭 중 Forge 레지스트리 고정을 더 빠른 코드 경로를 사용하여 가속화합니다.",
  "modernfix.option.mixin.perf.tag_id_caching": "태그 항목의 사용을 가속화하기 위해 위치 객체를 캐싱하여 매번 새로 생성하는 대신 사용합니다.",
  "modernfix.option.mixin.feature.disable_unihex_font": "Unicode 폰트를 제거하여 10MB를 절약하지만, 특수 문자가 더 이상 렌더링되지 않습니다.",
  "modernfix.option.mixin.bugfix.world_leaks": "차원 전환 후 필요 없는 오래된 클라이언트 측 월드의 메모리 사용량을 줄입니다. 일반적으로 vanilla에서는 가비지 컬렉션되지만, 모드가 때때로 이들에 대한 참조를 유지할 수 있습니다.",
  "modernfix.option.mixin.perf.compact_mojang_registries": "(Fabric) 실험적인 옵션으로, 레지스트리의 메모리 사용량을 약 50% 줄입니다. 수백만 개의 블록과 아이템을 포함하지 않는 대부분의 모드팩에서는 유용하지 않습니다.",
  "modernfix.option.mixin.perf.dynamic_block_codecs": "모든 블록(상태)에 대한 코덱을 저장하는 것을 피하고, 필요할 때마다 동적으로 생성하고 캐시합니다. 수백만 개의 블록/아이템이 있는 경우가 아니면 일반적으로 활성화할 가치가 없습니다.",
  "modernfix.option.mixin.perf.faster_command_suggestions": "명령어를 입력할 때 수십만 개의 제안이 있을 경우의 지연을 완화합니다.",
  "modernfix.option.mixin.perf.mojang_registry_size": "블록/아이템 등록이 이미 등록된 수에 비례하여 느려지는 문제를 수정합니다. 이를 통해 시작 시간을 개선합니다.",
  "modernfix.option.mixin.perf.cache_profile_texture_url": "불필요한 URL 객체 생성을 피하고 해골 블록 렌더링 속도를 높입니다.",
  "modernfix.option.mixin.bugfix.entity_pose_stack": "Forge 문제 #9118을 수정하여, 모드가 매트릭스 스택을 푸시한 채 팝하지 않아 디버깅이 불가능한 렌더링 충돌을 일으키는 문제를 해결합니다.",
  "modernfix.option.mixin.bugfix.file_dialog_title": "월드 생성 설정 파일 대화 상자의 보안 문제를 수정합니다.",
  "modernfix.option.mixin.bugfix.forge_vehicle_packets": "차량을 타고 있는 플레이어가 청크 경계에 있을 때, Forge 패치로 인해 지나치게 많은 청크 데이터 패킷이 전송되는 버그를 수정합니다.",
  "modernfix.option.mixin.bugfix.mantle_model_cme": "Tinkers Construct 콘텐츠 렌더링 중 랜덤한 ConcurrentModificationException 충돌을 일으킬 수 있는 Mantle의 버그를 수정합니다.",
  "modernfix.option.mixin.bugfix.model_data_manager_cme": "Forge ModelDataManager 시스템의 설계 결함으로 인해 예기치 않은 동시성 문제를 일으킬 수 있는 문제를 해결합니다.",
  "modernfix.option.mixin.bugfix.recipe_book_type_desync": "모드가 사용자 정의 레시피 북 항목 유형을 추가하면, vanilla 서버에 연결할 때 Forge 클라이언트가 분리되는 문제를 수정합니다.",
  "modernfix.option.mixin.bugfix.unsafe_modded_shape_caches": "블록 모양을 계산할 때 콘텐츠 모드에서 발생할 수 있는 다양한 ConcurrentModificationException을 수정합니다.",
  "modernfix.option.mixin.feature.stalled_chunk_load_detection": "청크 로딩 중단의 원인을 감지하는 데 도움이 될 수 있는 옵션입니다. 그러나 이 옵션을 활성화하면 성능이 약간 나빠질 수 있습니다.",
  "modernfix.option.mixin.perf.fix_loop_spin_waiting": "Minecraft의 내장 대기 함수가 과도한 CPU 자원을 소비하는 문제를 수정합니다.",
  "modernfix.option.mixin.perf.forge_cap_retrieval": "Forge에서 사용자 정의 엔티티 데이터를 검색하는 것을 약간 더 효율적으로 만드는 미세 최적화입니다.",
  "modernfix.option.mixin.perf.forge_registry_lambda": "Forge의 핫 레지스트리 메서드에서 과도한 할당을 초래하는 문제를 수정합니다.",
  "modernfix.option.mixin.bugfix.restore_old_dragon_movement": "MC-272431을 수정하여, 엔더 드래곤이 1.13 및 이전 버전에서처럼 포탈로 다이빙할 수 없게 되는 문제를 해결합니다. 이는 드래곤의 비행 방식을 현대 플레이어가 익숙한 것과 많이 다르게 만들며, 원 사이클링 문제도 패치하므로 기본적으로 활성화되어 있지 않습니다. Jukitsu에게 vanilla 코드의 회귀를 식별해준 것에 감사드립니다."
}
