{
  "key.modernfix": "ModernFix",
  "key.modernfix.config": "Открыть экран настройки",
  "modernfix.jei_load": "Загрузка JEI, подождите немного",
  "modernfix.no_lazydfu": "LazyDFU не установлен. Если игре нужно будет обновить информацию с более старых версий, могут возникнуть значительные лаги.",
  "modernfix.no_ferritecore": "FerriteCore не установлен. Затраты ОЗУ будут высокими.",
  "modernfix.connectedness_dynresoruces": "Connectedness и динамические ресурсы ModernFix'а не совместимы. Удалите Connectedness или выключите динамические ресурсы в конфиге ModernFix'а.",
  "modernfix.perf_mod_warning": "Рекомендуем установить данные моды, однако предупреждения могут быть выключены в конфиге ModernFix'а.",
  "modernfix.config": "Конфиг миксинов ModernFix",
  "modernfix.config.done_restart": "Готово (рестарт необходим)",
  "modernfix.config.wiki": "Открыть вики",
  "modernfix.message.reload_config": "Были замечены изменения в конфиге мода. Чтобы предотвратить загрузку ещё несохранённых файлов, их загрузка может быть запущена командой /mfrc.",
  "modernfix.option.on": "вкл",
  "modernfix.option.off": "выкл",
  "modernfix.option.disabled": "выключен",
  "modernfix.option.enabled": "включён",
  "modernfix.option.mod_override": " модами [%s]",
  "modernfix.config.not_default": " (модифицировано)",
  "asynclocator.map.locating": "Карта (Ищем...)",
  "asynclocator.map.none": "Карта (Не было найдено ближайших структур)",
  "modernfix.option.category.performance": "Производительность",
  "modernfix.option.category.performance.description": "Фичи, которые улучшают производительность игры/запуска",
  "modernfix.option.category.bugfixes": "Багфиксы",
  "modernfix.option.category.bugfixes.description": "Багфиксы для улучшения стабильности игры",
  "modernfix.option.category.troubleshooting": "Поиск ошибок/утилиты",
  "modernfix.option.category.troubleshooting.description": "Фичи, необходимые для диагностирования проблем",
  "modernfix.option.category.expert_only": "Только для экспертов",
  "modernfix.option.category.expert_only.description": "Ничего не меняйте, если не знаете, что это!",
  "modernfix.option.name.mixin.perf.async_jei": "Фоновая загрузка JEI",
  "modernfix.option.mixin.perf.async_jei": "Только 1.16. **Ключевая оптимизация.** Патчит JEI для его загрузки в другом потоке, полностью искореняет долгую загрузку мира, вызываемую модом.",
  "modernfix.option.mixin.perf.async_locator": "Только 1.16. Прямой бекпорт патчей мода Async Locator для искоренения фризов сервера, вызванных командой `/locate`, генерацией лут тейблов и т.д.",
  "modernfix.option.mixin.perf.biome_zoomer": "Только 1.16. Небольшая оптимизация для исправления производительности поиска биомов, благодаря логике взятой с 1.18.",
  "modernfix.option.mixin.perf.blast_search_trees": "Все версии. Если REI или JEI установлены, то ванильная ситема поиска заменяется на систему одного из этих модов. Это ускоряет загрузку мира и незначительно уменьшает потребление ОЗУ.",
  "modernfix.option.mixin.perf.boost_worker_count": "Только 1.16. Удаляет жёсткое ограничение на количество рабочих потоков, как сделали Mojang'и  1.18.",
  "modernfix.option.mixin.perf.cache_blockstate_cache_arrays": "Все версии. Избегает создания новых копий массивов enum'ов при каждой инициализации кэша блокстейтов. Небольшая оптимизация, но легко реализуемая.",
  "modernfix.option.mixin.perf.cache_model_materials": "Все версии. Кэширует коллекцию `RenderMaterial` (текстур) и список зависимостей, которые возвращают модели, вместо их пересчёта при каждом запросе. Помогает ускорить процесс загрузки/запекания модели.",
  "modernfix.option.mixin.perf.cache_strongholds": "Все версии. Сохраняет сгенерированный список позиций крепостей вместе с миром, вместо их регенерации при каждой загрузке мира. Экономит немного времени в 1.16 и значительно больше в 1.18 и 1.19.",
  "modernfix.option.mixin.perf.cache_upgraded_structures": "Все версии. Многие моды хранят устаревшие файлы структур, что вынуждает игру их обновленять используя DFU при каждой загрузке. Это может быть довольно затратно. Этот патч добавляет логику сохранения обновлённой версии структуры и повторного использования её при следующей загрузке. Чтобы обработать случай, когда мод изменяет файл структуры, но не его имя, оригинальный хеш файла сравнивается с кешированной версией, и если они не совпадают, структура будет обновлена снова.",
  "modernfix.option.mixin.perf.compress_biome_container": "Только 1.16. Небольшая оптимизация, взятая из Hydrogen, которая пытается экономить место в контейнере биомов когда это возможно. Автоматически отключается при установке конфликтующих модов, таких как BetterEnd или Chocolate.",
  "modernfix.option.mixin.perf.datapack_reload_exceptions": "Все версии. Снижает спам логами и, возможно, немного ускоряет загрузку, не выводя стектрейсы для некоторых исключений во время перезагрузки датапака (например, отсутствие предметов в лут-таблицах/рецептах). Сообщение всё равно выводится.",
  "modernfix.option.mixin.perf.dedicated_reload_executor": "Все версии. Перемещает перезагрузку ресурспаков и датапаков в выделенный пул рабочих потоков вместо использования стандартных потоков `Worker-Main`. Это позволяет моду SmoothBoot потенциально улучшить производительность в одиночной игре во время выполнения, не замедляя запуск из-за ограниченного количества потоков.",
  "modernfix.option.mixin.perf.deduplicate_location": "Все версии, но по умолчанию отключено из-за влияния на время загрузки. Убирает дубликаты пространств имен и путей ресурсных местоположений. Это экономит ОЗУ, но также увеличивает стоимость создания нового `ResourceLocation`.",
  "modernfix.option.mixin.perf.dynamic_dfu": "Все версии. Модифицирует инициализацию DFU, чтобы она происходила в первый раз, когда что-то нужно обновить. Это похоже на LazyDFU, но реализовано иначе, поскольку оно избегает загрузки *любых* классов/структур данных DFU, в то время как LazyDFU только отключает оптимизацию правил. В основном, это более безопасная версия DataFixerSlayer, поскольку она всё равно загружает DFU при необходимости.\n\nОбычно вы можете продолжать использовать LazyDFU даже с этой включённой опцией, так как в противном случае оптимизация правил DFU вызовет лаги.",
  "modernfix.option.mixin.perf.dynamic_resources": "Все версии. См. https://github.com/embeddedt/ModernFix/wiki/Dynamic-Resources-FAQ.",
  "modernfix.option.mixin.perf.dynamic_sounds": "Все версии. Позволяет игре выгружать звуки вместо хранения их после загрузки.",
  "modernfix.option.mixin.perf.dynamic_structure_manager": "Все версии. Позволяет игре выгружать файлы структур после завершения их генерации, вместо их постоянной загрузки.",
  "modernfix.option.mixin.perf.fast_registry_validation": "Все версии. Forge бессмысленно ищет метод с использованием рефлексии каждый раз, когда реестр проверяется. Этот патч просто кеширует возвращенное значение, поскольку оно будет одинаковым каждый раз.",
  "modernfix.option.mixin.perf.faster_font_loading": "Все версии. Оптимизирует загрузку шрифтов для быстрой перезагрузки ресурсов.",
  "modernfix.option.mixin.perf.faster_item_rendering": "Все версии. Избегает отображения боков предметов в GUI. (Да, ванила так делает.)\n\nЭто может утроить FPS с модом вроде REI/JEI на слабых GPU, если отображается много предметов. Отключено по умолчанию, так как опция новая и плохо протестирована, но должна быть безопасной. Самая вероятная проблема - предметы полностью невидимы в GUI или выглядят плоскими в мире.",
  "modernfix.option.mixin.perf.faster_texture_loading": "Все версии до 1.19.4. Избегает чтения текстур дважды и вместо этого выполняет одну более быструю загрузку (аналогичную 1.19.3+).",
  "modernfix.option.mixin.perf.faster_texture_stitching": "Все версии. Включает использование игрой более быстрой системы запекания текстур, изначально написанной SuperCoder79 для lwjgl3ify на 1.7.10, что может сэкономить некоторое время при загрузке. Иногда сообщалось о том, что это вызывает странные артефакты на блоках или в GUI, это может быть багом Sodium.",
  "modernfix.option.mixin.perf.jeresources_startup": "Только 1.16. Оптимизирует Just Enough Resources, чтобы избежать бесполезного множественного создания объекта жителя для одной и той же профессии, что экономит время при запуске JEI.",
  "modernfix.option.mixin.perf.kubejs": "Только 1.16. Оптимизации KubeJS для избегания бесполезного копирования `ItemStack`, и т. д., что сокращает время загрузки датапаков.",
  "modernfix.option.mixin.perf.model_optimizations": "Все версии. Внедряет оптимизации для ускорения процесса загрузки модели.",
  "modernfix.option.mixin.perf.nbt_memory_usage": "Все версии. Использует более эффективную коллекцию для тегов NBT, которая устраняет дубликаты имён ключей, а также использует массивное отображение для очень маленьких составных меток. Это уменьшает издержки на хранение многих тегов в памяти.",
  "modernfix.option.mixin.perf.nuke_empty_chunk_sections": "Только 1.16, вдохновлено Hydrogen. Избегает хранения в памяти секций чанков, заполненных воздухом, вместо того чтобы помечать их как пустые.",
  "modernfix.option.mixin.perf.reduce_blockstate_cache_rebuilds": "Все версии. **Ключевая оптимизация.** Новые версии Minecraft (после 1.12) реализовали систему кэширования блокстейтов, которая кэширует часто используемую информацию о данном стейте, такую как его твердость, коллизию и т. д. Перестройка этого кэша довольно быстра в ванильном варианте (занимает всего несколько секунд), но довольно медленна с множеством модов, так как в игре появляется много различных блокстейтов, и все они должны быть перестроены. Проблема усугубляется Forge, так как кэш перестраивается в больших местах, когда обновлённые данные почти наверняка не будут использоваться до следующего перестроения. Примеры включают в себя прямо перед достижением главного меню (во время этапа «Freezing data»), а также несколько (!) раз при загрузке мира.\n\nModernFix решает этот боттлнек в производительности, делая перестройку кэша ленивой. Каждый блокстейт перестраивает свой кэш в первый раз, когда данные будут доступны. В любой момент, когда ванильный или Forge попытаются перестроить кэши для всех блокстейтов, это перенаправляется на простую инвалидацию кэша на каждом состоянии блока вместо этого.\n\nЭто не должно оказывать влияния на TPS после завершения запуска.",
  "modernfix.option.mixin.perf.remove_biome_temperature_cache": "Все версии. Удаляет кэш температуры биомов, как делает Lithium в современных версиях.",
  "modernfix.option.mixin.perf.resourcepacks": "Все версии . **Ключевая оптимизация.** Запуск современных версий сильно нагружен доступом к файлам. Множество запросов часто вызываются по отношению к ресурспакам для хранения ресурсов или проверки существования данного ресурса, и каждый данный вызов является очень медленным из-за текущей системы файлов.\n\nModernFix полностью искореняет данный боттлнек путём простого кеширования всех ресурсов, существующих в предоставленных модами и ваниллой ресурспаках. Кеш перестраивается при перезагрузке ресурсов (кроме ванильных ресурсов, поскольку они никогда не должны перезагружаться в работающей игре).\n\nНе было найдено несовместимостей с этим патчей кроме OptiFine (его CTM ресурсы некорректно загружаюются). Однако я не рекомендую использовать OptiFine в любом случае, поскольку он добавляет несколько минут к времени загрузки игры сам по себе и не тестируеются с ModernFix'ом вообще.",
  "modernfix.option.mixin.perf.reuse_datapacks": "Только 1.16. Пытается ускорить переход между синглплеерными мирами путём пропуска перезагрузки датапаков, когда это возможно. Может вызывать проблемы с совместимостью с некоторыми модами, однако сейчас включено по умолчанию.",
  "modernfix.option.mixin.perf.rewrite_registry": "Все версии. **На сейчас полу-рабочее.** Агрессивно заменяет некоторые компоненты регистра форджа более быстрым аналогом, однако оно на данный момент вызывает фризы при загрузке некоторых модпаков. Выключено по умолчанию по очевидным причинам.",
  "modernfix.option.mixin.perf.skip_first_datapack_reload": "Только 1.16 & 1.19. **Ключевая оптимизация.**\n\nВ середине цикла разработки на 1.16, Forge пропатчил игру, вынуждая её перезагружать дважды датапаки, при загрузке существующего мира, в надежде исправить сдвиг айди биомов. К сожалению, перезагрузка датапаков часто доходит вплоть до 30 секунд ожидания, что значительно замедляет загрузку мира.\n\nModernFix выполняет необходимые изменения для избежания этой перезагрузки, базированные на незаконченом форджевском PR #8163.\n\nЭто изменения было удалено форджами в 1.18, однако похожий патч был добавлен *опять* в 1.19 для исправления незагружающихся датапаков модов при создании синглплеерных миров. К счастью, ошибка была локализована к меню создания мира на 1.19, и существующие миры требуют только одну перезагрузку. Однако, это всё ещё удваивает продолжительность лагов при нажатии \"Создать новый мир\" на 1.19, и так ModernFix опять делает исправления, чтобы не вызывать перезагрузку дважды.",
  "modernfix.option.mixin.perf.state_definition_construct": "Все версии. Включен только если FerriteCore установлен. Использует возможности FerriteCore'овской обработки стейтов для ускорения их создания. Помогает ускорить время загрузки клиента с модами, со множеством блокстейтов, например модами на мебель.",
  "modernfix.option.mixin.perf.sync_executor_sleep": "Все версии. Избегает бездействия основного потока ЦП, у которого один поток находится в ожидании завершения загрузки модов.",
  "modernfix.option.mixin.perf.thread_priorities": "Все версии. Выставляет приоритет рабочим потокам сервера ниже клиентских. Улучшает стабильность FPS на пк с несколькими ядрами на ЦП, при условии, что используемая версия Java поддерживает приоритеты.",
  "modernfix.option.mixin.perf.use_integrated_resources": "В основном для 1.16. Патчит JEResources для использования информации о лут-тейблах с интегрированного сервера если играем в синглплеере, вместо бесполезной перезагрузки лут-тейблов. Сохраняет пару секунд при загрузке JEI.",
  "modernfix.option.mixin.bugfix.concurrency": "Исправляет различные ошибки связанные с параллельностью в Minecraft и/или Forge. Большинство из них приводят к редким, трудно диагностируемым крашам во время загрузки.",
  "modernfix.option.mixin.bugfix.edge_chunk_not_saved": "Эта опция является портом мода SuperCoder's Chunk Saving Fix (потому что я не знал, что в то время он уже был доступен на Forge).",
  "modernfix.option.mixin.bugfix.mc218112": "Эта опция исправляет дедлок, возникающий если возникают ошибки при обработке информации об энтити. Ванилла некорректно разблокирует информацию об энтити, когда должна. Ошибка показана в MC-218112 на баг-трекере, и была пофикшена Mojang'ами в 1.17.",
  "modernfix.option.mixin.bugfix.packet_leak": "**Экспериментально**, не включено по умолчания. Попытка исправить утечки ОЗУ, возникающие на 1.16 во время длительной игры 1.16.",
  "modernfix.option.mixin.bugfix.paper_chunk_patches": "1.18 и новее. **Ключевая оптимизация.** Портирует патч из Paper который исправляет с 1.17 проблему необходимости большого количества ОЗУ и создания множества объектов `CompletableFuture`. 1.18+ теперь может загружать миры с 400MB ОЗУ, как это делалось на 1.16.",
  "modernfix.option.mixin.bugfix.tf_cme_on_load": "Исправляет непотокобезопасную загрузку Twilight Forest'а, используя главный поток, а не поток FML",
  "modernfix.option.mixin.feature.branding": "Добавляет упоминание ModernFix'а в главное меню, а так же в F3.",
  "modernfix.option.mixin.feature.direct_stack_trace": "Обычно выключено, может быть включено, чтобы принудительно записывать необработанный стектрейс при краше. Иногда ванильная система крашев не работает должным образом и выдает совершенно нерелевантный стектрейс/репорт.",
  "modernfix.option.mixin.feature.measure_time": "Использует пару инжектов для определения времени загрузки мира/датапака/перезагрузки ресурсов/загрузки клиента, и добавляет необходимые хуки для включения ванильной логики неиспользуемого профайлера, если он был настроен.",
  "modernfix.option.mixin.feature.spam_thread_dump": "**Используется только для дебага.** Заставляет выводиться дамп потока в лог каждые 60 секунд. Это поможет диагностировать необъяснимые фризы при игре/загрузке.",
  "modernfix.option.mixin.bugfix.chunk_deadlock": "Попытки исправить дедлоки в системе чанков, или предоставить дополнительную информацию в лог, когда они возникают. Эти дедлоки обычно проявляются когда сервер зависает на неопределённый срок (например энтити не двигаются), в то время как клиент работает нормально.",
  "modernfix.option.mixin.bugfix.chunk_deadlock.valhesia": "Патчит Valhesia Structures для исправления дедлока при загрузке мира/чанков.",
  "modernfix.option.mixin.bugfix.cofh_core_crash": "Исправляет проблемы с многопоточностью в CoFH Core которые могли вызывать редкие краши при запуске игры.",
  "modernfix.option.mixin.bugfix.ctm_resourceutil_cme": "Исправляет проблемы с многопоточностью в ConnectedTexturesMod которые могли вызывать редкие краши при запуске игры.",
  "modernfix.option.mixin.bugfix.ender_dragon_leak": "Исправляет утечку памяти в ванилле, вызываемой эндер-драконом, обращающимся к старому объекту мира клиента.",
  "modernfix.option.mixin.bugfix.entity_load_deadlock": "Исправляет много ошибок в EntityJoinWorldEvent/EntityJoinLevelEvent вызывающих дедлок при генерации мира, немного отложив загрузку энтити. Не должно вызывать каких-либо заметных изменений в поведении игры.",
  "modernfix.option.mixin.bugfix.fix_config_crashes": "Исправляет случайные ошибки с форджевскими конфигами.",
  "modernfix.option.mixin.bugfix.item_cache_flag": "Исправляет MC-258939",
  "modernfix.option.mixin.bugfix.preserve_early_window_pos": "Заставляет окно игры сохранять его размер, когда окно переходит из окна раннего загрузки Forge в окно Minecraft. Исправляет проблемы, когда окно возвращалось обратно в центр экрана после перетаскивания и т.д.",
  "modernfix.option.mixin.bugfix.refinedstorage.te_bug": "Исправлены блоки внешнего хранилища из Refined Storage которые иногда не отображали содержимое of ящиков и т.д. при их загрузке. Прямой бекпорт PR'а Refined Storage #3435, который был применён на 1.18 и выше.",
  "modernfix.option.mixin.bugfix.remove_block_chunkloading": "Исправляет ошибку, когда зомби-пиглин постоянно держит чанк 0, 0 загруженным на Forge. Бекпорт форджевского PR #8583.",
  "modernfix.option.mixin.bugfix.starlight_emptiness": "Исправляет случайный Starlight краш из-за не инициализированных пустых коллекций. Прямой бекпорт такого же фикса в Starlight для 1.18.x.",
  "modernfix.option.mixin.core": "Необходимые для работы ModernFix патчи",
  "modernfix.option.mixin.devenv": "Патчи, применяемые в среде разработки, для оптимизации и/или дебага",
  "modernfix.option.mixin.safety": "Исправляет краши при загрузке, связанные с потокобезопасностью",
  "modernfix.option.mixin.feature.integrated_server_watchdog": "Добавляет ванильный вотчдог и в синглплеерные миры, но просто выводит стектрейс, а не принудительно уничтожает мир. Эта версия включает в себя функционал Fullstack Watchdog'а, но последний по-прежнему необходим для мультиплеера.",
  "modernfix.option.mixin.feature.snapshot_easter_egg": "Добавляет пасхалки(не влияют на поведение игры/внешний вид), если запущено на снапшотах.",
  "modernfix.option.mixin.feature.spark_profile_launch": "Если включено, и установлена совместимая версия Spark'а, вся загрузка вплоть до главного меню будет запрофайлена.",
  "modernfix.option.mixin.feature.warn_missing_perf_mods": "Показывает предупреждение при запуске, если не установлены другие оптимизирующие моды, которые мы сочли полезными/совместимыми",
  "modernfix.option.mixin.launch.class_search_cache": "Заменяет поисковик ресурсов Forge'а (используется для поиска кода игры и модов) значительно более быстрым аналогом, ускоряет запуск игры",
  "modernfix.option.mixin.perf.clear_fabric_mapping_tables": "Уменьшает потребление ОЗУ путём очистки структуры маппингов в Fabric Loader которые являются лишними, либо не используются модами. Выключено по умолчанию по соображениям совместимости.",
  "modernfix.option.mixin.perf.clear_mixin_classinfo": "Принудительно загружает все миксины после загрузки, после чего удаляет лишнюю о них информацию. Выключено по умолчанию по соображениям совместимости.",
  "modernfix.option.mixin.perf.deduplicate_wall_shapes": "Заставляет большинство блоков-стен делить одинаковый объект их формы вместо создания копии каждому лично. Может существенно снизить потребление ОЗУ, когда в модах множество блоков-стен.",
  "modernfix.option.mixin.perf.dynamic_resources.ae2": "Патч для AE2 для совместимости с динамическими ресурсами",
  "modernfix.option.mixin.perf.dynamic_resources.ctm": "Патч для CTM для совместимости с динамическими ресурсами",
  "modernfix.option.mixin.perf.dynamic_resources.rs": "Патч для Refined Storage для совместимости с динамическими ресурсами",
  "modernfix.option.mixin.perf.dynamic_resources.supermartijncore": "Патч для SuperMartijn642CoreLib для совместимости с динамическими ресурсами",
  "modernfix.option.mixin.perf.dynamic_resources.diagonalfences": "Патч для Diagonal Fences для совместимости с динамическими ресурсами",
  "modernfix.option.mixin.perf.faster_advancements": "Ускоряет логику выполнения достижений и избегает ошибки StackOverflowError в больших паках. Порт Advancements Debug с Fabric'а.",
  "modernfix.option.mixin.perf.patchouli_deduplicate_books": "Фикс книг из Patchouli, которые хранят множество пустых предметов с NBT. Снижает потребление ОЗУ.",
  "modernfix.option.mixin.perf.remove_spawn_chunks": "Полностью удаляет чанки спавна из игры. Они отныне больше не загружаются, в отличии от того, что делает Ksyxis.",
  "modernfix.option.mixin.perf.use_integrated_resources.jepb": "",
  "modernfix.option.mixin.perf.use_integrated_resources.jeresources": "",
  "modernfix.option.mixin.bugfix.blueprint_modif_memory_leak": "Исправляет утечку ванильных ресурсов из-за ObjectModificationManager Blueprint'а, уменьшает потребление ОЗУ. Несмотря на то, что исправление было внесено в PR #195 релиз ещё не сделан.",
  "modernfix.option.mixin.bugfix.removed_dimensions": "Исправляет то, что игра не может загрузить миры с удалёнными измерениями. Бекпорт форджевского PR #8959.",
  "modernfix.option.mixin.perf.compact_bit_storage": "Исправляет засорение ОЗУ на некоторых старых серверах (например Hypixel) отправляющих пустые чанки как имеющие блоки. Значительно уменьшает потребление ОЗУ на таких серверах.",
  "modernfix.option.mixin.perf.deduplicate_climate_parameters": "Дедупликация объектов параметров климата, используемых новой системой биомов, может сохранить ~2MB, но также немного замедляет перезагрузку датапаков.",
  "modernfix.option.mixin.perf.dynamic_entity_renderers": "Собирает модели энтити при первом их вызове при запуске. Может быть несовместимо с некоторыми моделями, от чего будут вызываться краши связанные с рендером данного энтити",
  "modernfix.option.mixin.perf.twilightforest.structure_spawn_fix": "Исправляет лаги вызываемые проверкой структур при загрузке мира Twilight Forest'а, что было очень неэффективно",
  "modernfix.option.mixin.perf.fast_forge_dummies": "Ускоряет заморозку регистра Forge во время запуска используя более оптимизированный код",
  "modernfix.option.mixin.perf.tag_id_caching": "Ускоряет использование элементов тега путём кеширования объекта локации, вместо его пересоздания каждый раз",
  "modernfix.option.mixin.feature.disable_unihex_font": "Удаляет шрифт юникода, сохраняет 10MB, но специальные символы больше не будут рендериться",
  "modernfix.option.mixin.bugfix.world_leaks": "Уменьшает потребление ОЗУ старыми мирами клиента, более не являющимися необходимыми при смене измерения. Обычно сборщик мусора в ванилле со всем разбирается сам, но моды иногда могут вызывать их самостоятельно",
  "modernfix.option.mixin.perf.compact_mojang_registries": "(Fabric) Экспериментальная опция, которая, грубо говоря, уменьшает потребление ОЗУ на 50%. Бесполезно для модпаков, только если они не имеют миллион блоков/предметов.",
  "modernfix.option.mixin.perf.dynamic_block_codecs": "Избегает хранения кодека каждому блоку(стейту) и вместо этого генерирует и кеширует их только когда необходимо. В целом не стоит включения если у вас не миллион блоков/предметов.",
  "modernfix.option.mixin.perf.faster_command_suggestions": "Исправляет лаги, при огромном количестве предложенных команд при печатании текста",
  "modernfix.option.mixin.perf.mojang_registry_size": "Устранена проблема, из-за которой регистрация блоков/предметов замедлялась пропорционально их зарегистрированному количеству. Сокращает время запуска."
}
