{
  "key.modernfix": "ModernFix",
  "key.modernfix.config": "Mở màn hình cấu hình",
  "modernfix.jei_load": "Đang tải JEI, quá trình này có thể mất một chút thời gian",
  "modernfix.no_lazydfu": "LazyDFU chưa được cài đặt. Nếu Minecraft cần cập nhật dữ liệu trò chơi từ phiên bản cũ hơn, thì có thể xảy ra hiện tượng giật lag đáng chú ý.",
  "modernfix.no_ferritecore": "FerriteCore chưa được cài đặt. Mức sử dụng bộ nhớ sẽ rất cao.",
  "modernfix.connectedness_dynresoruces": "Tùy chọn tài nguyên động của Connectedness và ModernFix không tương thích. Xóa Kết nối hoặc tắt tài nguyên động trong cấu hình ModernFix.",
  "modernfix.perf_mod_warning": "Bạn nên cài đặt các bản mod, nhưng (các) cảnh báo có thể bị tắt trong cấu hình ModernFix.",
  "modernfix.config": "Cấu hình mixin ModernFix",
  "modernfix.config.done_restart": "Xong (yêu cầu khởi động lại)",
  "modernfix.config.wiki": "Mở wiki",
  "modernfix.message.reload_config": "Đã phát hiện thay đổi tệp cấu hình mod. Để ngăn việc tải các tệp chưa được lưu xong, việc tải lại phải được kích hoạt bằng cách chạy /mfrc.",
  "modernfix.option.on": "bật",
  "modernfix.option.off": "tắt",
  "modernfix.option.disabled": "vô hiệu hoá",
  "modernfix.option.enabled": "bật",
  "modernfix.option.mod_override": " bởi các mod [%s]",
  "modernfix.config.not_default": " (đã bị sửa đổi)",
  "asynclocator.map.locating": "Bản đồ (Định vị...)",
  "asynclocator.map.none": "Bản đồ (Không tìm thấy tính năng gần đó)",
  "modernfix.option.category.performance": "Hiệu năng",
  "modernfix.option.category.performance.description": "Các tính năng giúp cải thiện hiệu năng trò chơi/khởi chạy",
  "modernfix.option.category.bugfixes": "Sửa lỗi",
  "modernfix.option.category.bugfixes.description": "Các bản sửa lỗi cốt lõi để cải thiện tính ổn định của trò chơi",
  "modernfix.option.category.troubleshooting": "Khắc phục sự cố/Tiện ích",
  "modernfix.option.category.troubleshooting.description": "Các tính năng nhằm hỗ trợ chẩn đoán sự cố",
  "modernfix.option.category.expert_only": "Chỉ dành cho chuyên gia",
  "modernfix.option.category.expert_only.description": "Đừng thay đổi trừ khi bạn biết mình đang làm gì",
  "modernfix.option.name.mixin.perf.async_jei": "Tải JEI nền",
  "modernfix.option.mixin.perf.async_jei": "Chỉ 1.16 thôi. **Một tối ưu hóa quan trọng.** Các bản vá JEI để thực hiện tải lại của nó trên một chuỗi nền, loại bỏ hoàn toàn độ trễ lâu mà nó thêm vào tải thế giới.",
  "modernfix.option.mixin.perf.async_locator": "Chỉ 1.16 thôi. Backport các bản vá của mod Async Locator để loại bỏ tình trạng đóng băng máy chủ liên quan đến `/locate`, tạo loottable, v.v.",
  "modernfix.option.mixin.perf.biome_zoomer": "Chỉ 1.16 thôi. Tối ưu hóa nhỏ để cải thiện hiệu suất của bộ thu phóng quần xã sử dụng logic từ 1.18.",
  "modernfix.option.mixin.perf.blast_search_trees": "Tất cả các phiên bản. Nếu REI hoặc JEI được cài đặt, việc xây dựng cây tìm kiếm truyền thống cho tìm kiếm sáng tạo sẽ bị vô hiệu hóa và thay vào đó, việc tìm kiếm được thực hiện bằng cách sử dụng triển khai tìm kiếm của các mod này. Điều này giúp tiết kiệm vài giây trong quá trình tải thế giới và có thể cũng tiết kiệm một số RAM (mặc dù tôi chưa đo được).",
  "modernfix.option.mixin.perf.boost_worker_count": "Chỉ 1.16 thôi. Loại bỏ giới hạn mã hóa cứng đối với số lượng luồng công nhân, tương tự như những gì Mojang đã làm trong 1.18.",
  "modernfix.option.mixin.perf.cache_blockstate_cache_arrays": "Tất cả các phiên bản. Tránh tạo các bản sao mới của mảng enum mỗi khi bộ nhớ đệm khối trạng thái được khởi tạo. Tối ưu hóa nhỏ nhưng dễ thực hiện.",
  "modernfix.option.mixin.perf.cache_model_materials": "Tất cả các phiên bản. Ghi nhớ bộ sưu tập `RenderMaterial` (kết cấu) và danh sách phần phụ thuộc mà các mô hình trả về thay vì yêu cầu chúng phải tính toán lại theo từng yêu cầu. Giúp đẩy nhanh quá trình tải/nướng mô hình.",
  "modernfix.option.mixin.perf.cache_strongholds": "Tất cả các phiên bản. Lưu danh sách các vị trí pháo đài  đã tạo cùng với thế giới, thay vì tạo lại nó sau mỗi lần tải thế giới. Tiết kiệm một chút thời gian với 1.16 và nhiều hơn một chút với 1.18 và 1.19.",
  "modernfix.option.mixin.perf.cache_upgraded_structures": "Tất cả các phiên bản. Nhiều mod cung cấp các tệp cấu trúc lỗi thời, yêu cầu trò chơi phải nâng cấp chúng bằng DFU mỗi khi chúng được tải. Điều này có thể khá chậm. Bản vá này bổ sung logic để lưu phiên bản nâng cấp của cấu trúc và sử dụng lại nó trong lần tải tiếp theo. Để xử lý trường hợp mod thay đổi cấu trúc tệp nhưng không thay đổi tên, hàm băm của tệp gốc sẽ được so sánh với phiên bản đã lưu trong bộ nhớ cache và nếu chúng không khớp với cấu trúc sẽ được nâng cấp lại.",
  "modernfix.option.mixin.perf.compress_biome_container": "Chỉ 1.16 thôi. Tối ưu hóa nhỏ mượn từ Hydrogen, cố gắng tiết kiệm không gian trong thùng chứa quần xã khi có thể. Điều này sẽ tự động bị tắt nếu các mod xung đột như BetterEnd hoặc Chocolate được cài đặt.",
  "modernfix.option.mixin.perf.datapack_reload_exceptions": "Tất cả các phiên bản. Giảm spam nhật ký và có thể cải thiện một chút tốc độ tải bằng cách không in stacktrace đối với một số trường hợp ngoại lệ thường gặp trong quá trình tải lại gói dữ liệu (ví dụ: thiếu vật phẩm trong bảng lợi phẩm/công thức nấu ăn). Tin nhắn vẫn được in.",
  "modernfix.option.mixin.perf.dedicated_reload_executor": "Tất cả các phiên bản. Di chuyển tải lại gói tài nguyên và gói dữ liệu sang nhóm công nhân chuyên dụng thay vì sử dụng các luồng `Worker-Main` mặc định. Điều này cho phép các mod Khởi động mượt mà vẫn có khả năng cải thiện hiệu suất chơi đơn trong thời gian chạy trong khi không làm chậm quá trình khởi chạy do số lượng luồng hạn chế.",
  "modernfix.option.mixin.perf.deduplicate_location": "Tất cả các phiên bản, nhưng bị tắt theo mặc định do ảnh hưởng đến thời gian tải. Loại bỏ trùng lặp các không gian tên và đường dẫn vị trí tài nguyên. Điều này giúp tiết kiệm RAM nhưng cũng làm tăng chi phí xây dựng `ResourceLocation` mới lên khá nhiều.",
  "modernfix.option.mixin.perf.dynamic_dfu": "Tất cả các phiên bản. Sửa đổi quá trình khởi tạo DFU để xảy ra lần đầu tiên cần nâng cấp thứ gì đó. Điều này nghe có vẻ tương tự như LazyDFU nhưng được triển khai rõ ràng vì nó tránh tải *bất kỳ* cấu trúc dữ liệu/lớp DFU nào, trong khi LazyDFU chỉ vô hiệu hóa tối ưu hóa quy tắc. Về cơ bản, tùy chọn này là phiên bản an toàn hơn của DataFixerSlayer vì nó vẫn sẽ tải DFU khi cần.\n\nBạn thường nên tiếp tục sử dụng LazyDFU ngay cả khi đã bật tùy chọn này, nếu không thì tối ưu hóa quy tắc DFU sẽ gây ra độ trễ.",
  "modernfix.option.mixin.perf.dynamic_resources": "Tất cả các phiên bản. Xem https://github.com/embeddedt/ModernFix/wiki/Dynamic-Resources-FAQ.",
  "modernfix.option.mixin.perf.dynamic_structure_manager": "Tất cả các phiên bản. Cho phép trò chơi hủy tải các tệp cấu trúc sau khi quá trình tạo kết thúc thay vì giữ cho chúng được tải mãi mãi.",
  "modernfix.option.mixin.perf.fast_registry_validation": "Tất cả các phiên bản. Forge không cần phải tra cứu một phương thức thông qua phản chiếu mỗi khi sổ đăng ký được xác thực. Bản vá này chỉ lưu trữ giá trị được trả về vì nó sẽ giống nhau mọi lúc.",
  "modernfix.option.mixin.perf.faster_font_loading": "Tất cả các phiên bản. Tối ưu hóa trình kết xuất phông chữ để tải phông chữ nhanh hơn, tăng tốc độ tải lại tài nguyên.",
  "modernfix.option.mixin.perf.faster_item_rendering": "Tất cả các phiên bản. Tránh hiển thị các cạnh của các vật phẩm trong GUI. (Có, vanilla dường như làm được điều đó.)\n\nĐiều này có thể tăng gấp ba FPS với một mod như REI/JEI được cài đặt trên GPU yếu hơn, nếu có đủ vật phẩm. Bị tắt theo mặc định vì nó mới và chưa được thử nghiệm nhiều nhưng phải an toàn. Vấn đề rất có thể xảy ra là các vật phẩm hoàn toàn không hiển thị được trong GUI hoặc xuất hiện phẳng trên thế giới.",
  "modernfix.option.mixin.perf.faster_texture_loading": "Tất cả các phiên bản trước 1.19.4. Avoids reading textures twice (the first time using a very slow code path) and instead does one faster load (similar to 1.19.3+).",
  "modernfix.option.mixin.perf.faster_texture_stitching": "Tất cả các phiên bản. Enables the game to use a faster texture stitching system originally written by SuperCoder79 for lwjgl3ify on 1.7.10, which can save some time during loading. Rarely, it's been reported to cause weird artifacts on blocks or in GUIs, this may be a Sodium bug.",
  "modernfix.option.mixin.perf.jeresources_startup": "Chỉ 1.16 thôi. Optimizes Just Enough Resources to not needlessly recreate villager entities many times for the same profession, which saves time during JEI startup.",
  "modernfix.option.mixin.perf.kubejs": "Chỉ 1.16 thôi. Optimizations to KubeJS to avoid needless `ItemStack` copying, etc., which reduces the time taken to load datapacks.",
  "modernfix.option.mixin.perf.model_optimizations": "Tất cả các phiên bản. Implements optimizations to speed up the model loading process.",
  "modernfix.option.mixin.perf.nbt_memory_usage": "Tất cả các phiên bản. Uses a more efficient backing map for compound NBT tags that deduplicates key names and also uses an array map for very small compounds. This reduces the overhead of storing many compound tags in memory.",
  "modernfix.option.mixin.perf.nuke_empty_chunk_sections": "Chỉ 1.16 thôi, inspired by Hydrogen. Avoids storing chunk sections that are full of air in memory, instead marking them as empty.",
  "modernfix.option.mixin.perf.reduce_blockstate_cache_rebuilds": "Tất cả các phiên bản. **A key optimization.** Newer Minecraft versions (after 1.12) implemented a blockstate cache system that caches frequently used information about a blockstate, such as whether it is solid, its collision shape, etc. Rebuilding this cache is quite fast in vanilla (it takes only a second or two) but is quite slow with many mods installed, as there are many more blockstates present in the game which all must have their caches rebuilt.\n\nThis problem is exacerbated by Forge as the cache is rebuilt at many points when the data would almost certainly be unused before the next rebuild. Examples include right before reaching the main menu (during the \"Freezing data\" stage), as well as multiple (!) times when a world is being loaded.\n\nModernFix solves this performance bottleneck by instead making cache rebuilds lazy. Each blockstate rebuilds its cache the first time the data would be accessed. At any point when vanilla or Forge would attempt to rebuild caches for all blockstates, this is redirected to simply invalidate the cache on each blockstate instead.\n\nThis should not have any impact on TPS after startup concludes.",
  "modernfix.option.mixin.perf.remove_biome_temperature_cache": "Tất cả các phiên bản. Removes the biome temperature cache as Lithium does on modern versions.",
  "modernfix.option.mixin.perf.resourcepacks": "Tất cả các phiên bản. **A key optimization.** Launches on modern versions are heavily bottlenecked by filesystem access. Many requests are frequently made to resource packs to list resources or check if a given resource exists, and each of these result in a very slow file API call.\n\nModernFix completely eliminates most of the bottleneck here by simply caching a listing of all resources that exist within mod-provided and vanilla resourcepacks. The cache is rebuilt on resource reload (except for the vanilla resources, since they should never change while the game is running).\n\nThere are no known compatibility issues with this patch except for OptiFine (its CTM resources do not load correctly). However I do not recommend using OptiFine in any scenario, as it adds several minutes to launch time by itself and is not tested with ModernFix at all.",
  "modernfix.option.mixin.perf.reuse_datapacks": "Chỉ 1.16 thôi. Attempts to speed up switching between singleplayer worlds by skipping the datapack reload when possible. May cause compatibility issues with some mods, but is currently enabled by default.",
  "modernfix.option.mixin.perf.rewrite_registry": "Tất cả các phiên bản. **Currently semi-broken.** Aggressively replaces some internals of the Forge registry system with faster versions, however it currently causes freezes when loading some modpacks. Off by default for obvious reasons.",
  "modernfix.option.mixin.perf.skip_first_datapack_reload": "1.16 & 1.19 only. **A key optimization.**\n\nIn the middle of the 1.16 development cycle, Forge patched the game to reload datapacks twice when loading an existing world, in order to fix an issue with biome ID shifting. Unfortunately, datapack reloads often take upwards of 30 seconds and so this very severely affects world loading times.\n\nModernFix makes the necessary changes to avoid this reload, based on the unfinished Forge PR #8163.\n\nThis change was removed by Forge in 1.18, but then a similar patch was added *again* in 1.19 to fix mod datapacks not being loaded when creating new singleplayer worlds. Fortunately, the issue is localized to the world creation screen in 1.19, and existing worlds only require a single reload. However, this still doubles the length of the lag spike when clicking \"Create New World\" in 1.19, and so ModernFix again makes changes to not perform a redundant reload.",
  "modernfix.option.mixin.perf.state_definition_construct": "Tất cả các phiên bản. Enabled only if FerriteCore is installed. Takes advantage of FerriteCore's handling of blockstates to speed up their creation. This can help speed up launch with mods that add lots of blockstates, such as furniture mods.",
  "modernfix.option.mixin.perf.sync_executor_sleep": "Tất cả các phiên bản. Avoids having the main thread spin idly consuming one CPU core while waiting for the modloading workers to finish.",
  "modernfix.option.mixin.perf.thread_priorities": "Tất cả các phiên bản. Adjusts the worker and server thread priorities to be lower than the client thread. This helps improve FPS stability on machines with few CPU cores, provided that the Java implementation in use respects priorities.",
  "modernfix.option.mixin.perf.use_integrated_resources": "Mostly for 1.16. Patches JEResources to use the integrated server's loot table data if playing singleplayer, rather than pointlessly reloading loot tables. Saves a couple more seconds during JEI startup.",
  "modernfix.option.mixin.bugfix.concurrency": "The patches in this group fix concurrency-related issues within Minecraft and/or Forge. Most of them result in rare, hard-to-diagnose crashes during loading.",
  "modernfix.option.mixin.bugfix.edge_chunk_not_saved": "This option is a port of SuperCoder's Chunk Saving Fix mod (because I didn't realize it was already available for Forge at the time).",
  "modernfix.option.mixin.bugfix.mc218112": "This option fixes a deadlock that can occur if an exception is thrown while processing entity data. Vanilla does not correctly unlock the data manager when it should. This is tracked as MC-218112 on the bug tracker, and was fixed by Mojang in 1.17.",
  "modernfix.option.mixin.bugfix.packet_leak": "**Experimental**, not enabled by default. An attempted fix for the memory leak issue that occurs after playing long enough on 1.16.",
  "modernfix.option.mixin.bugfix.paper_chunk_patches": "1.18 and newer. **A key optimization.** Ports a patch from Paper that fixes issues on 1.17 with chunkloading requiring huge amounts of memory and generating many `CompletableFuture` instances. 1.18+ are now able to load worlds on only 400MB of memory like 1.16 could.",
  "modernfix.option.mixin.bugfix.tf_cme_on_load": "Patches Twilight Forest to perform non-thread-safe client setup using the main thread as it should, rather than the FML worker thread.",
  "modernfix.option.mixin.feature.branding": "Adds ModernFix to the branding list on the title screen, and also to the F3 screen.",
  "modernfix.option.mixin.feature.direct_stack_trace": "Normally off, can be enabled to force the raw stack trace to be dumped to the log when a crash occurs. Occasionally vanilla's crash report system fails to work properly and gives an entirely irrelevant stack trace/report.",
  "modernfix.option.mixin.feature.measure_time": "Uses a couple injections to measure world load time, datapack reload time, resource reload time, bootstrap time, and adds the necessary hooks to enable vanilla's unused profiler logic for resource reloading if so configured.",
  "modernfix.option.mixin.feature.spam_thread_dump": "**To be used for debugging purposes only.** Causes a thread dump to be output to the log every 60 seconds. This can help to diagnose unexplained freezes during loading/gameplay.",
  "modernfix.option.mixin.bugfix.chunk_deadlock": "Attempts to prevent chunk system deadlocks or provide additional debug information in the log when they occur. These deadlocks usually manifest as the server freezing indefinitely (e.g. entities not moving), while the client continues to work just fine.",
  "modernfix.option.mixin.bugfix.chunk_deadlock.valhesia": "Patches Valhesia Structures to fix an issue in its code that causes frequent worldgen/chunkloading deadlocks.",
  "modernfix.option.mixin.bugfix.cofh_core_crash": "Fixes a multithreading issue in CoFH Core that can cause rare crashes during launch.",
  "modernfix.option.mixin.bugfix.ctm_resourceutil_cme": "Fixes a multithreading issue in ConnectedTexturesMod that can cause rare crashes during launch.",
  "modernfix.option.mixin.bugfix.ender_dragon_leak": "Fixes a memory leak in vanilla caused by the ender dragon retaining a reference to the previous client world.",
  "modernfix.option.mixin.bugfix.entity_load_deadlock": "Fixes many issues where EntityJoinWorldEvent/EntityJoinLevelEvent cause a worldgen deadlock, by slightly deferring entity loading. Should not, however, cause any noticeable behavior changes in-game.",
  "modernfix.option.mixin.bugfix.fix_config_crashes": "Fixes Forge configs occasionally becoming corrupted when launching the game.",
  "modernfix.option.mixin.bugfix.item_cache_flag": "Fixes MC-258939",
  "modernfix.option.mixin.bugfix.preserve_early_window_pos": "Makes the game window retain its existing size when control is handed over from Forge's early loading to Minecraft code. Fixes the window teleporting back to the center of the screen after being dragged, etc.",
  "modernfix.option.mixin.bugfix.refinedstorage.te_bug": "Fixes Refined Storage external storage blocks occasionally failing to show contents of drawers, etc. when loaded. Backport of Refined Storage PR #3435, which was only applied to 1.18 and later.",
  "modernfix.option.mixin.bugfix.remove_block_chunkloading": "Fixes zombie pigmen keeping the 0, 0 chunk loaded perpetually on Forge. Backport of Forge PR #8583.",
  "modernfix.option.mixin.bugfix.starlight_emptiness": "Fixes an occasional Starlight crash due to emptiness maps not being initialized. Backport of the same fix in Starlight for 1.18.x.",
  "modernfix.option.mixin.core": "Core patches required for ModernFix to work",
  "modernfix.option.mixin.devenv": "Patches used when running in a development environment, for speed improvement and/or testing",
  "modernfix.option.mixin.safety": "Concurrency patches to prevent crashes during launch",
  "modernfix.option.mixin.feature.integrated_server_watchdog": "Adds the vanilla watchdog to singleplayer worlds as well, but just prints out the stacktraces rather than forcefully terminating the world. This version includes the functionality of Fullstack Watchdog, but the latter is still needed for multiplayer.",
  "modernfix.option.mixin.feature.snapshot_easter_egg": "Adds easter egg features (does not affect any vanilla visuals or behavior) when running on a snapshot version.",
  "modernfix.option.mixin.feature.spark_profile_launch": "If enabled, and a compatible version of Spark is installed, the entire launch sequence will be profiled until the main menu.",
  "modernfix.option.mixin.feature.warn_missing_perf_mods": "Shows a warning on startup if other performance mods considered essential and highly compatible are not present",
  "modernfix.option.mixin.launch.class_search_cache": "Replaces Forge's resource finder (used to find game and a mod code) with a significantly faster version, speeding up launch",
  "modernfix.option.mixin.perf.clear_fabric_mapping_tables": "Reduces memory usage by clearing mapping data structures in Fabric Loader that are either redundant or rarely used by mods. Off by default for compatibility reasons.",
  "modernfix.option.mixin.perf.clear_mixin_classinfo": "Force-loads all mixins when launch finishes and then clears out mixin data structures to remove most of Mixin's memory footprint. Disabled by default for compatibility reasons.",
  "modernfix.option.mixin.perf.deduplicate_wall_shapes": "Makes most wall blocks share the same shape object instead of each one having its own copy. Can reduce memory usage substantially when lots of wall blocks are added by mods.",
  "modernfix.option.mixin.perf.dynamic_resources.ae2": "AE2 compatibility patch for dynamic resources",
  "modernfix.option.mixin.perf.dynamic_resources.ctm": "CTM compatibility patch for dynamic resources",
  "modernfix.option.mixin.perf.dynamic_resources.rs": "Refined Storage compatibility patch for dynamic resources",
  "modernfix.option.mixin.perf.dynamic_resources.supermartijncore": "SuperMartijn642CoreLib compatibility patch for dynamic resources",
  "modernfix.option.mixin.perf.dynamic_resources.diagonalfences": "Diagonal Fences compatibility patch for dynamic resources",
  "modernfix.option.mixin.perf.faster_advancements": "Rewrites the advancement checking logic to be faster and not cause StackOverflowError in large packs. Port of Advancements Debug from Fabric.",
  "modernfix.option.mixin.perf.patchouli_deduplicate_books": "Fix Patchouli books storing many empty items with NBT tags, reducing memory usage.",
  "modernfix.option.mixin.perf.remove_spawn_chunks": "Completely removes spawn chunks from the game. They are no longer loaded at all, unlike Ksyxis.",
  "modernfix.option.mixin.perf.use_integrated_resources.jepb": "",
  "modernfix.option.mixin.perf.use_integrated_resources.jeresources": "",
  "modernfix.option.mixin.bugfix.blueprint_modif_memory_leak": "Fixes Blueprint's ObjectModificationManager leaking vanilla resources, reducing memory usage. Despite the fix being contributed in PR #195 a release was not yet made.",
  "modernfix.option.mixin.bugfix.removed_dimensions": "Fixes the game failing to load worlds if dimension mods are removed. Backport of Forge PR #8959.",
  "modernfix.option.mixin.perf.compact_bit_storage": "Fixes memory waste caused by some legacy servers (e.g. Hypixel) sending empty chunks as if they contain blocks. Reduces memory usage significantly on these servers.",
  "modernfix.option.mixin.perf.deduplicate_climate_parameters": "Deduplicates climate parameter objects used by the new biome system, can save ~2MB but also slows down datapack reload somewhat.",
  "modernfix.option.mixin.perf.dynamic_entity_renderers": "Constructs entity models the first time they are seen instead of during launch. Some mods are not compatible with this option and will cause EntityRenderer crashes.",
  "modernfix.option.mixin.perf.twilightforest.structure_spawn_fix": "Fixes lag caused by Twilight Forest worldgen checking structures very inefficiently",
  "modernfix.option.mixin.perf.fast_forge_dummies": "Speeds up Forge registry freezing during launch by using a faster code path",
  "modernfix.option.mixin.perf.tag_id_caching": "Speeds up uses of tag entries by caching the location object instead of recreating it every time",
  "modernfix.option.mixin.feature.disable_unihex_font": "Remove the Unicode font, saves 10MB but causes special characters to no longer render"
}
