{
  "key.modernfix": "ModernFix",
  "key.modernfix.config": "Mở màn hình cấu hình",
  "modernfix.jei_load": "Đang tải JEI, quá trình này có thể mất một chút thời gian",
  "modernfix.no_lazydfu": "LazyDFU chưa được cài đặt. Nếu Minecraft cần cập nhật dữ liệu trò chơi từ phiên bản cũ hơn, thì có thể xảy ra hiện tượng giật lag đáng chú ý.",
  "modernfix.no_ferritecore": "FerriteCore chưa được cài đặt. Mức sử dụng bộ nhớ sẽ rất cao.",
  "modernfix.connectedness_dynresoruces": "Tùy chọn tài nguyên động của Connectedness và ModernFix không tương thích. Xóa Kết nối hoặc tắt tài nguyên động trong cấu hình ModernFix.",
  "modernfix.perf_mod_warning": "Bạn nên cài đặt các bản mod, nhưng (các) cảnh báo có thể bị tắt trong cấu hình ModernFix.",
  "modernfix.config": "Cấu hình mixin ModernFix",
  "modernfix.config.done_restart": "Xong (yêu cầu khởi động lại)",
  "modernfix.config.wiki": "Mở wiki",
  "modernfix.message.reload_config": "Đã phát hiện thay đổi tệp cấu hình mod. Để ngăn việc tải các tệp chưa được lưu xong, việc tải lại phải được kích hoạt bằng cách chạy /mfrc.",
  "modernfix.option.on": "bật",
  "modernfix.option.off": "tắt",
  "modernfix.option.disabled": "vô hiệu hoá",
  "modernfix.option.enabled": "bật",
  "modernfix.option.mod_override": " bởi các mod [%s]",
  "modernfix.config.not_default": " (đã bị sửa đổi)",
  "asynclocator.map.locating": "Bản đồ (Định vị...)",
  "asynclocator.map.none": "Bản đồ (Không tìm thấy tính năng gần đó)",
  "modernfix.option.category.performance": "Hiệu năng",
  "modernfix.option.category.performance.description": "Các tính năng giúp cải thiện hiệu năng trò chơi/khởi chạy",
  "modernfix.option.category.bugfixes": "Sửa lỗi",
  "modernfix.option.category.bugfixes.description": "Các bản sửa lỗi cốt lõi để cải thiện tính ổn định của trò chơi",
  "modernfix.option.category.troubleshooting": "Khắc phục sự cố/Tiện ích",
  "modernfix.option.category.troubleshooting.description": "Các tính năng nhằm hỗ trợ chẩn đoán sự cố",
  "modernfix.option.category.expert_only": "Chỉ dành cho chuyên gia",
  "modernfix.option.category.expert_only.description": "Đừng thay đổi trừ khi bạn biết mình đang làm gì",
  "modernfix.option.name.mixin.perf.async_jei": "Tải JEI nền",
  "modernfix.option.mixin.perf.async_jei": "Chỉ 1.16. **Một tối ưu hóa quan trọng.** Các bản vá JEI để thực hiện tải lại của nó trên một chuỗi nền, loại bỏ hoàn toàn độ trễ lâu mà nó thêm vào tải thế giới.",
  "modernfix.option.mixin.perf.async_locator": "Chỉ 1.16. Backport các bản vá của mod Async Locator để loại bỏ tình trạng đóng băng máy chủ liên quan đến `/locate`, tạo loottable, v.v.",
  "modernfix.option.mixin.perf.biome_zoomer": "Chỉ 1.16. Tối ưu hóa nhỏ để cải thiện hiệu suất của bộ thu phóng quần xã sử dụng logic từ 1.18.",
  "modernfix.option.mixin.perf.blast_search_trees": "Tất cả các phiên bản. Nếu REI hoặc JEI được cài đặt, việc xây dựng cây tìm kiếm truyền thống cho tìm kiếm sáng tạo sẽ bị vô hiệu hóa và thay vào đó, việc tìm kiếm được thực hiện bằng cách sử dụng triển khai tìm kiếm của các mod này. Điều này giúp tiết kiệm vài giây trong quá trình tải thế giới và có thể cũng tiết kiệm một số RAM (mặc dù tôi chưa đo được).",
  "modernfix.option.mixin.perf.boost_worker_count": "Chỉ 1.16. Loại bỏ giới hạn mã hóa cứng đối với số lượng luồng công nhân, tương tự như những gì Mojang đã làm trong 1.18.",
  "modernfix.option.mixin.perf.cache_blockstate_cache_arrays": "Tất cả các phiên bản. Tránh tạo các bản sao mới của mảng enum mỗi khi bộ nhớ đệm khối trạng thái được khởi tạo. Tối ưu hóa nhỏ nhưng dễ thực hiện.",
  "modernfix.option.mixin.perf.cache_model_materials": "Tất cả các phiên bản. Ghi nhớ bộ sưu tập `RenderMaterial` (kết cấu) và danh sách phần phụ thuộc mà các mô hình trả về thay vì yêu cầu chúng phải tính toán lại theo từng yêu cầu. Giúp đẩy nhanh quá trình tải/nướng mô hình.",
  "modernfix.option.mixin.perf.cache_strongholds": "Tất cả các phiên bản. Lưu danh sách các vị trí pháo đài  đã tạo cùng với thế giới, thay vì tạo lại nó sau mỗi lần tải thế giới. Tiết kiệm một chút thời gian với 1.16 và nhiều hơn một chút với 1.18 và 1.19.",
  "modernfix.option.mixin.perf.cache_upgraded_structures": "Tất cả các phiên bản. Nhiều mod cung cấp các tệp cấu trúc lỗi thời, yêu cầu trò chơi phải nâng cấp chúng bằng DFU mỗi khi chúng được tải. Điều này có thể khá chậm. Bản vá này bổ sung logic để lưu phiên bản nâng cấp của cấu trúc và sử dụng lại nó trong lần tải tiếp theo. Để xử lý trường hợp mod thay đổi cấu trúc tệp nhưng không thay đổi tên, hàm băm của tệp gốc sẽ được so sánh với phiên bản đã lưu trong bộ nhớ cache và nếu chúng không khớp với cấu trúc sẽ được nâng cấp lại.",
  "modernfix.option.mixin.perf.compress_biome_container": "Chỉ 1.16. Tối ưu hóa nhỏ mượn từ Hydrogen, cố gắng tiết kiệm không gian trong thùng chứa quần xã khi có thể. Cài đặt này sẽ tự động bị tắt nếu các mod xung đột như BetterEnd hoặc Chocolate được cài đặt.",
  "modernfix.option.mixin.perf.datapack_reload_exceptions": "Tất cả các phiên bản. Giảm spam nhật ký và có thể cải thiện một chút tốc độ tải bằng cách không in stacktrace đối với một số trường hợp ngoại lệ thường gặp trong quá trình tải lại gói dữ liệu (ví dụ: thiếu vật phẩm trong bảng lợi phẩm/công thức nấu ăn). Tin nhắn vẫn được in.",
  "modernfix.option.mixin.perf.dedicated_reload_executor": "Tất cả các phiên bản. Di chuyển tải lại gói tài nguyên và gói dữ liệu sang nhóm công nhân chuyên dụng thay vì sử dụng các luồng `Worker-Main` mặc định. Điều này cho phép các mod Khởi động mượt mà vẫn có khả năng cải thiện hiệu suất chơi đơn trong thời gian chạy trong khi không làm chậm quá trình khởi chạy do số lượng luồng hạn chế.",
  "modernfix.option.mixin.perf.deduplicate_location": "Tất cả các phiên bản, nhưng bị tắt theo mặc định do ảnh hưởng đến thời gian tải. Loại bỏ trùng lặp các không gian tên và đường dẫn vị trí tài nguyên. Điều này giúp tiết kiệm RAM nhưng cũng làm tăng chi phí xây dựng `ResourceLocation` mới lên khá nhiều.",
  "modernfix.option.mixin.perf.dynamic_dfu": "Tất cả các phiên bản. Sửa đổi quá trình khởi tạo DFU để xảy ra lần đầu tiên cần nâng cấp thứ gì đó. Điều này nghe có vẻ tương tự như LazyDFU nhưng được triển khai rõ ràng vì nó tránh tải *bất kỳ* cấu trúc dữ liệu/lớp DFU nào, trong khi LazyDFU chỉ vô hiệu hóa tối ưu hóa quy tắc. Về cơ bản, tùy chọn này là phiên bản an toàn hơn của DataFixerSlayer vì nó vẫn sẽ tải DFU khi cần.\n\nBạn thường nên tiếp tục sử dụng LazyDFU ngay cả khi đã bật tùy chọn này, nếu không thì tối ưu hóa quy tắc DFU sẽ gây ra độ trễ.",
  "modernfix.option.mixin.perf.dynamic_resources": "Tất cả các phiên bản. Xem https://github.com/embeddedt/ModernFix/wiki/Dynamic-Resources-FAQ.",
  "modernfix.option.mixin.perf.dynamic_structure_manager": "Tất cả các phiên bản. Cho phép trò chơi hủy tải các tệp cấu trúc sau khi quá trình tạo kết thúc thay vì giữ cho chúng được tải mãi mãi.",
  "modernfix.option.mixin.perf.fast_registry_validation": "Tất cả các phiên bản. Forge không cần phải tra cứu một phương thức thông qua phản chiếu mỗi khi sổ đăng ký được xác thực. Bản vá này chỉ lưu trữ giá trị được trả về vì nó sẽ giống nhau mọi lúc.",
  "modernfix.option.mixin.perf.faster_font_loading": "Tất cả các phiên bản. Tối ưu hóa trình kết xuất phông chữ để tải phông chữ nhanh hơn, tăng tốc độ tải lại tài nguyên.",
  "modernfix.option.mixin.perf.faster_item_rendering": "Tất cả các phiên bản. Tránh hiển thị các cạnh của các vật phẩm trong GUI. (Có, vanilla dường như làm được điều đó.)\n\nĐiều này có thể tăng gấp ba FPS với một mod như REI/JEI được cài đặt trên GPU yếu hơn, nếu có đủ vật phẩm. Bị tắt theo mặc định vì nó mới và chưa được thử nghiệm nhiều nhưng phải an toàn. Vấn đề rất có thể xảy ra là các vật phẩm hoàn toàn không hiển thị được trong GUI hoặc xuất hiện phẳng trên thế giới.",
  "modernfix.option.mixin.perf.faster_texture_loading": "Tất cả các phiên bản trước 1.19.4. Tránh đọc kết cấu hai lần (lần đầu tiên sử dụng đường dẫn mã rất chậm) và thay vào đó tải nhanh hơn một lần (tương tự như 1.19.3+).",
  "modernfix.option.mixin.perf.faster_texture_stitching": "Tất cả các phiên bản. Cho phép trò chơi sử dụng hệ thống ghép kết cấu nhanh hơn do SuperCoder79 viết ban đầu cho lwjgl3ify trên 1.7.10, hệ thống này có thể tiết kiệm thời gian trong khi tải. Hiếm khi, người ta báo cáo rằng nó gây ra hiện tượng kỳ lạ trên các khối hoặc trong GUI, đây có thể là lỗi Sodium.",
  "modernfix.option.mixin.perf.jeresources_startup": "Chỉ 1.16. Tối ưu hóa Just Enough Resources để không cần phải tạo lại các thực thể dân làng nhiều lần cho cùng một nghề, giúp tiết kiệm thời gian trong quá trình khởi động JEI.",
  "modernfix.option.mixin.perf.kubejs": "Chỉ 1.16. Tối ưu hóa KubeJS để tránh sao chép `ItemStack` không cần thiết, v.v., giúp giảm thời gian tải gói dữ liệu.",
  "modernfix.option.mixin.perf.model_optimizations": "Tất cả các phiên bản. Triển khai các tối ưu hóa để tăng tốc quá trình tải mô hình.",
  "modernfix.option.mixin.perf.nbt_memory_usage": "Tất cả các phiên bản. Sử dụng bản đồ sao lưu hiệu quả hơn cho các thẻ NBT phức hợp gây loại bỏ trùng lặp tên khóa và cũng sử dụng bản đồ mảng cho các tổ hợp rất nhỏ. Điều này làm giảm chi phí lưu trữ nhiều thẻ phức hợp trong bộ nhớ.",
  "modernfix.option.mixin.perf.nuke_empty_chunk_sections": "Chỉ 1.16, lấy cảm hứng từ Hydrogen. Tránh lưu trữ các phần đoạn khúc đầy không khí trong bộ nhớ, thay vào đó đánh dấu chúng là trống.",
  "modernfix.option.mixin.perf.reduce_blockstate_cache_rebuilds": "Tất cả các phiên bản. **Tối ưu hóa quan trọng.** Các phiên bản Minecraft mới hơn (sau 1.12) đã triển khai hệ thống bộ nhớ đệm blockstate để lưu trữ thông tin được sử dụng thường xuyên về trạng thái khối, chẳng hạn như liệu nó có rắn hay không, hình dạng va chạm của nó, v.v. Việc xây dựng lại bộ đệm này khá nhanh trong vanilla (chỉ mất một hoặc hai giây) nhưng khá chậm khi cài đặt nhiều mod, vì có nhiều trạng thái khối hơn trong trò chơi mà tất cả đều phải xây dựng lại bộ nhớ đệm.\n\nVấn đề này càng trở nên trầm trọng hơn bởi Forge khi bộ nhớ đệm được xây dựng lại tại nhiều thời điểm khi dữ liệu gần như chắc chắn sẽ không được sử dụng trước lần xây dựng lại tiếp theo. Các ví dụ bao gồm ngay trước khi truy cập menu chính (trong giai đoạn \"Đóng băng dữ liệu\") cũng như nhiều lần (!) khi một thế giới đang được tải.\n\nModernFix giải quyết tắc nghẽn hiệu suất này bằng cách thay vào đó khiến quá trình xây dựng lại bộ nhớ đệm trở nên lười biếng. Mỗi blockstate sẽ xây dựng lại bộ đệm của nó vào lần đầu tiên dữ liệu được truy cập. Tại bất kỳ thời điểm nào khi vanilla hoặc Forge cố gắng xây dựng lại bộ nhớ đệm cho tất cả các trạng thái khối, thay vào đó, thao tác này sẽ được chuyển hướng để vô hiệu hóa bộ nhớ đệm trên từng trạng thái khối.\n\nĐiều này sẽ không có bất kỳ tác động nào đến TPS sau khi quá trình khởi động kết thúc.",
  "modernfix.option.mixin.perf.remove_biome_temperature_cache": "Tất cả các phiên bản. Loại bỏ bộ nhớ đệm nhiệt độ quần xã giống như Lithium thực hiện trên các phiên bản hiện đại.",
  "modernfix.option.mixin.perf.resourcepacks": "Tất cả các phiên bản. **Tối ưu hóa quan trọng.** Việc khởi chạy trên các phiên bản hiện đại bị tắc nghẽn nặng nề do quyền truy cập hệ thống tệp. Nhiều yêu cầu thường được thực hiện đối với các gói tài nguyên để liệt kê các tài nguyên hoặc kiểm tra xem một tài nguyên nhất định có tồn tại hay không và mỗi yêu cầu này đều dẫn đến lệnh gọi API tệp rất chậm.\n\nModernFix loại bỏ hoàn toàn hầu hết tắc nghẽn ở đây bằng cách chỉ cần lưu vào bộ nhớ đệm danh sách tất cả tài nguyên tồn tại trong gói tài nguyên do mod cung cấp và vanilla. Bộ nhớ đệm được xây dựng lại khi tải lại tài nguyên (ngoại trừ tài nguyên vanilla, vì chúng không bao giờ thay đổi khi trò chơi đang chạy).\n\nKhông có vấn đề tương thích nào được biết đến với bản vá này ngoại trừ OptiFine (tài nguyên CTM của nó không tải chính xác) . Tuy nhiên, tôi không khuyên bạn nên sử dụng OptiFine trong bất kỳ trường hợp nào vì nó sẽ tự tăng thêm vài phút để khởi chạy và hoàn toàn không được thử nghiệm với ModernFix.",
  "modernfix.option.mixin.perf.reuse_datapacks": "Chỉ 1.16. Cố gắng tăng tốc độ chuyển đổi giữa các thế giới chơi đơn bằng cách bỏ qua quá trình tải lại gói dữ liệu khi có thể. Có thể gây ra sự cố tương thích với một số mod nhưng hiện được bật theo mặc định.",
  "modernfix.option.mixin.perf.rewrite_registry": "Tất cả các phiên bản. **Hiện tại đã bị hỏng một phần.** Thay thế mạnh mẽ một số nội bộ của hệ thống đăng ký Forge bằng các phiên bản nhanh hơn, tuy nhiên hiện tại nó gây ra tình trạng treo khi tải một số modpack. Tắt theo mặc định vì lý do rõ ràng.",
  "modernfix.option.mixin.perf.skip_first_datapack_reload": "Chỉ 1.16 và 1.19. **Tối ưu hóa quan trọng.**\n\nVào giữa chu kỳ phát triển 1.16, Forge đã vá lỗi trò chơi để tải lại gói dữ liệu hai lần khi tải một thế giới hiện có, nhằm khắc phục sự cố chuyển đổi ID quần xã. Thật không may, quá trình tải lại gói dữ liệu thường mất tới 30 giây và do đó điều này ảnh hưởng rất nghiêm trọng đến thời gian tải thế giới.\n\nModernFix thực hiện các thay đổi cần thiết để tránh việc tải lại này, dựa trên PR (Pull Request) #8163 của Forge chưa hoàn thiện.\n\nThay đổi này đã bị xóa bởi Forge trong 1.18, nhưng sau đó một bản vá tương tự đã được thêm *lại* vào 1.19 để sửa lỗi gói dữ liệu mod không được tải khi tạo thế giới chơi đơn mới. May mắn thay, sự cố là cục bộ trên màn hình tạo thế giới ở phiên bản 1.19 và các thế giới hiện tại chỉ yêu cầu tải lại một lần. Tuy nhiên, điều này vẫn làm tăng gấp đôi độ dài của độ trễ tăng đột biến khi nhấp vào \"Tạo thế giới mới\" trong 1.19 và do đó ModernFix lại thực hiện các thay đổi để không thực hiện tải lại dư thừa.",
  "modernfix.option.mixin.perf.state_definition_construct": "Tất cả các phiên bản. Chỉ được bật nếu FerriteCore được cài đặt. Tận dụng khả năng xử lý các trạng thái khối của FerriteCore để tăng tốc độ tạo của chúng. Điều này có thể giúp tăng tốc độ khởi chạy với các mod bổ sung nhiều trạng thái khối, chẳng hạn như mod nội thất.",
  "modernfix.option.mixin.perf.sync_executor_sleep": "Tất cả các phiên bản. Tránh để luồng chính quay không hoạt động tiêu tốn một lõi CPU trong khi chờ quá trình tải mod hoàn tất.",
  "modernfix.option.mixin.perf.thread_priorities": "Tất cả các phiên bản. Điều chỉnh mức độ ưu tiên của luồng công nhân và máy chủ thấp hơn luồng máy khách. Điều này giúp cải thiện độ ổn định của FPS trên các máy có ít lõi CPU, miễn là việc triển khai Java được ưu tiên trong sử dụng.",
  "modernfix.option.mixin.perf.use_integrated_resources": "Chủ yếu là cho 1.16. Bản vá lỗi JEResources để sử dụng dữ liệu bảng lợi phẩm của máy chủ tích hợp nếu chơi đơn, thay vì tải lại các bảng lợi phẩm một cách vô nghĩa. Tiết kiệm thêm vài giây trong quá trình khởi động JEI.",
  "modernfix.option.mixin.bugfix.concurrency": "Các bản vá trong nhóm này khắc phục các sự cố liên quan đến đồng thời trong Minecraft và/hoặc Forge. Hầu hết chúng đều gây ra sự cố hiếm gặp, khó chẩn đoán trong quá trình tải.",
  "modernfix.option.mixin.bugfix.edge_chunk_not_saved": "Tùy chọn này là một bản port của mod Chunk Saving Fix của SuperCoder (vì lúc đó tôi không nhận ra rằng nó đã có sẵn cho Forge).",
  "modernfix.option.mixin.bugfix.mc218112": "Tùy chọn này khắc phục tình trạng bế tắc có thể xảy ra nếu có ngoại lệ được đưa ra trong khi xử lý dữ liệu thực thể. Vanilla không mở khóa chính xác trình quản lý dữ liệu khi cần thiết. Lỗi này được theo dõi với tên là MC-218112 trên trình theo dõi lỗi và đã được Mojang sửa trong 1.17.",
  "modernfix.option.mixin.bugfix.packet_leak": "**Thử nghiệm**, không được bật theo mặc định. Đã cố gắng khắc phục sự cố rò rỉ bộ nhớ xảy ra sau khi chơi đủ lâu trên 1.16.",
  "modernfix.option.mixin.bugfix.paper_chunk_patches": "1.18 và mới hơn. **Tối ưu hóa quan trọng.** Chuyển một bản vá từ Paper giúp khắc phục các sự cố trên 1.17 với việc tải đoạn khúc yêu cầu lượng bộ nhớ lớn và tạo ra nhiều phiên bản `CompletableFuture`. 1.18+ hiện có thể tải thế giới chỉ trên 400 MB bộ nhớ như 1.16.",
  "modernfix.option.mixin.bugfix.tf_cme_on_load": "Bản vá lỗi Twilight Forest để thực hiện thiết lập máy khách không an toàn theo luồng bằng cách sử dụng luồng chính, thay vì luồng công việc FML.",
  "modernfix.option.mixin.feature.branding": "Thêm ModernFix vào danh sách nhãn hiệu trên màn hình tiêu đề và cả màn hình F3.",
  "modernfix.option.mixin.feature.direct_stack_trace": "Thông thường được tắt, có thể được bật để buộc lưu stacktrace thô vào nhật ký khi xảy ra sự cố. Đôi khi, hệ thống báo cáo sự cố của vanilla không hoạt động bình thường và đưa ra trace/báo cáo stack hoàn toàn không liên quan.",
  "modernfix.option.mixin.feature.measure_time": "Sử dụng một vài lần tiêm để đo thời gian tải thế giới, thời gian tải lại gói dữ liệu, thời gian tải lại tài nguyên, thời gian khởi động và thêm các móc cần thiết để kích hoạt logic hồ sơ không được sử dụng của vanilla để tải lại tài nguyên nếu được định cấu hình.",
  "modernfix.option.mixin.feature.spam_thread_dump": "**Chỉ được sử dụng cho mục đích gỡ lỗi.** Làm cho kết xuất luồng được xuất ra nhật ký sau mỗi 60 giây. Điều này có thể giúp chẩn đoán tình trạng treo máy không giải thích được trong quá trình tải/chơi trò chơi.",
  "modernfix.option.mixin.bugfix.chunk_deadlock": "Nỗ lực ngăn chặn sự bế tắc của hệ thống đoạn khúc hoặc cung cấp thông tin gỡ lỗi bổ sung trong nhật ký khi chúng xảy ra. Những bế tắc này thường biểu hiện khi máy chủ bị đóng băng vô thời hạn (ví dụ: các thực thể không di chuyển), trong khi máy khách vẫn tiếp tục hoạt động bình thường.",
  "modernfix.option.mixin.bugfix.chunk_deadlock.valhesia": "Sửa lỗi Valhesia Structures để khắc phục sự cố trong mã của nó gây ra tình trạng bế tắc thường xuyên khi tải thế giới/tải chunk.",
  "modernfix.option.mixin.bugfix.cofh_core_crash": "Sửa lỗi sự cố đa luồng trong CoFH Core có thể gây ra sự cố hiếm gặp trong quá trình khởi chạy.",
  "modernfix.option.mixin.bugfix.ctm_resourceutil_cme": "Sửa lỗi sự cố đa luồng trong ConnectedTexturesMod có thể gây ra sự cố hiếm khi xảy ra trong quá trình khởi chạy.",
  "modernfix.option.mixin.bugfix.ender_dragon_leak": "Sửa lỗi sự cố rò rỉ bộ nhớ trong vanilla do rồng ender giữ lại tham chiếu đến thế giới khách trước đó.",
  "modernfix.option.mixin.bugfix.entity_load_deadlock": "Khắc phục nhiều vấn đề trong đó EntityJoinWorldEvent/EntityJoinLevelEvent gây ra bế tắc trên thế giới bằng cách trì hoãn tải thực thể một chút. Tuy nhiên, không gây ra bất kỳ thay đổi hành vi đáng chú ý nào trong trò chơi.",
  "modernfix.option.mixin.bugfix.fix_config_crashes": "Sửa lỗi cấu hình Forge đôi khi bị hỏng khi khởi chạy trò chơi.",
  "modernfix.option.mixin.bugfix.item_cache_flag": "Sửa lỗi MC-258939",
  "modernfix.option.mixin.bugfix.preserve_early_window_pos": "Làm cho cửa sổ trò chơi giữ nguyên kích thước hiện tại khi quyền kiểm soát được chuyển giao từ mã tải sớm của Forge sang mã Minecraft. Sửa lỗi dịch chuyển cửa sổ trở lại giữa màn hình sau khi bị kéo, v.v.",
  "modernfix.option.mixin.bugfix.refinedstorage.te_bug": "Sửa lỗi các khối lưu trữ bên ngoài của Refined Storage đôi khi không hiển thị nội dung của drawer, v.v. khi được tải. Bqn3 backport của Refined Storage PR #3435, chỉ áp dụng cho phiên bản 1.18 trở lên.",
  "modernfix.option.mixin.bugfix.remove_block_chunkloading": "Sửa lỗi zombie piglin giữ đoạn khúc 0, 0 được tải vĩnh viễn trên Forge. Bản backport của Forge PR #8583.",
  "modernfix.option.mixin.bugfix.starlight_emptiness": "Khắc phục sự cố Starlight không thường xuyên do bản đồ trống không được khởi tạo. Bản backport của bản sửa lỗi tương tự trong Starlight cho 1.18.x.",
  "modernfix.option.mixin.core": "Các bản vá cốt lõi cần có để ModernFix hoạt động",
  "modernfix.option.mixin.devenv": "Các bản vá được sử dụng khi chạy trong môi trường phát triển, để cải thiện tốc độ và/hoặc thử nghiệm",
  "modernfix.option.mixin.safety": "Các bản vá đồng thời để ngăn chặn sự cố trong quá trình khởi chạy",
  "modernfix.option.mixin.feature.integrated_server_watchdog": "Cũng thêm cơ quan giám sát vanilla vào thế giới chơi đơn, nhưng chỉ in ra stacktrace thay vì buộc phải chấm dứt thế giới. Phiên bản này bao gồm chức năng của Fullstack Watchdog, nhưng phiên bản sau vẫn cần thiết cho nhiều người chơi.",
  "modernfix.option.mixin.feature.snapshot_easter_egg": "Thêm các tính năng trứng phục sinh (không ảnh hưởng đến bất kỳ hình ảnh hoặc hành vi thông thường nào) khi chạy trên phiên bản snapshot.",
  "modernfix.option.mixin.feature.spark_profile_launch": "Nếu được bật và phiên bản Spark tương thích được cài đặt, toàn bộ trình tự khởi chạy sẽ được cấu hình cho đến menu chính.",
  "modernfix.option.mixin.feature.warn_missing_perf_mods": "Hiển thị cảnh báo khi khởi động nếu không có các mod hiệu suất khác được coi là cần thiết và có tính tương thích cao",
  "modernfix.option.mixin.launch.class_search_cache": "Thay thế công cụ tìm tài nguyên của Forge (dùng để tìm trò chơi và mã mod) bằng phiên bản nhanh hơn đáng kể, tăng tốc độ khởi chạy",
  "modernfix.option.mixin.perf.clear_fabric_mapping_tables": "Giảm mức sử dụng bộ nhớ bằng cách xóa các cấu trúc dữ liệu mapping trong Fabric Loader dư thừa hoặc hiếm khi được mod sử dụng. Tắt theo mặc định vì lý do tương thích.",
  "modernfix.option.mixin.perf.clear_mixin_classinfo": "Buộc tải tất cả các mixin khi quá trình khởi chạy kết thúc và sau đó xóa cấu trúc dữ liệu mixin để loại bỏ phần lớn dung lượng bộ nhớ của Mixin. Bị tắt theo mặc định vì lý do tương thích.",
  "modernfix.option.mixin.perf.deduplicate_wall_shapes": "Làm cho hầu hết các khối tường có cùng hình dạng đối tượng thay vì mỗi khối có bản sao riêng. Có thể giảm đáng kể mức sử dụng bộ nhớ khi nhiều khối tường được mod thêm vào.",
  "modernfix.option.mixin.perf.dynamic_resources.ae2": "Bản vá tương thích AE2 cho tài nguyên động",
  "modernfix.option.mixin.perf.dynamic_resources.ctm": "Bản vá tương thích CTM cho tài nguyên động",
  "modernfix.option.mixin.perf.dynamic_resources.rs": "Bản vá tương thích Refined Storage cho tài nguyên động",
  "modernfix.option.mixin.perf.dynamic_resources.supermartijncore": "Bản vá tương thích SuperMartijn642CoreLib cho tài nguyên động",
  "modernfix.option.mixin.perf.dynamic_resources.diagonalfences": "Bản vá tương thích Diagonal Fences cho tài nguyên động",
  "modernfix.option.mixin.perf.faster_advancements": "Viết lại logic kiểm tra nâng cao để nhanh hơn và không gây ra StackOverflowError trong các gói lớn. Bản port Advancements Debug từ Fabric.",
  "modernfix.option.mixin.perf.patchouli_deduplicate_books": "Sửa lỗi sách Patchouli lưu trữ nhiều vật phẩm trống bằng thẻ NBT, giảm mức sử dụng bộ nhớ.",
  "modernfix.option.mixin.perf.remove_spawn_chunks": "Loại bỏ hoàn toàn các đoạn khúc spawn khỏi trò chơi. Chúng không còn được tải nữa, không giống như Ksyxis.",
  "modernfix.option.mixin.perf.use_integrated_resources.jepb": "",
  "modernfix.option.mixin.perf.use_integrated_resources.jeresources": "",
  "modernfix.option.mixin.bugfix.blueprint_modif_memory_leak": "Sửa lỗi ObjectModificationManager của Blueprint làm rò rỉ tài nguyên vanilla, giảm mức sử dụng bộ nhớ. Mặc dù bản sửa lỗi đã được đóng góp trong PR #195 nhưng bản phát hành vẫn chưa được thực hiện.",
  "modernfix.option.mixin.bugfix.removed_dimensions": "Sửa lỗi trò chơi không tải được thế giới nếu mod thứ nguyên bị xóa. Bản backport của Forge PR #8959.",
  "modernfix.option.mixin.perf.compact_bit_storage": "Khắc phục tình trạng lãng phí bộ nhớ do một số máy chủ cũ (ví dụ: Hypixel) gửi các đoạn khúc trống như thể chúng chứa các khối. Giảm mức sử dụng bộ nhớ đáng kể trên các máy chủ này.",
  "modernfix.option.mixin.perf.deduplicate_climate_parameters": "Loại bỏ các đối tượng tham số khí hậu trùng lặp được hệ thống quần xã mới sử dụng, có thể tiết kiệm ~ 2 MB nhưng cũng làm chậm phần nào quá trình tải lại gói dữ liệu.",
  "modernfix.option.mixin.perf.dynamic_entity_renderers": "Xây dựng các mô hình thực thể ngay lần đầu tiên chúng được nhìn thấy thay vì trong khi khởi chạy. Một số mod không tương thích với tùy chọn này và sẽ gây ra sự cố cho EntityRenderer.",
  "modernfix.option.mixin.perf.twilightforest.structure_spawn_fix": "Khắc phục độ trễ do cấu trúc kiểm tra thế giới của Twilight Forest rất kém hiệu quả",
  "modernfix.option.mixin.perf.fast_forge_dummies": "Tăng tốc độ đóng băng sổ đăng ký Forge trong khi khởi chạy bằng cách sử dụng đường dẫn mã nhanh hơn",
  "modernfix.option.mixin.perf.tag_id_caching": "Tăng tốc độ sử dụng các mục thẻ bằng cách lưu vào bộ đệm đối tượng vị trí thay vì tạo lại nó mỗi lần",
  "modernfix.option.mixin.feature.disable_unihex_font": "Bỏ font Unicode, tiết kiệm 10MB nhưng khiến ký tự đặc biệt không kết xuất được"
}
